{"title":"emotion depressed, it is so bad but hard to control ....","thread":[{"content":"i didn't do anything and did not want to do anything last weekend just stay at home watching TV all day . didn't say ,didn't eat .... i know it is so bad but hard to control .... what's wrong with me ? i keep asking . hope i will be fine soon and everything will be fine soon.......","author":"clairelv","postID":"post1862626","date":"20150628-00:00:00 -0400","authorID":"http://ehealthforum.com/health/user_profile_721901.html"},{"content":"Claire, the occasional dumps are said to be normal. But when more often, i also keep asking. Others say we must take charge of our situations, not just allowing things to happen w/o control, at least to some extent. I skimmed thru your other post abt another child and think if it's just to please your child to have a sib, that is not reason enough. You may even adopt, w/ all the unwantd kids now, but as you said there are many considerations. If you truly have a big heart and willing to give a big chunk again, many have done it. But if not totally decided, you might as well find friends or relatives to interact w/ your child. There's a thread i passed by in another site i wanted to post the link to here, but since i cant, perhaps i will the OP. Its a little off topic, but refreshing and hopefully help us think more clearly abt things later. God's Creative Genius Take a few minutes to appreciate how amazing and complex God's creations are with me. The Alligator- Can survive for over a year without food. It does this by moving very slowly in the water, and burning almost no calories. The Hummingbird- The only bird in the world that can fly in any direction. It beats it's wings over 1000 times per minute. The Cheetah- Runs up to 75 mph. The Gecko- Exerts a special adhesive from it's feet, allowing it to climb on almost any surface. It also has the unique ability to save people money on car insurance. The Chameleon- Changes colors to blend in with it's environment. The Jellyfish-It can restart it's aging process by reverting back to polyp form, making them potentially immortal! The Woodfrog- Has anti-freeze blood alowing it to survive the winter by freezing, then thawing out in spring. The Salamander- Can regenerate lost limbs and even internal organs. The Basilisk Lizard- Can run on the surface of water. (Nicknamed the Jesus Lizard) The Angler Fish- Has an organic light attached to it's head used to attract prey and see in the dark. Romans 1:20- For since the creation of the world God's invisible qualities--his eternal power and divine nature--have been clearly seen, being understood from what has been made, so that people are without excuse. I have to laugh when people credit this stuff to \"mother nature\".","author":"samm00","replyTo":"post1862626","postID":"post1864204","date":"20150708-00:00:00 -0400","authorID":"http://ehealthforum.com/health/user_profile_707378.html"}],"URL":"http://ehealthforum.com/health/emotion-depressed-it-is-so-bad-but-hard-to-control-t455927.html"}