{"title":"My life has been one long mistake","thread":[{"content":"I feel my life is been one long mistake. I am 43 never married never had a long-term girlfriend weigh 350 pounds and have a job I hate. I'm going to get off of Facebook because I see all my friends my age with beautiful families living in huge houses attaining the American dream. I live in the same crappy house I bought when I was 26 ye and have a job I hate. I'm going to get off of Facebook because I see all my friends my age with beautiful families living in huge houses attaining the American dream. I live in the same crappy house I bought when I was 26 years old. I am the stupidest businessman in the world I had a great business in the financial services industry after struggling for over a decade I build something. My suppose it best friend talked me in the partnering up with him and I went to the firm he was working at and now he lives off of my commissions and doesn't do a thing. I am so stupid. I always make the wrong decision in life. I always rationalize my continued existence and I went to the firm he was working at and now he lives off of my commissions and doesn't do a thing. I am so stupid. I always make the wrong decision in life. I always on this planet I thinking I'm not as bad as a lot of people and I need to be here for my family. That's what's kept me going. Plus I would never have the guts to commit suicide. I know I would screw that up too and end up Living but mangling myself. I lost my father this year and it is been devastating. My Dad Love me for who I was and never cared that I could never start a family and bring him grandchildren because I wasn't good enough to get a woman. I live for my mom. But since I lost my father a big part of me has died. Just tired Love me for who I was and never cared that I could never start a family and bring him grandchildren because I wasn't good enough to get a woman. I live for my mom. But since I lost my father of going absolutely nowhere.","author":"Johnny1223","postID":"post1861084","date":"20150619-00:00:00 -0400","authorID":"http://ehealthforum.com/health/user_profile_725811.html"},{"content":"I'm sorry things aren't going well for you Johnnie. Do you have any passions? Anything you really like to do? Perhaps you can focus on those. I'm sure the love you have shown to your father and your mother was not a mistake. Many children aren't grateful to their parents and simply ignore them as soon as they are old enough to live on their own. You have been kind and loyal. That's something to someone. I wish you the best. Also, practical tip: listen to music. Listen to it loud. Find the music you love and listen to it again and again. It helps stop unhelpful negative thoughts.","author":"JT28","replyTo":"post1861084","postID":"post1861737","date":"20150623-00:00:00 -0400","authorID":"http://ehealthforum.com/health/user_profile_726105.html"},{"content":"Hi. I was passing thru a thread in another site. Found this interesting, and i hope not preachy. Sometimes i do point to some spiritual insights (wc i so need in fact) which might be helpful to others too. Title is Mental illness: Sin or an exception to the rule Quote Originally Posted by Elizabeth619 View Post If you look in psychology books or even google it you will see that about every sin mentioned in scripture can be seen a some type of mental disorder. Killing, lying, cheating, even worry(anxiety). If you know in your mind that what you are doing is a sin, but still do it due to mental illness is it still a sin? What is everyone's take on this? Ans. That's gets very complicated and is way beyond your state of mind. Those eight categories I mentioned? Here they are: Disruptive Mood Dysregulation Disorder: This is chronic, severe and persistent irritability in children Major Depressive Disorder, Single and Recurrent Episodes: Also known as major depression, clinical depression, or unipolar depression, the latter referring to the presence of one pole, or one extreme of mood or depressed mood. Persistent Depressive Disorder (Dysthymia): The key symptom is a depressed mood that occurs for most of the day, for more days than not, for at least two years. Premenstrual Dysphoric Disorder: Obvious Substance/Medication-Induced Depressive Disorder: Also obvious Depressive Disorder Due to Another Medical Condition, Other Specified Depressive Disorder, and Unspecified Depressive Disorder: Catchalls when the clinician is unable to fit the depressive mood into any of the other categories because not enough diagnostic criteria are met Depression is disease. Nothing more. Depression is not sin. The root cause of any anxiety or depressive mood disorder, or for substance abuse, can be sin, but it doesn't have to be, perhaps lying instead with brain chemistry or physical illness. Most clinicians will not call it sin, but they can treat the symptom/disorder. Any mood disorder, addiction issue, or personality disorder can potentially be an indicator of a spiritual need, but before it is determined it is a spiritual need, and before the need can be identified and addressed, the disorder must first be treated so as to assist the client in reaching down inside and dealing with the root cause.","author":"samm00","replyTo":"post1861084","postID":"post1861886","date":"20150624-00:00:00 -0400","authorID":"http://ehealthforum.com/health/user_profile_707378.html"},{"content":"Johnyy1223 - I'm sorry for all the hopelessness, and sadness you are feeling. I'm not you, so all I can do is offer you ideas that would work for me. I am going through another form of depression, which started after a really bad accident I had several years ago; leaving me with lots of daily pain, and unable to do so many things I’ve loved doing throughout my life! One thing that really gets me going are my hobbies. Unfortunately, I can’t walk too well, so there are things I can no longer do, but I’m trying to find alternatives! Get out and join/volunteer for things. This will get you out, introducing you to simply new and different types of people. Don’t focus on what you don’t have, but think of ways you can slowly improve what you already have. That is the problem with society today. Everything you see is so nice, and so much better then what we all have. This makes one feel down about their self and what they don’t have. I have a decent house, but I’m always comparing it to other friends’ houses. Then I’m feeling like “wow, I don’t have this, or I don’t have that!” Go out and redecorate your kitchen, then re-do your bedroom, etc. Eventually you will have spiced things up, and it’s very refreshing to change out things occasionally. That is a normal way of thinking. Treat yourself to getting a new look. Once a month go out and look for new jeans, or a shirt. If you always do the something, day in and day out, life becomes depressing and momentous! I hope maybe you can think about some ideas mentioned and take to heart! You are here for a reason and don’t give up hope!","author":"glxpassat","replyTo":"post1861084","postID":"post1862149","date":"20150626-00:00:00 -0400","authorID":"http://ehealthforum.com/health/user_profile_628535.html"},{"content":"Let me tell you that I spent most of my life not wanting to live it until I found someone who showed me what love really is. When you love someone it's despite their flaws because the affect they have on you makes you want to be a better person. The more I felt for him the more I felt for myself. All the while not realizing that what I needed he had given to me. And that was the only thing I could give to myself which was to love myself. I'm not always happy with me.. and at times maybe even hates me.. but now my time left could questioned and now I want to live. The man in question while being the best thing that ever happened to me is not in my life and is better off for it. I've been in an abusive marriage for 16 years with 4 children and didn't want to leave til he handle it. He use to always tell me he was just waiting on me to die before he could his life as if I was the one holding him hostage with bodily harm. He just might get his wish. But not without a fight. Listen life's hard and it's hardly ever fair and you can't always have what you want but all lives are precious and you shouldn't take for granted the life you have when others are fighting for theirs. I pray you find that person if you haven't already. It may not be a love interest even if you end up loving them with every fiber of your being. Just understand that it is all about perception and that changes depending on where your standing. So you have two sides negative and positive list them both on a peice of paper and see where your standing. And if it's on negative all those things you wrote find a way to move them over.","author":"lorascott1979","replyTo":"post1861084","postID":"post1862404","date":"20150627-00:00:00 -0400","authorID":"http://ehealthforum.com/health/user_profile_726017.html"}],"URL":"http://ehealthforum.com/health/my-life-has-been-one-long-mistake-t455455.html"}