{"title":"terminal depression","thread":[{"content":"Hey everybody. Decided to join this forum, because I feel like I'm out of options. I've been depressed for as long as I can remember, since I was 5 or 6. None of the meds I was put on ever helped, most just made me want to die, especially Cymbalta. I'm looking into the possibility of trying Cranial Electro Stimulation, but that probably is not going to help either. I feel like I'll never be free of this, I want so bad to either finally get better or just die! I came close to killing myself once, but I managed to hold on because of a promise I made to a friend( now estranged, which makes me wonder if a promise should be kept if the person you made it to doesn't care anymore?) I was wondering if anyone has tried any of those CES devices and/or vagus nerve stimulation and what were the results? :cry: Thanks in advance. P.S. The free mental health places in my area are absolutely worthless! I'd be willing to move to another planet if it would help me to feel better.","author":"thecursedpaladin","postID":"post913398","date":"20080729-00:00:00 -0400","authorID":"http://ehealthforum.com/health/user_profile_140850.html"},{"content":"I hope someone comes along that may be able to answer your question. I have never heard of it myself so i can't. Have you tried cognitive therapy though with a psychologist? It can be quite helpful.","author":"harmony1","replyTo":"post913398","postID":"post913481","date":"20080729-00:00:00 -0400","authorID":"http://ehealthforum.com/health/user_profile_133235.html"},{"content":"I repeat: THE MENTAL HEALTH SERVICES IN MY AREA ARE WORTHLESS! All anybody wants to do is shove worthless pills up my @@@. There is no real help or hope for me, not unless I had millions of dollars to pay out! I have to suffer until the day I die because of people's stupid greed! And this forum has been a REAL HELP! Shooting my self is too messy, maybe there is something painless but clean..... Seems the only answer left really, because there seems to be no hope for me.","author":"thecursedpaladin","replyTo":"post913398","postID":"post927896","date":"20080904-00:00:00 -0400","authorID":"http://ehealthforum.com/health/user_profile_140850.html"},{"content":"I too have had a mental disorder for a lot of my life. I was 11 when the first symptoms began but I wasn't diagnosed until after my 18th birthday because the Queensland medical health system doesn't believe in diagnosing minors with a mental disorder...or so I am led to believe. My teen years were a struggle because of this. From over doses to self mutilation, not bathing or leaving the house let alone my bed, I have been through my own version of dysthymia. The Ultimate highs and chronic lows and feeling like there is nowhere on earth that I would be happy to exist. Wishing that I just wouldn't wake up in the morning so that I wouldn't have to deal with another day. I thought about all the ways I could kill myself and really wanted to go through with it but through it all and even with the feeling that I am going to be like this for the rest of my life and on meds for the rest of my life I am still here and remind myself how glad I am to be here everyday. The thing I keep telling myself is that if I had of killed myself one of those times I desparatly wanted to, I would have missed so much beauty in my life. I met my loving husband and three months ago gave birth to a beautiful baby girl who I am so proud of. Looking at this little precious life as I hold her sleeping in my arms I realise that I wouldn't give this up for anything and that my life is worth something. My purpose, I believe, and the very reason I am still in existence is to be the best Mum I can be to this little girl and make sure she grows up with a different child hood to mine. One that is loving and nurturing and help her to see all the beauty in the world in the hope that she will have a most amazing life from beginning to end. As time has gone by, I have helped myself to get through this by trying to be as positive as I possibly could. The \"change your thinking\" method has helped me. It hasn't \"cured\" me by any means but it has been a help to me in my situation. I sincerely hope that one day you too find something or someone in your life that makes you feel as worth while and amazing as I do when I look at my daughter. Although I haven't heard of the electronic thing before or know anything much about your situation the bit of advice that I hold dear to me is- no matter how shitty life gets and how hard it is to hold on, always hold on for one more day because you just don't know what beauty you might miss or if you could miss the very thing to turn your life around. Hang in there, your life is worth every last bit of your energy and the world is worth living in. I wish you the best of luck and feel free to PM me if you would like to talk to me more. Please take care. Becky","author":"Dragonfly_21","title":"Dear The Cursed Paladin","replyTo":"post913398","postID":"post927921","date":"20080904-00:00:00 -0400","authorID":"http://ehealthforum.com/health/user_profile_144634.html"},{"author":"updownman","replyTo":"post913398","postID":"post928496","date":"20080905-00:00:00 -0400","authorID":"http://ehealthforum.com/health/user_profile_133358.html"},{"content":"Does my depression lift? No. There's bad days and then there's really god awful days. Paxil? Prozac? CYMBALTA?! Don't even get me started! I only remember one brief period of happiness, one sheer terrifying week of joy: when I fell in love. But, it seems that experience only happened so I could feel even more pain. She belonged to someone else. To paraphrase Decartes: I feel, therefore I hurt. When does this end? How long before I cut too deep, and can't stop the bleeding? I've only nicked myslef a couple of times, real shallow, but I'm frightened a little, because I haven't done anything like that in years. To make things worse, I think the girl I'm with, may be a part of the problem.","author":"thecursedpaladin","replyTo":"post913398","postID":"post928973","date":"20080906-00:00:00 -0400","authorID":"http://ehealthforum.com/health/user_profile_140850.html"},{"content":"Michael99, changes can be made, in fact it is the only consistency in our lives. We change every second of every day. Has nothing to do with age, bad choices, or any physiological issue. Depression is only an emotional pattern, it can be changed very quickly for anyone who suffers from it. The only problem is, psychiatry and the like is less about change and more about drugs, therefore its affects are always questionable. Truthfully, when someone has a 'break through' as a result of seeing their 'doctor' for a few years, they person themselves are the actual source of the change, not really anything the shrink did. Look at the father of psychology, as intelligent as he was and as much as he understood about the emotions, liked his cocaine and believed it to be an answer for a lot of emotional problems. Seems to have rubbed off on his followers, the only difference is they have come up with more complex substances. Also, you should not be suggesting suicide as a 'reasonable choice' to a person who suffers from severe depression. Maybe you should examine your own \"conscience\". You were right about one thing, depression is not a disease. Best wishes...","author":"Elevation","replyTo":"post913398","postID":"post1114645","date":"20091029-00:00:00 -0400","authorID":"http://ehealthforum.com/health/user_profile_229321.html"},{"content":"I do not think I missed your point at all, but maybe... I'm sure you could explain how you got depressed in probably less than two hours. If you care, I have the time and would be more than willing to listen. I agree it is unlikely an individual would end their life because of some meaningless comment on a forum like this, although for the life of me I cannot understand why anyone would offer such a suggestion. I do though disagree that it takes \"courage\", but rather the loss of all courage. It takes much more courage to face and solve your problems, in spite of the pain associated to them. It is not really that feeling like a failure is \"wrong\", but more a matter of if it is helpful or not. Edison had 9,999 reasons to feel like a failure, but chose not to do so; he understood that sinking feeling would not assist him in achieving his desire. The feeling of failure is an 'action' signal. This is something you wisely indicated in the beginning of your earlier post. Unfortunately, too many people are naturally inclined to ignore the messages unwanted feelings provide, and focus their entire attention on the reason that caused the feeling in the first place. This tends to deepen the state while simultaneously creating new associations to the emotion that will insure it shows up again. I do wish to emphasize one thing, there is no justification for suicide, just as there is no justification for you advocating it to someone who is looking for help. If an individual truly wanted to be gone, they would be gone. People come to sites like this talk about their problems or get advice, and they usually receive only positive encouragement; maybe they even believing some of it may help them in their situation. While your statements may not influence them, they certainly did not inspire any change. Try to consider that before recommending suicide as a \"reasonable choice\", or as the only alternative to being tormented by a psychiatrist. Michael, I do hope you are able to overcome what is haunting you. Without knowing you at all, I would do all I could to assist you in that effort, and I mean that sincerely.","author":"Elevation","replyTo":"post913398","postID":"post1118160","date":"20091106-00:00:00 -0500","authorID":"http://ehealthforum.com/health/user_profile_229321.html"},{"content":"I've noticed that you are willing to answer a posting which you have already censored. You say there is no justification for suicide. To begin with the majority of people in most western nations disagrees with you. I wonder why? Yes, suicide is not always the best answer for all people but it is the only answer for some people. Telling me that I lack a \"conscience\" would be laughable if it didn't imply that suffering should be inflicted on people who do not want it. What happened to personal liberty? Like any psychiatrist or politician for that matter you seem to claim the right to force your will on the lives of strangers. Again I didn't say I \"enjoy\" the idea of anyone ending their life only that if necessary then this freedom should be available to adults. Such a state of affairs would be an improvement over the present situation of suicide by violent means. Some suicides are due to the policies of governments which destroy lives. Perhaps, just perhaps, if it were easy for citizens to \"withdraw their custom\" then pressure would build to STOP these.","author":"michael99","title":"more on suicide","replyTo":"post913398","postID":"post1121778","date":"20091114-00:00:00 -0500","authorID":"http://ehealthforum.com/health/user_profile_229813.html"},{"content":"Now you could say I am \"missing your point\". Not sure what you mean by \"censored\", so I cannot respond to that statement. As for a \"justification\" for suicide, perhaps I should have been more clear. I can understand the many reasons why a person would decide to end their own life. However, forming a good 'reason' in ones mind does not mean it is a justified act - the right thing to do. The statement that suicide, \"is the only answer for some people\" is incorrect. It is not unlike the fly who beats itself against the glass trying to get out, it knows what it wants, but lacks strategy. People who commit suicide do not see a way out of their pain, but this does not prove there is no way; they lack strategy. I did not say that you \"lack conscience\", but was suggesting that perhaps you should examine your own before implying suicide is a viable solution to someone who is obviously seeking another way. My statement by no stretch of the imagination implied any suffering should be inflicted. It may be that you do not understand the meaning of the word \"conscience\". The right to be happy or sad is yours, and you need permission from no person to claim either. A government, a doctor, or a great friend cannot make you or prevent you from feeling anything.","author":"Elevation","replyTo":"post913398","postID":"post1122409","date":"20091116-00:00:00 -0500","authorID":"http://ehealthforum.com/health/user_profile_229321.html"},{"content":"Some of the earlier postings I put up have disappeared. Since I didn't remove them I must someone else did. That is what I mean by censorship. \"Forming a reason in one's mind\" also doesn't mean that it is wrong either. But you assume that suicide is always wrong. I say that it not a good idea in many instances but is justified in some. That is simply obvious. To say there is \"always an answer\" is an ideological belief not a statement of fact. Suffering is inflicted on people and if it can't be avoided then some people will take the only way out.","author":"michael99","replyTo":"post913398","postID":"post1122466","date":"20091116-00:00:00 -0500","authorID":"http://ehealthforum.com/health/user_profile_229813.html"},{"content":"Michael, this conversation is going absolutely nowhere. You are all over the place, and I cannot keep up with you, nor do I actually want to. However, I will respond to you one last time. First, I see that your post are gone, but for you to assume that I have some magical power or secret button to remove them, perhaps gives some indication as to why you keep responding in such a fashion. It may be that a moderator with that secret button read them and thought as I did, 'totally inappropriate'; just a guess on my part. Second, I have not referred to any reason for life or death as right or wrong, if I recall that has been your own statements. I have simply said and will repeat, it is not really if it is right or wrong, but is it helpful or not. I stated this in response to something you said about feeling like a failure. I will state for you now though, that suicide is not helpful to gaining happiness and/or peace of mind. Third, I did not say there is \"always an answer\", so your quotes are not accurately used. However, there is a way out of depression just as there is a way in, quote that if you choose. This is not ideological but fact, rather you can understand it or not. For clarity I will explain: There are only three things that ultimately control emotions unless there is something physically wrong with the nervous system, or the way the brain is hard wired. 1. What a person focuses their attention on will determine how they feel. 2. The mental language they use to describe something to themselves, what questions they are asking in their head, and what statements they are making to themselves. This will produce emotions. 3. How they are using their physical body, what posture they are using, how they are breathing, etc. This will determine emotional response. These three things are what determines the experience of emotions, and has been proven in countless studies throughout history; not to say something outside ourselves cannot influence our emotions but inevitably we decide by use of these three factors what emotions we experience. This is human psychology, rather you can or choose to understand is of no consequence. You seem to be looking for or expecting someone to say it is acceptable for someone to commit suicide because they are depressed. I am not that person, and I find it highly doubtful you will find any reasonable person to agree with you on that. Best of luck to you, cheers.","author":"Elevation","replyTo":"post913398","postID":"post1122527","date":"20091116-00:00:00 -0500","authorID":"http://ehealthforum.com/health/user_profile_229321.html"},{"content":"Try moving to an environment perhaps In a desperate 3rd world country where your days will be consumed by helping those in need to help them survive. It will get your mind off your own depression and perhaps drive home the value of living.","author":"zoltar1","title":"Think outside yourself","replyTo":"post913398","postID":"post1757493","date":"20130926-00:00:00 -0400","authorID":"http://ehealthforum.com/health/user_profile_655599.html"},{"content":"Hope can be found in a single blade of grass. In the blues of the sky in the stars shining overhead, in the sheer beauty that is all around you in the beauty of life abound, I don't know what you are dealing with but I hope this helps.","author":"lifeabound","replyTo":"post913398","postID":"post1820120","date":"20140806-00:00:00 -0400","authorID":"http://ehealthforum.com/health/user_profile_701422.html"},{"content":"i feel the same way 40+ years with MDD..now thery tell me i have APD too.. they just keep giving me new meds everytime i see them..i'm stopping them all now and feel no different..!**@! this life","author":"nomorecloseness","replyTo":"post913398","postID":"post1862595","date":"20150628-00:00:00 -0400","authorID":"http://ehealthforum.com/health/user_profile_726500.html"}],"URL":"http://ehealthforum.com/health/terminal-depression-t149735.html"}