{"title":"Depressed because I'm ugly. (Page 1)","thread":[{"content":"I have all these feelings bottled up inside me and I don't want to express them with anyone I know because I feel too ashamed and embarrassed by it so I will be sharing it with you. I also don't tell my parents because I don't want them to treat me differently because it will seem just too fake. I'm 21 years old, a male and almost 22. I've never had a girlfriend before and barely have any friends anymore because I chose to isolate myself after high school. Anyway, I am ugly, and it's not a mental problem at all. I've been told I'm ugly all my life, I've never had anyone compliment my physical appearance before, so of course I'm going to think I'm ugly. Although that explanation can mean that it's a mental problem, but when I look at myself in photos and such, I can truly tell how ugly I look. I can't stand the way I look. With pictures of me standing with people, I can clearly see the deformities or how abnormal my overall face structure is. Because of this, I've isolated myself from the world almost. I stay in my room using my computer almost the entire day everyday. I've become quite sensitive, so sensitive that I can't even take a joke from my friends about my appearance. Every little comment makes me totally depressed. Whatever girls like about a guy(physically) I have the exact opposite features. To make things worse my little brother who is 18 is the exact opposite of me. He's tall, handsome, looks like a model and is nominated to be prom king. He's always with a bunch of girls and it really makes me feel like crap. What did I do to suffer from this horrible life and what did my brother do to have such a great life? It's really not fair. I don't blame anyone for not liking my face, it's totally natural. I actually feel disappointing in myself for being so shallow. I nitpick at everything about my face. Whenever I'm around goodlooking people, I try to hide myself or leave because I'm scared of what they think of me. I get treated like a second class citizen everywhere I go. It's really hard for me to continue with this life because I'm not getting anything out of it. It's a boring life. I've never had any serious suicide thoughts before. It's only been recently but it's still not that serious. A month ago my mom bought a brand new car for me. A normal person would be excited and happy but I didn't make much out of it. In fact I think it's made me even more depressed because it reminds me of how I have nowhere or no one to go to. No one to show it off to. The car has been rendered useless. Anyway, I don't think I'll ever be happy and I don't see the point in living anymore since I'm not getting anywhere in life. Thanks for reading, I don't want anyone to feel sorry for me because that'll just make me feel worse.","author":"Mudig","postID":"post1185572","date":"20100328-00:00:00 -0400","authorID":"http://ehealthforum.com/health/user_profile_264951.html"},{"content":"Make yourself look as good as you can and be content...Many young people no longer get married....The main thing is for you to get out among people...Take on the role of a leader....Find the confidence that you are missing inside....What makes you think that a girlfriend will make you happy?....I think that this is so neat about the \"new world\" and that being nobody expects anyone to get married or settle down...Do your thing...Get out and help people...Don't close yourself off in a room...Find your nitch in life and go with it....Good luck... Caroline","author":"CarolineEF","replyTo":"post1185572","postID":"post1185814","date":"20100329-00:00:00 -0400","authorID":"http://ehealthforum.com/health/user_profile_220777.html"},{"content":"i dont look great, everyone has flaws. i hope you dont think that all us girls think about is the way someone looks? i for one dont give a damn, you sound like you have a lovely personality, get out there and show it i hope your ok, i feel terrible quite alot, and up until last year i didnt leave my room at all, now i think all i need is a pint and someone to talk to right? go out and just have FUN. who gives a damn how you look? the remedie is happiness. if you can be happy, then no one can shoot you down","author":"dontworrybehippy","replyTo":"post1185572","postID":"post1186279","date":"20100330-00:00:00 -0400","authorID":"http://ehealthforum.com/health/user_profile_265345.html"},{"content":"What you said is so true.Tonite a guy really talked about me bad called me every name in the book and told me that i need to go look at myself in the mirror cause i was ugly and stupid. Not to long ago he told me that i was beautiful. But i realize it doesn't matter what people say about at first it hurted my feelings but who cares if nobody thinks ur beautiful no for youself that you are beautiful. Live life to its' fulliest.","author":"Lashayquisha","title":"Love yourself and be happy...You are somebody","replyTo":"post1186279","postID":"post1349106","date":"20110412-00:00:00 -0400","authorID":"http://ehealthforum.com/health/user_profile_359625.html"},{"content":"Hi Mudig, dontworrybehippy said it very nicely. It is all about self-esteem . There are many \"ugly\" people out there but because they have a healthy self-esteem, it doesn't really matter that much. Their self-acceptance and positive attitude towards themeselves radiates out of them , giving them a great charisma and people like and love them. So, the first step is to accept yourself the way you are . There is no need to feel that it is unfair not to have a pretty face. But perhaps you'll come to realize one day that there is far more to life than what meets the eye . There is a deeper meaning to everything and it may be a great challenge for you to understand the life lessons this is offering to you. I know, we live in a society where the cult of the body is worshipped. But not everyone is like that, as dontworrybehippy has pointed out to you. Besides that, just have a look at how many \"beautiful\" people are there who have the \"brain of a chicken\" and yet they make great stars out of themselves. What is in your heart is truly important. Your inner purity which will give you compassion, the inner strength and self-assurance. And this will attract everything you need to live a happy and fulfilling life. Merrick","author":"Merrick1","replyTo":"post1185572","postID":"post1186726","date":"20100331-00:00:00 -0400","authorID":"http://ehealthforum.com/health/user_profile_257676.html"},{"content":"hello, i am a girl and only 13 but i still understand you. the only reason you have no friends is because you chose it. Dont think of what people will think of you because there thoughts arent going to bring you any where in life. i think you should go out and make friends by going to a fun place. go on vacation. and i noticed bottling things up inside of you makes EVERYTHING worse . it is a god thing that you wrote this. whenever i feel bad about myself i usually tell my BFF and she helps me out. i think i am ugly too but some people call me pretty and some people call me ugly. everyone has different opinions. if you still feel bad about yourself you shouldnt really i mean how cares about looks i mean i know alot of bad looking people that i think are pretty just because of the way they act or the way the person is for example if i see an ugly girl that is funny i automatically think shes pretty because of her personality","author":"sanam33","replyTo":"post1185572","postID":"post1226190","date":"20100628-00:00:00 -0400","authorID":"http://ehealthforum.com/health/user_profile_287872.html"},{"content":"Wow that is one ginormous pit you have dug for yourself. To hear you tell it there is no way out. Let me help you out here. Happiness comes from acceptance of yourself and life and meaningful connection with others. not from competing with others and feeling that you are better than them. Its great that your brother is popular with the ladies. love him for it and you won't be distant from him. its cool that you think your ugly as long as you are ok with it. Its not that people don't want to be around ugly people its that they don't want to be around negative people that they feel uncomfortable around. you just need to find something to do that you like and that makes you feel good about yourself. and till you find something that you like do something that you don't that takes you out of your comfort zone. if only to show yourself that you can. and don't give up or be hard onyourself if you can't at first just use the desire to be happy to keep trying. success and happiness is in the trying.","author":"BlackFreeman","replyTo":"post1185572","postID":"post1240096","date":"20100727-00:00:00 -0400","authorID":"http://ehealthforum.com/health/user_profile_295351.html"},{"content":"Hi Mudig. I am a 20 year old male who can empathise to a certain extent with how your feeling. I have those days were i feel as though i don't want to leave the house, i feel so angry and upset with myself for the opportunities i have missed due to my insecurities. I do however have days in which i feel drastically different and have all the confidence in the world, and you know what, very little changes about my appearance. Its all a state of mind, if you choose to possess a negative mindset then by the sounds of it you have enough time on your hands to make the most secure of us question themself. Now im going to have to revert back to cliches here but they really are true. Focus on the positives, what makes you distinctive and you essentially? Realise that the vast majority of people you will meet have feelings similar to this at some point (for instance if you met me i doubt you would assume i had ever felt as you do). Also nobody has the right to tell you that your unattractive. Looks do not equal worth and anybody who would suggest this is ignorant and more than likely somebody not worth knowing. And finally its ok to feel sh*t sometimes, its perfectly natural, just don't allow your insecurities to consume and dictate your life. Anybody with the such low opinion of themself that you seem to have would end up in the situation your in (supposedly friendless and lifeless). This life of yours is your making and you have the power to change it. One practical solution i could suggest to you is to seek out counseling (not necessarily a psychiatrist). Now disregard most peoples pre-conceptions of counseling as a reserve of the mentally ill and really look into it. I went at the age of 17 purely out of curiosity of what it could offer me and i came out a far happier and more secure person, i definately think it could help you gain a greater understanding of yourself and the roots of your low self esteem. Mine was a free service and im sure there will be something similar near you. But anyway i hope i helped, seriously look into the counseling and good luck for the future, i'm sure things will all look up soon. Al","author":"greenwich123","replyTo":"post1185572","postID":"post1241294","date":"20100729-00:00:00 -0400","authorID":"http://ehealthforum.com/health/user_profile_296090.html"},{"content":"i know that feeling im ugly too people have told me that my whole life","author":"aylix","replyTo":"post1185572","postID":"post1265905","date":"20100925-00:00:00 -0400","authorID":"http://ehealthforum.com/health/user_profile_310559.html"},{"author":"aylix","replyTo":"post1185572","postID":"post1265906","date":"20100925-00:00:00 -0400","authorID":"http://ehealthforum.com/health/user_profile_310559.html"},{"content":"I also am a 21 yo male, nearly 22. I've been struggling with depression for about four years now, and it's because of the same reason as you. I feel my physical appearance is ugly, and I feel underappreciated and worthless to people. Whenever I am around other people I always come out of that time feeling worse, not only because I can see my mates and their girlfiends/fiancees that are so in love. I am skinny as heck, pasty white skin like you've never seen, unmanageable hair, big nose, bad skin, weird voice. I'm not funny or charming, just a math kid and a nerd. Any girl I introduce myself to will always give me the same look of 'who does this guy think he is?'. Whenever I talk to a girl I'm interested in, she will be nice enough, but then when my good-looking mate joins the conversation, she will laugh at all his jokes and concentrate only on him and compliment him. I, like you, have never been complimented by a girl on my physical appearance. Any little things when a girl ignores me or treats me badly can send me into a terrible depressive state. I have felt ugly and disgusted with my body and face as long as I can remember. Whenever I look at photos I just feel sick. I guess I have this because I figure that if I'm ugly, and girls aren't interested in me, then that means I'll always be alone. I'll never get married, never get to be a Dad, never get to be a husband, never get to hold a woman in my arms and tell her I love her. It is hard. Very hard. But no matter how bad it gets, I can always rely on one thing: That God loves me. That I have immense worth in his eyes, that because of Jesus he sees me as a beautiful son. I'm sorry to preach to you here, but I have found that to chase after people's acclimation is worthless, but to chase after God, is priceless. I can be absouletly certain that he loves you and I more than we could ever possbily understand. At times I don't understand why he made me physically ugly. I don't know, and sometimes I get very angry about it. It's hard to see all my friends pairing up, and me left with no one. I turn to God and I say WHY? WHY did you do this?? And in that moment I feel so empty, dark, alone and angy and sad and worthless and like every ounce of my being is just going to break apart and I break down and cry and cry and cry. And I ache. I ache so bad to meet a woman who appreciates me, who understands me, who loves me, who accepts me for who I am, who will never leave me. But no one is perfect. I can't be completely satisfied by a person, because an imperfect person can't perfectly satisfy. But a perfect Saviour can. A perfect Jesus DOES appreciate me, as man he DOES understand me, he DOES love me - even to the extent that he paid my debt before God so I could spend eternity with him, he DOES accept me. And he will never, never leave me; my relationship with him is permanent - it can never be taken away. Even though I struggle at times, I turn back to God, and I have found that Jesus can give me the assurance I want, that Jesus can give me the worth that I crave, that Jesus can give me the satisfaction I desire. He is the closest friend I will ever have, he is in my heart when I live every day, that by him I can know a loving, wonderful Father. Again, I'm sorry to be so preachy, but my faith is the one and only thing I have in my life that I can absouletly depend on. I feel complelled to share that with people, and give them a chance at experiencing the immense joy that I have found in Christ. I will leave you with this: Jesus said in Luke 9:24 \"For whoever wants to save his life will lose it, but whoever loses his life for me will save it\". That dosen't mean that Jesus wants us to go and die, what he is saying is that when you are prepared to give up everything you have, everything you depend on through your own deeds or people's opinions of you, and turn to him, and be content with just him, then and only then, will you find a life truly worth living. I will pray for you. That you will find joy not in an ego boost, not in someone's opinion of you, not in a religion, but in a deep, wonderful, and all-satisfying relationship with God. I urge you to seek out a Christian counsellor; these are people that will treat you with respect, and despite what you may think, are not judgemental. They have been an amazing help to me, and I hope for you as well. Peace out P.S. If you ever want to chat, you can write me and I also have Skype.","author":"PeterDoobes","replyTo":"post1185572","postID":"post1274120","date":"20101017-00:00:00 -0400","authorID":"http://ehealthforum.com/health/user_profile_315884.html"},{"content":"Hello Peter Doobes. I hope you don't mind you saying but i was moved to the point of tears in what you i read in your reply to Mudig. I feel so sad that you ache with loneliness and the feelings of being ugly. My heart goes out to you. I know even though I've never seen you that you are nowhere near ugly. You are a beautiful man with a lovely heart and I just know it isnt possible for you to be ugly. For you to feel so much pain shows you have deep inner beauty and qualities and compassion that money cant buy. Jesus tells me you'll never be ugly physically or in any way. Believe me i know how you feel. You said no girl understands well as i read that i cried saying i understand i understand i know how you feel. I feel ugly too i was bullied and called names at school about my appearance and my brothers dont talk to me because of this. My parents are ashamed of me for not being prettier but someone told me that inside i have so much inner beauty and am so attractive. Nobody sees or appreciates it. At work people judge me because i have a big nose and need a brace. I have lovely big kind eyes though that show my inner soul. I want you to know how truly valuable loved and precious you are to Jesus and to me. Love in Christ from Joanna","author":"lking","replyTo":"post1185572","postID":"post1306491","date":"20110115-00:00:00 -0500","authorID":"http://ehealthforum.com/health/user_profile_335055.html"},{"content":"Hello Peter Doobes. I hope you don't mind you saying but i was moved to the point of tears in what you i read in your reply to Mudig. I feel so sad that you ache with loneliness and the feelings of being ugly. My heart goes out to you. I know even though I've never seen you that you are nowhere near ugly. You are a beautiful man with a lovely heart and I just know it isnt possible for you to be ugly. For you to feel so much pain shows you have deep inner beauty and qualities and compassion that money cant buy. Jesus tells me you'll never be ugly physically or in any way. Believe me i know how you feel. You said no girl understands well as i read that i cried saying i understand i understand i know how you feel. I feel ugly too i was bullied and called names at school about my appearance and my brothers dont talk to me because of this. My parents are ashamed of me for not being prettier but someone told me that inside i have so much inner beauty and am so attractive. Nobody sees or appreciates it. At work people judge me because i have a big nose and need a brace. I have lovely big kind eyes though that show my inner soul. I want you to know how truly valuable loved and precious you are to Jesus and to me. Love in Christ from Joanna","author":"lking","replyTo":"post1185572","postID":"post1306492","date":"20110115-00:00:00 -0500","authorID":"http://ehealthforum.com/health/user_profile_335055.html"},{"content":"To PeterDoobes, You are a beautiful and inspirational person. I like Joanna, was incredibly moved. Your post touched me on a very deep level. We are united in faith, and united by God. And for that i am glad. Love, Tien.","author":"judeau_x","replyTo":"post1185572","postID":"post1332785","date":"20110315-00:00:00 -0400","authorID":"http://ehealthforum.com/health/user_profile_350708.html"},{"content":"Mudig, Here's the honest truth: You are a man, even if you think you are terribly ugly, you can totally score a hot babe! Instead of locking yourself up in your room, start working on the one thing that you can control: your body! Start working out, pick an educational goal - focus on all the things that you can, and you know what women will notice. It's a strange thing... Women can fall in a love with a confident man and think he's sexy even if he's never thought so himself. I promise you - it's all about confidence! And you know what... I bet you aren't as unattractive as you think you are. You have spent so much time focusing on how unattractive you are, try instead focusing on one thing you do like about yourself. If you feel like you don't have something to be happy about I would be happy to help you figure it out! BE HAPPY and you will be!","author":"Elle11","replyTo":"post1185572","postID":"post1332798","date":"20110315-00:00:00 -0400","authorID":"http://ehealthforum.com/health/user_profile_350431.html"},{"content":"look you well find a pretty angel just talk to girls but good girls dont let no one put you down i been there know i have a pretty angel and she only loves me","author":"1Rene8","replyTo":"post1185572","postID":"post1339133","date":"20110328-00:00:00 -0400","authorID":"http://ehealthforum.com/health/user_profile_354656.html"},{"content":"if you need help just tell me","author":"1Rene8","replyTo":"post1185572","postID":"post1339134","date":"20110328-00:00:00 -0400","authorID":"http://ehealthforum.com/health/user_profile_354656.html"},{"content":"*This response is for the Original post, and for people who are here because they are feeling the same* Bro, it's really eery reading your post. It's like you read my mind and have described what I'm feeling right now. I am also very ugly--I have known this all my life-- It's just a fact, I guess. And as I got older I tend to hear it more often from insensitive/immature people-- So I do understand what you are saying and feeling. The \"ugly\" truth is, the world is very visual. We will always be attracted to a \"pretty\" face. We just respond positively when we see a pretty face and when see something that is not attractive we respond negatively. That's the honest truth and can even be supported by science. That's the whole reason why good looking people lived in different world than us. Honestly, I am guilty of it too, I tend to pay more attention to good looking people and I tend to remember their names than the others. Like I said, I was also born unfortunately ugly, and people have treated me unkindly. People won't remember my name, teachers(i'm 25 btw) will look past me and wont even recognize the fact that i'm in a room with them. I gave my number to a bunch of people and they didn't even keep it--and these are people that I've been interacting for a whole semester in college--Friends have cut me off.. the list just goes on. What I've been doing, and I suggest you do the same. Is start developing a skill or hobby. Do you play music? sing? Sports? Draw? Do you write? and just focus on developing whatever it is when you are alone. That's what I've been doing, I play the piano and I sing, so whenever I'm by myself (which is often) I try to play the piano and vocalize. It will make you forget about the superficial stuff that you go through and I often will feel better afterwards. LONELINESS SUCKS!! I Know, there would be times when I wish I had someone to talk to and laugh with or just to grab a meal with. But the thing, everyone feels lonely--even the good looking ones. It's all on how we handle it. I just recently started taking advantage of my loneliness. You know, we don't have to be miserable when we are alone. Most good looking people get by because of their looks. And because of this, they don't even have to try to develop a skill or develop a likable personality or humor. All they have to do is look pretty. Some of them even have really ugly personalities--I'm sure you've met these kind of people before--THIS IS WHERE WE UGLY PEOPLE SHINE! No one will give us the world in a platter, so we have to work for it. We have to develop skills,talents,personalities, to make people appreciate us. And these skill that we developed, THEY LAST!! It will be more satisfying to know that someone likes you or appreciate you because of your skills or personality rather than your looks. And one more thing. BEAUTY DOESN'T LAST!!! Remember that! I just saw a picture of the prettiest girl back in my school and the quarterback and their looks have faded. You're still at your early 20s, our bodies will keep on aging and our looks are the first one to go. It all depends on our genes and more importantly on how we take of ourselves. And most importantly you can always acquire beauty-I've been working out and my physique has definitely help me boost my confidence a bit. We can make ourselves look attractive nowadays- YOU HAVE THAT CHOICE, you can change and improve yourself if you wanted to. I'm sure you're not that ugly, I'm probably uglier than you. Which is definitely possible. Hang in there man. Remember when someone calls you ugly, they are seeing things that they don't like on themselves-- they're pretty much projecting their insecurities- Ignore them, you don't have to be a victim and insulting goes both ways but try to be a better person if you can.","author":"bartholomew","title":"ugly truth","replyTo":"post1185572","postID":"post1358922","date":"20110430-00:00:00 -0400","authorID":"http://ehealthforum.com/health/user_profile_365667.html"},{"content":"I feel the same way. I'm 13 I use to go outside before i got all ugly... and now I'll only go out in the dark. i don't really hang out with anyone like i did before. i always try to hide during school and when it's over i just wanna get the hell out of there.","author":"slowdepression","replyTo":"post1185572","postID":"post1376501","date":"20110603-00:00:00 -0400","authorID":"http://ehealthforum.com/health/user_profile_376952.html"},{"content":"you described how i feel perfectly. i don't blame anyone for not wanting to be with a girl who is so repulsive:-)","author":"happy2bsad","replyTo":"post1185572","postID":"post1440630","date":"20111006-00:00:00 -0400","authorID":"http://ehealthforum.com/health/user_profile_412681.html"},{"content":"Hey, I feel ugly too but I'm trying to make myself prettier. Bottom half of my body is wider than other people and my upper body is slimmer than other people which makes me look like a pear = = but hey, I'm gonna work on that. So you should too. I have friends that have a perfect body and perfect face, never sweat (not even by one bit.), open-minded,fun etc, basically, every guys' dream girl and I'm the opposite. I think I look ok when I stand in front of the mirror on my own but when I take a picture with other people, I feel that my face features and my body is really out of proportion. I researched a lot and I've searched a lot on how celebrities used to look like. I've found that a lot didn't actually have surgery but have gotten a lot pretty simply by losing lots of weight, baby fat from their face. I'm asian (no discrimination please xD) and I have monolids, it makes my eyes droopy but they're not as droopy as other people who has monolids and I have found ways to help make them nicer without surgery. I have found ways on how to make my nose bridge a bit higher etc. So do your research, if you think parts of your face is not nice, look up how you can improve that certain part with face yoga or massaging or avoid eating certain foods at certain times. If you feel bad about your body, work out, even if it's just little by little. Don't worry about getting gothic girls or whatever. It's just the appearance that you like but since you never got them to be interested in you, it also means that, you never got to really know them. Their personalities might not suit you at all. Before you start aiming for your ideal type, go for other types of women, even if it's just for friendship. You never know what that can bring you.","author":"Anon_75","replyTo":"post1185572","postID":"post1441076","date":"20111007-00:00:00 -0400","authorID":"http://ehealthforum.com/health/user_profile_420430.html"},{"content":"I was in the same boat as you at your age. My advice is more simple - leave the country (I assume it is US or UK) - go to Asia or South America or Eastern Europe. You will have girls chasing you all over the place because you are from a wealthy country. This will raise your self-esteem and people will treat you much better once you have a girlfriend.","author":"Dave_Lister","replyTo":"post1185572","postID":"post1457258","date":"20111109-00:00:00 -0500","authorID":"http://ehealthforum.com/health/user_profile_432808.html"},{"content":"Im probably late to the prom here but dont sweat it. Easy to say but its the truth. Especially at 21, the opposite sex only wants what they see on tv anyway. I wouldnt say that im an ugly dude but i know theres hot women who wouldnt give me the time of day. Im 34 and married now but if you told me 10 years ago that id be married, i would have laughed in your face. Soon as you stop looking for her, she finds you. Marriage is a team and nobody cares if the quarterback is ugly if hes throwing touchdowns. People can lie to you and say beauty is on the inside but i wont. A nice exterior will make things easier but thats like saying a ferrari will get you more chicks than a honda. From a mans standpoint, women are everywhere and 4000 times more insecure than men. Wait till your late 20's or early 30s and i can almost guarantee you'll find somebody who thinks God put you here just for them.","author":"rmb21301","replyTo":"post1185572","postID":"post1457651","date":"20111109-00:00:00 -0500","authorID":"http://ehealthforum.com/health/user_profile_125812.html"},{"content":"I'm 18, i went through the stage you did, mine was terrible, my mother felt like she could do nothing for me. i hated the world id see my own shadow and feel so much hatred toward myself , I'd hide from the world my anger was so built up i was incredibly high strung, you could not even look me sideways.. i did marijuana everyday sitting on the computer trying to escape the real world. my life was a living hell. i drove my little brother across the ther side of Australia just so he could get away from me. this was the worst time of my entire life i was slowly rotting from the inside out and didn't give a care in the world, infact i embraced it. i wanted it that way. I've seen a lot and I'm no simpleton, the world can be a cruel place and the people can be harsh and cruel. but just know that there is also good in the world people WHO DO CARE. letting your life be ruled society's standards of beauty is not the way to be there's more to life. a person once told me something very simple and basic, if you can manage this then nobody can touch you. \"YOU just worry about what YOUR doing and nothing else\". smile every so often whats the worst that could happen? perhaps the man who created this thread is not here but people who have been through this before or a going thought it now may get something out of this and i hope they do because no matter what were all people and nobody is better and nobody is worst. i hope that some of you find peace within yourself. You can do it, i did.","author":"Joe_Bloggs","replyTo":"post1185572","postID":"post1484673","date":"20120103-00:00:00 -0500","authorID":"http://ehealthforum.com/health/user_profile_452392.html"},{"content":"1 Samuel 16:7… Don’t judge by a man’s face or height… I don’t make decisions the way you do! Men judge by outward appearance but I look at a man’s thoughts and intentions trust in god he loves u for who u are an Jesus too","author":"mewliz","replyTo":"post1185572","postID":"post1500025","date":"20120130-00:00:00 -0500","authorID":"http://ehealthforum.com/health/user_profile_463577.html"},{"content":"Hey, I'm in a very similar boat, but am 20 and female. But I have a goal that I want to make a lot of money through my career after uni, and so dedicate my effort into academic studies and internships. Money is a good distraction.","author":"Georgie_01","replyTo":"post1185572","postID":"post1543892","date":"20120412-00:00:00 -0400","authorID":"http://ehealthforum.com/health/user_profile_494427.html"},{"content":"After reading a page of comments, I would say almost none of this would ever help the OP (Anon_75). Yes, that's right, dare I say it. Why? simply one thing: unsolicited advices. 8/10 of you who suggested the how why, whatever - it all leads to one same anxious answer - \"deal with it\". You all kept relating to your own experiences and quickly dismissed it and thus puts you in a greater authority of influence. Yes, we all heard of this and that coming from you. But what about examinations, assesments, or genuinely \"useful\" assesment devices that solely reflect within the perspective of the OP? two or perhaps 3/10 of the responses here actually do help - because some do highlight relatively genuinely useful advices that talks DIRECTLY upon the problems the OP is having. Look into the person's circumstances, and what he or she's been through by their concrete evidences of life, NOT by that person's immediate outset. Hope I make some sense. Anon_75, first of all - what I may be able to give you some advice - is to be strong. Ok, so how do you do that? Start by learning and reading more about unsolicited advice, how so many people grow into it. Choose who you want to take advices and help from. Just because a psychologist \"may\" help you, does he or she actually and exactly know your day to day motions of living? Every minute? Everything counts. I wouldn't pay someone just to tell me to grow up. Peace and strength unto you bro. I'm turning 27yr old this May, and still without a GF.","author":"eq85","replyTo":"post1185572","postID":"post1544064","date":"20120412-00:00:00 -0400","authorID":"http://ehealthforum.com/health/user_profile_494527.html"},{"content":"after girls grow up enough to know that the good looking guys are not always the best catch almost all the time..then they realise that a guy with a good sense of humor & that is a caring person who isn't hung up on his self & makes her laugh & feel safe...has a qulity that is much more attractive than a pretty face.So hang in there...your girl is out there somewhere...& you'll find her...I promise","author":"maybethiswillhelp","replyTo":"post1185572","postID":"post1658425","date":"20121215-00:00:00 -0500","authorID":"http://ehealthforum.com/health/user_profile_574073.html"},{"content":"Hallo Kameraden! I am 21 and I feel like I am quite ugly as well, although my opinion of myself during the course of my life has been rather mixed. Whenever I meet a woman or introduce myself to a female of any age they genuninely smile at me and they seem quite natural in their responses unless I might have accidentally ticked them off somehow (they are quite expressive facially when happy or angered). It often seems as women laugh or giggle when I think they're looking at me and I am often divided between three possibilities: 1.) They're laughing about something in their own lives 2.) They \"might\" be laughing about something they like (me or someone behind me) 3.) They are making fun of how I look. What else makes me insecure you wonder? Well, for one I do have an interest in guys as well, so I'm not sure how I should go about it whether I am pansexual, bisexual or simply bi-curious (I have been feeling like this for quite some time), although I do feel as if Im pansexual because I do believe that I can love anyone regardless of their binary or nonbinary status and I often don't judge people based upon looks (I still find plenty of people sexually appealing despite what I may say, although I think that people get a little too overexcited with people they look at ) , I often repress these feelings which make me even more depressed than I already am. What irks me the most is when some women in particular bother me, (which I am perfectly okay with) they sometimes may seem rather teasing and seductive which I find very suspicious, therefore I sometimes believe that they're trying to get something out of me or trying to make a fool of me. One time I was trying to back off and slow things down a bit, although the person who was doing this started liking me less. Of course I am acting rather immature, I just feel that there is something seriously wrong with me. I haven't found the courage to confront guys I may like, it feels much easier to put up a smokescreen of toughness to hide my weaknesses and pretend I am heterosexual. Now I do not think I am better than other people despite the fact that I may sound extremely confident on extreme occasion, I just feel like people are doing this because they feel sorry for me and want to make me feel better because of what they think I am going through. And when I do express my poor opinions of myself people often seem weirded out and Sorry to creep you guys out, lol","author":"Mysterious_Kin","replyTo":"post1185572","postID":"post1724265","date":"20130625-00:00:00 -0400","authorID":"http://ehealthforum.com/health/user_profile_628875.html"},{"content":"i am in my forties and i was a very attractive child, when i became unattractive at the age of about 14 the whole world turned on me including parents,i have been betrayed and backstabbed so many times by anyone i let close, i have seen it from both sides people are lovely and horrible, if you are ugly you get only to see the latter,i have worked on being funny and developed lots of interests i make music i dj, butthe weird thing is from one side i look attractive, but from the other i look like an ugly gargoil, its weird, and sometimes people are nice then they turn on me as if i have mislead them, it leads me to be very unstable and confused,im up and down , i wish i could give you some useful advise, but im still trying to work it out,people have ground me down, my sense of humour is dwindleing and my enjoyment of music has too, it was all i had, i feel very isolated, i really don't want to be here anymore its too painful,passing away would be lovely","author":"gargoil","replyTo":"post1185572","postID":"post1786432","date":"20140208-00:00:00 -0500","authorID":"http://ehealthforum.com/health/user_profile_678253.html"},{"content":"Hi Mudig, (et al), Just came across your post and wanted to chime in. First, I'm considerably older than you are and I've been dealing with my poor self image all my life. I pray that you can stop this while you're young. I'm just short of 50 years old (which sucks in and of itself believe me), I have everything a normal man see success in, I still feel badly about myself DAILY. Despite several attempts to think my way thru this with professionals, I still can't shake it. So here I am, just past the middle of my life and still dealing with this crap. I don't wish it on anyone. My advice is that, even if you are unattractive, so what. See someone that can help you focus on the good things about you and your life. And don't think that because people don't like the way you look that your life is over. I understand that people judge you by your looks, but as you get older it will go beyond that. Do the best you can with what you have. Hit some weights and read some books... build up your self esteem. Don't let people make you feel like less of a person than you really are. Everyone enjoys pointing our other's defects to make them feel better about themselves... I really wish you luck.","author":"Crazywhiteboy","replyTo":"post1185572","postID":"post1788460","date":"20140218-00:00:00 -0500","authorID":"http://ehealthforum.com/health/user_profile_679941.html"},{"content":"ISLAM HAS THE SOLUTION TO THE PROBLEMS OF THE WEST!!! SEE THIS VIDEO BY DR ZAKIR NAIK","author":"physiosaima","replyTo":"post1185572","postID":"post1788516","date":"20140218-00:00:00 -0500","authorID":"http://ehealthforum.com/health/user_profile_673538.html"},{"content":"physiosaima... You've gotta a be Kissing me man! Don't make this into Religious War! Thanks for your interest in helping.","author":"Starwalker1210","replyTo":"post1788516","postID":"post1795749","date":"20140324-00:00:00 -0400","authorID":"http://ehealthforum.com/health/user_profile_685648.html"},{"content":"*Kidding! I was very tired to notice the Typo. lol!","author":"Starwalker1210","replyTo":"post1795749","postID":"post1795928","date":"20140325-00:00:00 -0400","authorID":"http://ehealthforum.com/health/user_profile_685648.html"},{"content":"How do you define ugly or beautiful? Beauty comes from within. The true beauty is the character you have. Being friendly, charming, hospitable, respectful and good listener make you beautiful and the outside appearance does not really matter.","author":"Juliet08","replyTo":"post1185572","postID":"post1788527","date":"20140218-00:00:00 -0500","authorID":"http://ehealthforum.com/health/user_profile_675981.html"},{"content":"I'm quite ugly too and this is why so many beautiful women tend to just blow me off. In high school I was also bullied, teased and ignored by the girls just because I was ugly and looked different from the rest of the kids. It seems that few people wish to acknowledge how being physically ugly, unattractive or just disfigured can severely compromise or even destroy an individual's quality of life and I believe that without any kind of quality of life you are basically not living. We all know that people are cruel and judgmental while others will spin the \"it's what's inside that counts\" nonsense to try to make ugly people feel better. The reality is that being severely unattractive will cause the following problems: - You will / have been severely bullied and tormented at school - Little or no chance of ever experiencing love - Difficulty making friends - More difficulty obtaining employment. As a result of the above, many so-called ugly people lead lives of loneliness, rejection and depression. Everyone is different and I'm sure some can live with it, while others become severely depressed or even suicidal (such people are the ones I'm referring to). Cosmetic surgery is very expensive and many people simply cannot afford to fix themselves to be accepted by this cruel and judgmental culture. And without money or good insurance there's little you can do. Such people are wedged between having a disability in which they would most likely get free healthcare, but are too normal in every other sense to qualify for such life changing help. Even people who are poor and born with severe dental or orthodontic problems are basically screwed because of the cost.","author":"guest72882","replyTo":"post1185572","postID":"post1790689","date":"20140227-00:00:00 -0500","authorID":"http://ehealthforum.com/health/user_profile_681463.html"},{"content":"Its just cruel truth that some of us will never be loved or happy! We are just born ugly and shy and there is nothing we can do about it. We are just bad people who only deserve to die alone in the dumpster and that is that! I just hate people who try to be heartfelt it's so annoying and please don't reply with this comment saying \"jesus loves u\" because we all know that god is neither bourgeois nor blind and deaf. I don't believe in God and I think that if God really does exist then he definitely does not love me. Also have you ever noticed how girls never do anything to for example start a conversation with a guy they might be interested in? Well that's because we don't expect them to do so, and believe me you need to be either a huge manhunk or a millionaire to even get eye contact from them! And I think this is wrong since this leaves people who are painfully shy like me completely helpless in making contact with girls! And the worst thing is that this thing will probably never fade away since girls are getting even more selfish as time goes on and that is a problem that leaves a lot of men without a girlfriend for the rest of their life.","author":"guest72882","replyTo":"post1185572","postID":"post1790835","date":"20140228-00:00:00 -0500","authorID":"http://ehealthforum.com/health/user_profile_681463.html"},{"content":"Be a Human Every One will Love You. Beauty is not on the face, weight and height its on your soul. You can refer the history for that.","author":"rogerw123","replyTo":"post1185572","postID":"post1792729","date":"20140310-00:00:00 -0400","authorID":"http://ehealthforum.com/health/user_profile_683290.html"},{"content":"That is true. Beauty is in the eyes of the beholder. The true beauty is our character. Don't look down yourself bu t be confident that God created us uniquely.","author":"Juliet08","replyTo":"post1792729","postID":"post1795715","date":"20140324-00:00:00 -0400","authorID":"http://ehealthforum.com/health/user_profile_675981.html"},{"content":"I don't know why people think them self that they are ugly. Just think yourself most of the legends are not beauty but they are loved my most of the people.","author":"rogerw123","replyTo":"post1185572","postID":"post1795884","date":"20140325-00:00:00 -0400","authorID":"http://ehealthforum.com/health/user_profile_683290.html"},{"content":"No one is perfect in this world. Be what you are, don,t try to change yourself by hearing others.","author":"user671336","replyTo":"post1185572","postID":"post1796745","date":"20140328-00:00:00 -0400","authorID":"http://ehealthforum.com/health/user_profile_671336.html"},{"content":"Exactly right. Real beauty is the character itself. Beauty fades but character stands forever. Also, if you have beautiful and healthy skin you look beautiful so take care of your skin.","author":"Juliet08","replyTo":"post1185572","postID":"post1796766","date":"20140328-00:00:00 -0400","authorID":"http://ehealthforum.com/health/user_profile_675981.html"},{"content":"i am just like you .male 21 ugly no girlfriend feeling so lonely and angry all the time even having handsome brother .i have the same feelings.it is so difficult to live this life as my grades goes down and my concentration decreased .i dont want to go to college because i feel i am below all guys there. i know its difficult to pretend to be confident among people i also choose to be away from my colleagues . i use to hide when they take pictures not because i dont like to get photoed.i like to be photoed but because pictures hate me i appear so ugly in it.i wish you can change your life and have a happy one.i wish you dont give up like me.","author":"annoynmous","replyTo":"post1185572","postID":"post1845059","date":"20150218-00:00:00 -0500","authorID":"http://ehealthforum.com/health/user_profile_716436.html"},{"content":"I am very certain you are not \"ugly\" Ugly. Is such a degrading term. I think if you want to feel \"handsome or beautiful\" than you have to like yourself! Please take some time to take care of yourself. You will feel a whole lot better.","author":"susanlinda823","replyTo":"post1185572","postID":"post1845066","date":"20150218-00:00:00 -0500","authorID":"http://ehealthforum.com/health/user_profile_707446.html"},{"content":"sanam33 said it very nicely, you should change your opinion about your self and what people thinks leave on them, live your life with your way.","author":"LaraHabig","replyTo":"post1185572","postID":"post1865333","date":"20150715-00:00:00 -0400","authorID":"http://ehealthforum.com/health/user_profile_727651.html"}],"URL":"http://ehealthforum.com/health/depressed-because-i-m-ugly-t225537.html"}