{"title":"Am I Depressed? I Lost My Sense of Humour... (Page 1)","thread":[{"content":"Hi, i'm 18 and I haven't laughed in about 2 years. I fake laugh and I have the occasional natural chuckle here and there, but nothing has made me laugh out loud or laugh really hard for a long time. Come to think of it I haven't naturally smiled a lot or been very happy for what seems like years. Yet I don't feel upset, I don't cry, I don't resent anyone or anything, I don't have any suicidal thoughts or anything... I just feel like I don't feel much of anything anymore. On top of that, I haven't been able to converse very well anymore. I used to be a chatty, somewhat sarcastic person who would have no problem talking to people... But now I constantly find myself struggling for things to say, and it's usually obviously forced small talk. I also seem to stutter and mix up words a lot more (freudian slips?). This makes it hard to meet girls, which gets frustrating. Even getting drunk doesn't help these problems that much. There are a few things that I can think of that might contribute to this: 1. I started smoking pot a few years ago, and did it a lot over the past six months. (i stopped for good a few weeks ago though...) whenever I was high I would get very introverted and would barely say anything. 2. I've been getting bad migraines occasionally over the past few years and the doctor recommended that I stop drinking anything with caffeine in it. I used to drink a lot of pepsi and coke and get hyper, but haven't had a drop of caffeine in years. 3. I'm in university... So I stay up pretty late most nights (it's nearing 3 right now). It's hard to get to bed early with so much time 'wasted' working on assignments and going to class, but I still get a good 7-9 hours of sleep most nights (late morning classes). 4. Sexual frustration... I won't go into details. Would any of these account for my feeling this way? My dad is similar to me in these regards, but I notice that he still has his clever, spur of the moment, sarcastic humour in tact. Is there anything I can do?","author":"Pastah","postID":"post360794","date":"20060322-00:00:00 -0500","authorID":"http://ehealthforum.com/health/user_profile_64377.html"},{"content":"Are u a confident person? I become introverted too and have anxiety in social situations write back gavin","author":"w0rldd0minat0r","replyTo":"post360794","postID":"post361161","date":"20060322-00:00:00 -0500","authorID":"http://ehealthforum.com/health/user_profile_62155.html"},{"content":"Nah I don't consider myself an overly confident person... But that's usually because I can never think of anything to say... Which doesn't really help the confidence... So I don't say much... Which doesn't help the confidence... So I don't say much... It's a vicious cycle","author":"Pastah","replyTo":"post360794","postID":"post361200","date":"20060322-00:00:00 -0500","authorID":"http://ehealthforum.com/health/user_profile_64377.html"},{"content":"Maybe you just haven't found anything to laugh about over the past couple of years? Doing drugs and going to college, I would think your head would be full between the two of those things. And then to look at the world around us these days, if you follow the news, the war, bad things happening to innocent, good people right here in the us... And then worrying about grades, getting caught with an illegal substance, etc etc. My brain is spinning just thinking about it! Personally I think that you have to be able to laugh at your own short comings and feel good about yourself before you can find humor in other things. Also you have to start enjoying the little things and not be looking for something big to trigger a laugh. You have to allow yourself to laugh at life in general at times. But I don't think you've lost your sense of humor, you've just misplaced it.","author":"Morning_Glory","replyTo":"post360794","postID":"post361414","date":"20060322-00:00:00 -0500","authorID":"http://ehealthforum.com/health/user_profile_63265.html"},{"content":"I am doing drugs and I am at college at the moment I have cut down smoking weed cos I was halucinating and finding myself just thinking and not being social. I have low confidence when I was a kid I found that doing drama classes enabled me to become more confident and be able to use my voice more because I used to hate speaking because I thought I had nothing interesting to say! Thats so not true it doesnt have to be interesting to talk and the more you talk and develop relationships you can then talk about other stuff. Im not really too sure how to help cos im in the same situation so I will be following this closely but drama classes does help and your never to old to join one if I had the $ at the moment I would","author":"w0rldd0minat0r","replyTo":"post360794","postID":"post361715","date":"20060323-00:00:00 -0500","authorID":"http://ehealthforum.com/health/user_profile_62155.html"},{"content":"Wow dominator, that sounds like me to a t. I just quit smoking, don't think I have anything interesting to say... Don't usually have anything to say... I took drama for a while, but that didn't help cuz I couldn't ever think of anything to do during improv =/","author":"Pastah","replyTo":"post360794","postID":"post363132","date":"20060325-00:00:00 -0500","authorID":"http://ehealthforum.com/health/user_profile_64377.html"},{"content":"its gd to hear from some 1 whos sounds to be goin though i simalar thing lol im not meanin am happy ur not findin anythin funny.but i think im the same i was diagnosied with depression round about last april and i dont think i ve properly laphed for almost a year aswell i think i can even sometimes tell when things r funny but i dont properly lagh i think i fake laph aswell u get pretty gd at it did u.it sound s like a heap of shite wat where speakin bout but it is true.im even getin better now and i still dont think ive properly laphed yet.cheers mate for postin that i dont ever put a comment on these things but i thought that was helpful","author":"macphee","title":"i think i ve had the same thing","replyTo":"post360794","postID":"post962917","date":"20090102-00:00:00 -0500","authorID":"http://ehealthforum.com/health/user_profile_153870.html"},{"content":"Im in the same situation..Im in college, and all I do here is work hard during the week to do mediocre in class and get hammered on the weekend with my friends. I had a great sense of humor a few weeks ago coming back of spring break, I had an awesome time, opened up to people i normally dont and it carried over to the next two weeks or so. But its gone now, I force laughter and small talk, try to be clever and have fun, but its not the same at all. I dont think its depression were feeling, but maybe stress and a disconnection between friends, which leads to not talking as much and turns into a vicious cycle. -Im stressed for school and am constantly doing work during the week, or eating or watching tv. -During the week I barely talk to anyone in my frat except closer friends, and even then they ask where have you been? -On the weekends I usually drink with friends outside the frat, I get hammered and have a great time. -I relax when I drink, and gain confidence so I laugh at myself and others and its lighthearted and usually everyone has a great time...but sometimes i think im a little dependent on that, I want it to carry over to sober me! atleast I know its still there. Im pretty po'ed I cant laugh as easily as I could, or make jokes and laugh with others, it makes me angry I cant enjoy life like i used to or even make others laugh. I think alot of it has to do with stress and a possible dependency on alcohol use. I also think that to laugh you have to connect with something on a personal level, which ties in to connecting with friends. A few things Im going to try and have heard worked for this: -watch alot of comedy, find out how others look at life and twist it to make it funny, watch comedy central before bed -when you wake up force a laugh and try to keep laughing until its genuine, this relieves stress and helps you smile again so its not as tough the rest of the day -for stress go to the gym and try to make it regular, or try whatever theres alot about minimizing stress on the internet Just right now I remembered all of this since last time I lost my sense of humor haha, give it a shot I hope it helps And thanks! This really helped for me, so you helped someone today","author":"scrbke4","replyTo":"post360794","postID":"post1014193","date":"20090415-00:00:00 -0400","authorID":"http://ehealthforum.com/health/user_profile_179127.html"},{"content":"Hey, just recently i realized that ive been going through the same things as alot of yall. Im 15 and a sophomore in high school, and i seem to have social anxiety at times. Its also been difficult for me to strike up a conversation, and i havent really laughed as much as i used to. I started to smoke weed the summer i entered high school, and was doing it for about a year. I used to have so much fun with friends, high or not. But afterawhile i started to get paranoid when i smoked weed instead of feeling mellow and happy. Like i used to think people were talking behind my back and i felt like everything i said was stupid. Im pretty sure ever since that started to happen to me, it started to affect me even when i was sober, i wasnt paranoid but it was just hard for me to talk sometimes. Its like i turned into a shallow person. I dont smoke anywhere near as much as i used to, but i will admit, i do it sometimes still. Its hard to stay 100% off of it since almost everyone in high school likes to do it. Anyways, i really just want to become the person i used to be. Im not depressed or anything, but its just like somethings holding me back. I have some stress at home too, my brother is an alcoholic and still lives with me and my parents even though hes 22 and should be moved out by now in my opinion. Ive been like 3 fights with him while he was drunk, and i also just dont enjoy being at my house when hes there drinking. Which is everyday. Maybe im just stressed out, i dont know. If anybody has any advice for me, please reply. Thanks","author":"Jake804","replyTo":"post360794","postID":"post1091312","date":"20090905-00:00:00 -0400","authorID":"http://ehealthforum.com/health/user_profile_217119.html"},{"content":"This pretty much explains my current life at the moment too. I used to be captain confident, be the center of attention of all my friends, and I don't know if it's coincidence, but I've been smoking ganja for quite some time with friends too. Now my life seems so far away in comparison, I can never think of general conversation, and I always feel like i'm letting my friends down just by being there not saying anything. I also mix up my words like you've explained. Doesn't seem like there's much I can do tbh :L","author":"Jake120","replyTo":"post360794","postID":"post1157985","date":"20100201-00:00:00 -0500","authorID":"http://ehealthforum.com/health/user_profile_251527.html"},{"content":"Wow, wow is all I can say. Never have I found people in such a similair situation to me. Honostly I thought I was the only one for a while and I'm so happy their are others, while unfortunate, that have a simlmilair situation as me. I know the feeling, and I myself have narrowed it down, which a lot of thought to a few possible causes. A little bit about myself, I am 15 years old, I too smoke weed. Some times I feel like I have no idea what to say, I'd ask myself, what would someone say in this situation, why didn't I think to say that? What do I say next. It was hard to strike up conversations, and I feel like I felt like I couldn't have relationships I wanted to because this mental block kept getting in the way. It was hell, and I know exactly how you guys feel having to deal with it. I also smoke, and drink. Drinking my inhibitions would go down, and I'd be outright outgoing, but it wouldn't always carry over to sober. Now when I smoked weed, I fealt like my whole self was kicked to the back seat of my mind, and I felt very anti-social, like I was just an observer of whats going on around me. I to felt bad because I felt l wasn't talking to my friends at ALL and that they seemed normal socially. I thought it was really only me who experience this. And being high, you overthink things and it really hits you hard. Now to my theory's, first, I believe the general anti-social thing has to do with self esteem, what you think other people view what kind of person you are as well, and very importantly, confidence in your voice and how you use it. First being in a state of low mood where you think about your anti-socialness really puts you down in general although you might think it shouldn't effect you that much. I believe it is enough to make focus on that, and know it's a problem you have, that you really don't think the jokes and other things going on around you are that important, even though you try to participate in whatevers going on, it just doesent get to you because you know you still have a constant problem. Low self esteem can come from this, making you think you can't follow up on what you say with another thing because you just can't think, and therefore making you talk less. Knowing you have this problem that you vaguely vaguely understand loops in your head, the more you think of it the more it becomes habit. You need to forget about or regain confidence but it's hard. It may be hard but you may need to distract yourself everyday, and break this habit but not having it enter your head, and in the mean time feel comfortable and confident which leads to my next theory. I believe your voice and how you use it has a lot to do with what we experience. Do you know what your voice should sound like? Do you think you know how to use your voice at it's normal pitch and tone? I believe you can train yourself into correctly using your voice, and if you can, you'll notice words sound as you intend them to, and you'll drop that feeling that what your saying is unimportant just by the way your voice sounds and you'll be able to think of what you want to say. I'm not entirely sure way, but I found this EXTREMELY effective. Even though I didn't actually read the book, but I did find my natural voice after many years, and I find it extremely important and has turned my life around. That is my ultimate theory. For the weed, I believe when you smoke your thought process and state of mind change. I believe if you just start speaking and saying things without really thinking that much (like you normally do) to an unstoned person they actually make a lot of sense. To you you don't think it's very important. But I believe you can actually come up with a lot of stuff but your just to embaressed to say it because while high you just think of things that way. But I feel like I can really relate with all of you and have just really experianced this problem less and less as I learned how to control my voice and raised some self esteem and calmed my mind a bit my doing so. I hope this helps and will pray for all of you because by god this problem is horrible and I believe most of it are symptoms of depression. I.E. not being able to concentrate and come up with things to say seems to be in that same category. I'm favoriting this thread!","author":"Rapture333","title":"I can relate!","replyTo":"post360794","postID":"post1158515","date":"20100202-00:00:00 -0500","authorID":"http://ehealthforum.com/health/user_profile_251735.html"},{"content":"wow.never usually go on these websites but i am definitely going through the same situation... &can relate. i used to always be that girl who got along w/ everyone and had a lot of friends. loved being around people and just being me. In HS i started smoking them trees...lots of them to the extent where I would smoke a redicolous amount. I had fun and everything but after a while i didnt like it as much.. i smoke on the occasion but i feel like i lost me in the process, i thought stop smoking would help.. im no longer hazey.. can think clearly now, well (kinda) but still miss my old self. I smile a lot less but im getting better. I thought i was depressed probably am been through a lot of s*** but life goes on ... its all good. just gotta stay on the (+) side of things : ) feel like a dork for this but hope this helps keeep it real ppl","author":"burrsooicey","title":"not gnna lie i love tree.. but it may not be for me : /","replyTo":"post360794","postID":"post1195784","date":"20100422-00:00:00 -0400","authorID":"http://ehealthforum.com/health/user_profile_270682.html"},{"content":"Damn im very glad i wondered onto this forum, I agree with all previous posts on here, and could have written them myself. It comforts me to know i am not alone (although I wouldn''t wish this feeling on my worst enemy). I too feel like I have lost my former \"happy go lucky\" self. I still laugh, but I find it is usually forced. I used to be a super outgoing, and generally fun person to be around. everyone would laugh constantly and tell me how hilarious I was(yea stoke that ego...). Now I hardly recognize myself. I feel totally disconnected. I''ve been pretty depressed... These days its gotten so bad that avoiding people is a norm. I feel like I am socially awkward, and make everyone around me feel uncomfortable. I find myself utterly uninteresting. This leads to having troubles thinking of what to say in any given situation, and when i do i seem to find a way to mixup, stutter, or get halfway through what I am saying and realize it sounds retarded (or at least that is how I feel). Smoking the magical green grass used to be a (verrry) regular activity for most of my life, my friends and I would cheech ridicules amounts, to the point that it was basically all I did. I think this is a large part of where the problem stems from, or at least Mary Jane magnifies the self doubt and low self esteem. Over time I have become isolated. It all is a lack of confidence in myself, I know that. Getting lost in my mind is another problem I have. I always feel like everyone around me is judging me for every word that jumps out of my mouth. Over assessing every little detail to the point that I can''t ever come to a clear conclusion. Its like one long running negative sentence that has no ending. Truly the definition of a vicious cycle. One key to breaking this mind f*** of a cycle is to really focus on being in the present. Don''t allow your mind to drift and harp on the past, or dread what the future holds. Meditation helps tremendously with this. I have recently made a lot of choices to change my life, from kicking the ganja to the curb, to not hanging out with toxic people, exercising more regularly, eating better food, healthier sleeping habits ect. You can''t do the same things and expect different results. I could write for days about this crappy state of mind. But I will cut myself off. Really hope this dark time in all of your lives is short lived. I truly believe you will pull through all of this and it''ll give great perspective on both yourself and the rest of the world. peace be with you","author":"MasterPanda","title":"self-destructive is my middle name","replyTo":"post360794","postID":"post1196707","date":"20100423-00:00:00 -0400","authorID":"http://ehealthforum.com/health/user_profile_271099.html"},{"content":"It''s a form of depression whether you like to hear it or not. The only thing that''ll help is maybe anti-depressants. I used to be the exact same way @dominator , I got around a lot and made friends easily, but i never trusted the world too completely. That lack of trust along with other things like maybe believing there''s a much more grim side to reality and life in general probably contributes to those empathetic type feelings. I believe that either some sort of enlightenment or false enlightenment that comes with psychiatric drugs will only help.","author":"highwire","replyTo":"post360794","postID":"post1201429","date":"20100504-00:00:00 -0400","authorID":"http://ehealthforum.com/health/user_profile_273591.html"},{"content":"Hello Everyone, this form made me laugh after a long time .I am very happy to see everyone with the same state of mind as mine .I am goin to see a pshychatrist this evening ,lets see what she suggests me .I can''t feel the things as i used to do before ,i am 20 and its my 2nd birthday on 15th .I have said 2nd birthday because from last 2 birthdays ,i can''t feel anything what is going around me .Whats is happening? I was a person with everyday nite out, ganjaa ,drinks and dancing all night in clubs .but nw, i don''t like to do that .i can''t cry, i can''t laugh as i used to do, i don''t love my favourite food, i don''t like shopping ,even i don''t like to njoy sex .I am just getting frustrated from my frends, my life and everything .Lets see, what the doctor suggests today . cheers my new frends. lol","author":"ronny_0013","title":"happy to see you .","replyTo":"post360794","postID":"post1205140","date":"20100513-00:00:00 -0400","authorID":"http://ehealthforum.com/health/user_profile_275685.html"},{"content":"I gotta say i feel the same as alot of you all .. lol thats pretty disturbing. In the other hand it give me hope to feel better. Honestly i think the best solutions will always be : quit smoking pot until you feel better ( stay away from it for at least 1-2 years then you can smoke every now and then , couldnt hurt anyone) , sleep well , eat well and train hard. confidence and health will skyrocket in my honest opinion.","author":"THe8l8","title":"Let me join the club lol","replyTo":"post360794","postID":"post1213791","date":"20100601-00:00:00 -0400","authorID":"http://ehealthforum.com/health/user_profile_280722.html"},{"content":"you sad, sad people. your not going to find happiness and humour on here. saying that I did laugh alot. May I suggest that you all get back out there and find your humour instead of trying to make yourselves better by getting pity and hearing other people be down.","author":"mrsbieber","title":"I really don't want to sound harsh...","replyTo":"post360794","postID":"post1217025","date":"20100608-00:00:00 -0400","authorID":"http://ehealthforum.com/health/user_profile_282603.html"},{"content":"I have been going through the same feelings, im in college and did feel socially awkward a few months ago, before I used to be a chattery social kinda guy. I think its just because college is a huge change for everyone, all of it hits fast and everyone begins looking for some sort of relief to hang onto to get out of this situation. I dont do weed or drinking, but I have seen myself turn into a studying vegetable at the library during the week. That alone tempted me to start doing that for some relief, but luckily I decided it wasn't worth it. What did help me alot was actually working out every morning. I even made my class schedule to give me a few hours in the morning just for exercise and I have to say that I am very glad I did that. Also joining some extracurricular activities such as clubs or community service will definitely help get you out of that depression. And about your lost humor, I was in the same boat as well. Fortunately, I decided to just let things go and not care about all the things that were stressing me out. It took some time to get into this mindset but seriously, dont take things too serious. Relax the tension in your face, take deep breathes, stand tall, and be proud of who you are and dont let the moment hold you back. Concentrate on who you want to be and just do it, dont try to think about it too much or be too self conscious. Open up and start thinking about others and not about your problems, but dont let that stop you from solving your own problems when you can. Let go of all negative feelings about yourself and enjoy life, try to keep following in your mind: why should you work so hard in life if you are not going to enjoy it? Dont let anyone take your right to happiness, even yourself. Your humor is not gone, your happiness is, and that alone should be everyone's goal in order to regain yourselves.","author":"alvary","title":"Some tips from someone who just recovered from the same problems","replyTo":"post360794","postID":"post1225128","date":"20100625-00:00:00 -0400","authorID":"http://ehealthforum.com/health/user_profile_287234.html"},{"content":"like many of you i have exactly the same symptoms and record as well. use to be the master of quick witted one liners. many friends, then it all went to the shitters. one constant variable is i noticed everyone here smokes pot and so do i. has anyone ever quit grass and achieved their previous state rather than an empty shell of their former self?","author":"dealerr","replyTo":"post360794","postID":"post1282676","date":"20101109-00:00:00 -0500","authorID":"http://ehealthforum.com/health/user_profile_321289.html"},{"content":"i got the same thing, but skimmin threw what everyones sayin kinda made me think, everyones all happy that theres poeple out there that have the same problems wrong with them but why get happy n giddy about it? realize if everyones like that that you rnot guna be that person anymore, dont think about it to much, JUST DO IT. thats life. who care is it dont meet your expectations, ve yourself, f=ck what other people think. you have your group of friends, they obviously accepted you when you were all happy n everyththing, so they had your back then and they got it now. be yourself and live live!","author":"thatguy1111111","title":"i use to be \"THAT GUY\"","replyTo":"post360794","postID":"post1313435","date":"20110131-00:00:00 -0500","authorID":"http://ehealthforum.com/health/user_profile_338988.html"},{"content":"I have the same \"problem\" if you can call it. I think it has to do with my view on the world, and how everything isn't really how it appears to be. And so I wanted nothing to do with what people call their reality. ( And still truly deep down don't ) but the some-what isolation, mainly mentally, but also socially at times has had a toll on my state of mind. In conclusion: I wish I was as oblivious as everybody else so I didn't have to live life like I'm the only sane person, because that can make you INSANE. =(","author":"JohnX","replyTo":"post360794","postID":"post1338742","date":"20110327-00:00:00 -0400","authorID":"http://ehealthforum.com/health/user_profile_354461.html"},{"content":"Stress, general depression, anti-social behavior, low confidence etc... The list goes on and on.. Big change/trauma in life can be a catalyst to this state...I can write 100 pages about this state of mind but due to lack of time, ill keep it short and state the top 5 things to do. 1) Get out of stress: graduate, manage/plan your life, find a purpose or what you want to achieve in life, etc.. 2) Don't judge yourself until you get out of stress and/or depression. 3) Choose your personality or find your equilibrium: something has changed and now there is a conflict in your brain between two personalities; the old you (in my case: the instinctual, impulsive, retarded funny one with a lot of friends etc...) fighting the new you (analytical, observant, smarter dull one who is not interested in the garbage people talk about). That's why you get word salad and stutter/mental block, the new one is fighting, criticizing, shutting up the old one, Mental block can be due to the new \"thinking you\" needing more time and experience so don't be hard on yourself and give it time or find a mentor to look up to, Basically either relax or think or use switches like I do i.e. asses situations and choose beforehand the state of mind you want to be in. this is important because there can't be two captains for one ship. 4) Get out of isolation as much as you can even if people are not interesting/interested. Think of your brain as a muscle, if you don't train it socially, it will shrink... also If you don't have a partner find one, you might want to get out of stress first so you can solve the anti socialism problem and find one. 5) Be happy, even if it's forced synthetic happiness. Studies show that \"synthetic happiness\" is the same as or is effective as \"real natural happiness\"...the line gets blurred here, if you forced happiness on yourself, it doesn't matter whether you are genuinely happy or not because it's an end in itself. Also do the same for hope, self worth and confidence if it doesn't come naturally. Pretend to be and overtime you will become that person, trust me.","author":"Blanks77","title":"Myriad of interconnected factors contribute to this state of min","replyTo":"post360794","postID":"post1353996","date":"20110420-00:00:00 -0400","authorID":"http://ehealthforum.com/health/user_profile_362595.html"},{"content":"the ssri's just mess u up more..xanax is the best for stress ,panic,Bad Mood and depression ..the hell what the doctors say...paxil messed me up..now i have sideFx..Xanax NONE","author":"XnickX","replyTo":"post360794","postID":"post1354051","date":"20110420-00:00:00 -0400","authorID":"http://ehealthforum.com/health/user_profile_362379.html"},{"content":"Strange that weed has that tendency to bring out the over analytical mind and in people with a sense of humour like everyone else here i had a sense of humour that was based on impulsive, intuitive wit that spured from being in the moment but weed really opened up that anxious, paranoid over analytical thinking for me. I guess someone people just aren't wired for it.","author":"ewenson111","replyTo":"post360794","postID":"post1447111","date":"20111019-00:00:00 -0400","authorID":"http://ehealthforum.com/health/user_profile_424853.html"},{"content":"I think what Blanks said makes a lot of sense. I am also going through the same problem, although I do not regularly smoke weed. My theory on it is trauma/big changes in life, and I also think that age is a factor. Everyone posting seems to be in late teens. Maybe it will go away in time as Blanks said it may be the 'old you' and the 'new you' conflicting with each other. I used to be a very social, outgoing person with many friends and popular with girls. MY problem was gaming, it has pretty much taken over my life, although I still get along with my friends, I do not go out with them as much and I find it harder to interact with people that I do not know. Secondly, I think that stress is a huge factor. For example exams, trying to find a career, etc. This strain can really mess you up without you knowing about it. I think that I am going to give it time and see what happens from then on. Good luck to everyone and I hope that your problems are short lived.","author":"TheRiddledOne","replyTo":"post360794","postID":"post1453319","date":"20111101-00:00:00 -0400","authorID":"http://ehealthforum.com/health/user_profile_429716.html"},{"content":"I think what Blanks said makes a lot of sense. I am also going through the same problem, although I do not regularly smoke weed. My theory on it is trauma/big changes in life, and I also think that age is a factor. Everyone posting seems to be in late teens. Maybe it will go away in time as Blanks said it may be the 'old you' and the 'new you' conflicting with each other. I used to be a very social, outgoing person with many friends and popular with girls. MY problem was gaming, it has pretty much taken over my life, although I still get along with my friends, I do not go out with them as much and I find it harder to interact with people that I do not know. Secondly, I think that stress is a huge factor. For example exams, trying to find a career, etc. This strain can really mess you up without you knowing about it. I think that I am going to give it time and see what happens from then on. Good luck to everyone and I hope that your problems are short lived.","author":"TheRiddledOne","replyTo":"post360794","postID":"post1453322","date":"20111101-00:00:00 -0400","authorID":"http://ehealthforum.com/health/user_profile_429716.html"},{"content":"Quite glad I'm not the only one as it has felt like it. Most things people are saying is true for me e.g. late teen, used to be on the ball; quick wits, popular.. and now i can't think etc. I do smoke weed regularly but i don't think this problem is caused by the ganj. I believe ganja/gaming/whatever is just a (sub)conscious short term solution (reality escape) from the real problem, as mentioned by Blanks77. Clearly these 'ST solutions' do not help our mental processes, but they do help out with short term stress. Under this all, the main cause of low confidence etc is up to a few big life changes. However, in my case I think one of the life changes is the gradual act of my humour not developing as much as my mates. This makes me think i'm less funny than i used to feel i was...","author":"jacknjill44","replyTo":"post360794","postID":"post1621378","date":"20120916-00:00:00 -0400","authorID":"http://ehealthforum.com/health/user_profile_547023.html"},{"content":"Happy to know m not the only person to feel like this ! neways i have times when i m totally funny ! more funny than the funniest of people around me ! but the sad part is it only lasts for some time ! its gone when i encounter stress ! so my advice will b to live freely ! dont stress yourself too much ! if u think u cant stop stressing yourslef think of the worst thing that could happen ! helped mee a lot to counter stress sometimes !","author":"din3sh","replyTo":"post360794","postID":"post1644649","date":"20121110-00:00:00 -0500","authorID":"http://ehealthforum.com/health/user_profile_563717.html"},{"content":"i wish anybody in this thread posted if they got better.... =[","author":"donro","replyTo":"post360794","postID":"post1870457","date":"20150814-00:00:00 -0400","authorID":"http://ehealthforum.com/health/user_profile_730162.html"}],"URL":"http://ehealthforum.com/health/topic58809.html"}