{"title":"Overachiever student very depressed","thread":[{"content":"Hi there. So I'm trying to vent to someone because it doesnt seem anyone really understands why I feel the way I do. I've always achieved at school and at university, but lately it just feels like I'm turning into just another mediocre person who fails at things. i am a post grad student and working on my masters, but in the last three years everything I have done academically seems to have failed. what would have been a simple and smooth project quickly turned into a disaster and I feel that it just keeps getting worse and worse. although most of my data collection has been complete i am supposed to write a thesis now but I just stare blankly at the screen as i just think of all the things of the last year that have failed. normally i would have been able to just accept that it was not my fault and move on, but the more things just went wrong, the more my depression grew. I also thought that if I can only do one little thing it would be on track again and I wouldnt feel like a failure anymore.. but then the next thing went wrong. to add more to the load, my scholarship ran out as both my parents are unemployed and always guilt me into taking care of them and i dont have any other means of income so I was almost homeless but moved back to my parents a year ago. this is much more depressing as before that I have lived on my own for four years and my independence gave me motivation. the opposite is true that now that i dont have any independence i feel very suffocated and stuck. I tried to speak to my advisors and tell them that i am really struggling because i am depressed and can hardly get out of bed so they should just be patient, but they dont really understand as they just want to see results. I feel so alone and dont feel anyone supports me. Whats even worse is that i had to work in another country with a very mean person who constantly criticised my work and now that i am back i feel like everyone knows about my aparent laziness and sloppy work as the place i study at is very gossipy. I feel like i cant face anyone. when i do work up the courage to go to my office, which used to make me feel better as I was surrounded by positive things and could work without feeling depressed, i get panicked if i so much as hear a door opening or closing. i fear a person will see me and report to my advisors that I am not 'really depressed' as they saw me 'flitting about' and then i they wont believe me when i say that my thesis is behind because i can hardly get out of bed. Many days i just lay there for hours and just bury my head in the pillow pulling the covers over my head and wishing i could just sleep forever. On days that i do feel like ive got control over things, i make pretty schedules and plan my time as i know gettting a routine helps ease the depression, but then if i cant stick to it, i get very depressed as I feel im just falling more and more behind. i had to extend my studies too and had to apply for an extension, but it felt horrible as it felt like i failed a year of my studies. the last thing i failed when i was 9 and i didnt study for a test on the frog. im 27 now. I try different things to try to get out of the anxiety and depression as the more anxious and depressed i get the less i can focus on work and the less i work the more depressed i become. our university has a tall building that is known for suicides and ive contemplated if it would hurt if i were to jump off it because i am so tired of thinking and worrying all the time. when i do get a breath of fresh air and it feels like my head is clear, i am on a roll and work endlessly, until the next interruption (my family is very dysfucntional and have crises after crises). Im surrounded by negativity all day everyday. Ive got a paranoid delusional , ex alcoholic father who has schizotypical personality disorder and a grandmother who also has some sort of depression and schizo something, then i have a mother who is anorexic (she also doesnt buy proper food so im not eating healthy) and constantly critises me. So altogether not a very good place to be in. but i have no where else to go. I have tried to get a part time job to save money and can now almost afford to live on my own again in an outside room, but ill be living with very little money for food so i am torn between the choices. worst of all is that i feel that even if i finish my thesis i have basically ruined my academic career as any future applications i make would need a reference and it feels that ive burnt all my bridges... I just feel so tired and dont want to do anything. Quitting is also not an option as i would then need to pay back approximately $24000.. i have thus realised something too. everyone wants to be special as a child. i finally felt like that as i excelled academically, but that was all i really was good at so i somehow associated my worth to that and without it i dont really have an identity. When an overachiever doesnt do well, it doesnt just feel like a gradual lower achievement, it feels like an absolute failure. I dont know what im going to do if this all doesnt work out. and even if it does, ive got no idea what to do in the future, and i think that is part of the problem.. why go on when you feel like you are destined to go nowhere. when i feel like im turning into my parents who just disappear into nothingness when the world continues without me... my biggest fear is to be insignificant. sincerely, very depressed overachiver","author":"goldenguy","postID":"post1861909","date":"20150625-00:00:00 -0400","authorID":"http://ehealthforum.com/health/user_profile_726205.html"},{"content":"I had to read very quickly and admit not read all sentences. But i did see ur age, and hopefully got the gist of the post. I sometimes didnt want to reply as soon as i read something, but sometimes i 'lose' a post when i cannot get back to it. So i'm writing a little now. Look, w/o boasting, there was a time i was also kind of overachieving. Somehow getting a scholarship or award could make a person proud w.o one realizing it, u know. When i first got a conditional grade in college, i didnt even want to go talk to my professor-- i was mixed ashamed, angry perhaps tho i didnt exactly know adn admit to myself. I tried to go to his office again and again, but finally decided i wouldnt! And i didnt. So i lost my scholarship. (whew, this is the first time i'm relating this online). Anyway, to make it short, sometimes events are humbling experiences when we have to learn some lessons (i mean life lessons) bec. we can be so academic and all but so poor at common sense stuff and even social relations. How impt it is to balance so while young, strive to balance as best u can. You can start by praying, as far as i cant tell.","author":"samm00","replyTo":"post1861909","postID":"post1862112","date":"20150626-00:00:00 -0400","authorID":"http://ehealthforum.com/health/user_profile_707378.html"}],"URL":"http://ehealthforum.com/health/overachiever-student-very-depressed-t455705.html"}