{"title":"Why can't I just be happy?","thread":[{"content":"Hi I'm 21 and completely ungrateful about everything... I didn't used to be like this and I don't know how I got so sick. I've recently quit drinking and it's so hard to deal with my emotions..it reminds me why I kept on drinking after I started.. I hate feeling like this I don't do good dealing with my own thoughts I'm constantly trying to distract myself in any ways possible because once I start thinking I just throw myself into a very bad depression fit and I start crying and my head starts to hurt and I can't help the thought of how much I hate myself and how much of a failure I've been my whole life.. usually people get depressed and sleep. I get depressed and can't sleep when really all I want to do is sleep for a very long time. Atleast when I'm sleeping I'm not downing myself. Sometimes I wish everyone would just go away because they've seen me at my worse and it's so embarrassing I used to get stupid drunk and make a fool of myself now everyone knows I'm just a loser and they think I don't want to change when I have been trying it's just so hard not to run away from my emotions for once in my life I'm dealing with it sober and it hurts so much... I don't know why I do anything anymore other than to just be alive I feel so empty..","author":"ultimateloser","postID":"post1870480","date":"20150815-00:00:00 -0400","authorID":"http://ehealthforum.com/health/user_profile_730182.html"},{"content":"Hey ultimateloser, I understand how your feeling. I've been feeling like this for a while now too and I am 22. It's gotten so worse to the point where I've been feeling suicidal. I feel like I am better off dead and I just can't take this pain anymore. Don't drink because it will make things worser. I always think that it will help but the next day I will always feel like crap and my anxiety goes tenfold, so that's why I don't drink anymore. I sleep a lot on the contrary, even though it doesn't help, its become a bad habit of mines. It may feel like you have made a lot of mistakes, but everyone makes mistakes, the only reason why yours seems worser is because your depressed. Everything seems worser than it truly is when you are depressed. Don't believe the lies, you should think about seeing a counselor or even try meds. Life is too short and you don't have to live like this. My prayers are with you.","author":"Zandy12","replyTo":"post1870480","postID":"post1870565","date":"20150815-00:00:00 -0400","authorID":"http://ehealthforum.com/health/user_profile_729982.html"},{"content":"Some Home remedies which you can try for your depression: 1. plenty of good quality sleep 2. Healthy, nutritious diet and a healthy lifestyle 3. Regular exercises 4. Spending time with family and friends 5. Mind- body techniques for easing depression symptoms : a. Yoga b. Meditation c. Acupuncture d. Massage therapy 6. Learn about Bipolar Disorder as much as possible 7. Avoid recreational drugs or alcohol abuse These remedies are to be used only in mild conditions, in case of severe or chronic conditions visit your doctor.","author":"HealthAnge","replyTo":"post1870480","postID":"post1870710","date":"20150816-00:00:00 -0400","authorID":"http://ehealthforum.com/health/user_profile_725941.html"},{"content":"Someone suggested to a businessman that he read a chapter of Proverbs everyday. With 31 chapters, he reread the book each month. After several yrs, he found proverbs popping into his head whenever he encountered a situation that required wisdom or courage. Like when he tempted to talk too much, he recalled Prov. 10.19'…he who holds his tongue is wise.’ or Prov. 16.22 'A joyful heart is good medicine, but a broken spirit dries up the bones...'","author":"samm00","replyTo":"post1870480","postID":"post1871644","date":"20150823-00:00:00 -0400","authorID":"http://ehealthforum.com/health/user_profile_707378.html"},{"content":"Find a Jehovah's Witness church go talk to some one there ask for help they will help you and explain what you are missing in your life .this is not a joke","author":"Yucaipa","replyTo":"post1870480","postID":"post1871851","date":"20150824-00:00:00 -0400","authorID":"http://ehealthforum.com/health/user_profile_730868.html"},{"content":"Seriously find a Jehovah's witnesses church ask for help they will explain to you what you are missing in your life , no joke do this you will see your life will change for the better","author":"Yucaipa","replyTo":"post1870480","postID":"post1871852","date":"20150824-00:00:00 -0400","authorID":"http://ehealthforum.com/health/user_profile_730868.html"}],"URL":"http://ehealthforum.com/health/why-can-t-i-just-be-happy-t458373.html"}