{"title":"No reason to live (Page 1)","thread":[{"content":"I've been depressed for most of my life, as long as i can remember really. I no longer feel like there is any reason for me to live, there is almost nothing in my life that's worth living for, i have no hope, no future, no desire for anything anymore. I feel almost nothing these days, no joy, no happiness, nothing good, just an overwhelming sadness and loneliness that's slowly killing me. I've lost most of my attachments to this world, i no longer care about family or friends, i've all but given up on finding someone to love, how can someone love me when i hate everything about who and what i am, how can you love something that doesn't know how to love in return. Everyday i wear a mask to hide the way i feel from everyone, i've been doing it for so long that it's become just like breathing, no matter how much pain i'm in i'll still smile and say everything's fine. I don't want to be like this any more, i don't want to feel this way, but there's nothing i can do. There's nothing out there that matters to me anymore, there's nothing i want out of life and nothing that interests me. I don't want to die just yet i guess, but i have no reason to live either, so what do i do?","author":"lostandalone85","postID":"post1090830","date":"20090904-00:00:00 -0400","authorID":"http://ehealthforum.com/health/user_profile_216859.html"},{"content":"I understand that you have been feeling depressed for a very long time. Your feelings of sadness, hopelessness, worthlessness, and thoughts of death suggest that you are suffering from severe depression with suicidal thoughts. Not wanting to do things you used to enjoy is also probably part of your depression. Because you are feeling suicidal, I recommend that you go to your local emergency room immediately to receive help. You may want to tell someone close to you about your feelings and call your doctor to let him or her know you are going to the hospital.","author":"Dr. Kelly Romirowsky","replyTo":"post1090830","postID":"post1090945","date":"20090904-00:00:00 -0400","authorID":"http://ehealthforum.com/health/user_profile_206534.html"},{"content":"What good will that do, do you think a pill will be able to replace having a will to live? Everyday all i see around me are new ways to die, new temptations. Cars speeding by, bridges with rock filled creeks far below, loose rope or wire hanging from a tree branch, when i drive i often think about speeding into a tree or a telephone pole or other cars, at work we use sharp knives and gas ovens, and at home... did you know that if you think hard enough about an object you can find a way to use anything to end life. Everywhere i look around me right now, i can see 100 ways to die. Each night when i sleep, the breif moments of nothingness are the only peace i've found. My dreams are amazingly vivid and real, i can feel, taste, smell and experience everything as thought it were real. Almost every night i dream about dying, i feel it, i live, i can't escape it. I've died a thousand different ways in my dreams and each time i've felt the agony of every moment and i remember and relive it each time i wake. It's not that i want or don't want to die, it doesn't matter to me at all infact, nothing matters anymore. my life has become so meaningless and empty and lonely that i no longer feel alive, i've become nothing. When you decided to change the name of my post you changed the whole point. I don't care about not having or having a reason to live, it makes no difference to me if tomorrow i die or if i don't. I just don't know what to do anymore, what do i do if there is no reason for me to exist?","author":"lostandalone85","replyTo":"post1090830","postID":"post1091455","date":"20090906-00:00:00 -0400","authorID":"http://ehealthforum.com/health/user_profile_216859.html"},{"content":"You have sad the things I could not get the words or center my thoughts to say.","author":"AndWhy","replyTo":"post1091455","postID":"post1489931","date":"20120111-00:00:00 -0500","authorID":"http://ehealthforum.com/health/user_profile_456103.html"},{"content":"I have no job,no money.. my wife is divorcing me because i am struggling to quit smoking. I only smoke 1 cigarette a day broken into a few puffs each time over the course of the day. i guess that's silly to think your wife would abandon you over such a petty failure. I have no family that cares or I want to care.... I give up... I just want to die. All woman are the same... tear you down until your worthless to yourself and just had enough...I just hope God forgives me as I finally quit. i guess I have been trying for a period to quit...lack of job, stress at home, hateful mother, losing the only woman who truly loved me unconditionally..my gramma.I guess the only sure quit is to die....I have nothing left to live for..I just want to leave her a letter saying\" I Quit, for you,because I love you\" and die.. her wishes would be met.","author":"evets27","title":"death and suicide","replyTo":"post1091455","postID":"post1660674","date":"20121222-00:00:00 -0500","authorID":"http://ehealthforum.com/health/user_profile_575794.html"},{"content":"Please, please, please get immediate help for yourself!!!!! Know that you're an extremely valuable person and that you deserve all the tools that are available to help yourself!!!!! You are in my prayers and thoughts. I, too, have been depressed and have felt very alone in life. Believe me, there are many others like yourself who do as you do, make everyone believe that they're all right even though they're feeling awful inside. You are not alone. We're out there. You need help, and fast. If you cannot get yourself out the door to get help, please at least do this exercise for your emotions: Set a timer for 20-30 minutes at least and type like crazy on a Word document all positive things that come to mind about yourself. Do not pause. Keep going until you've filled up page after page about positive things. It doesn't matter if they're not true for the moment. Don't judge yourself. This is stream-of-consciousness typing, very fast. Each time you feel depressed, go to the computer and start typing positive things again. Just as a person can have clogged arteries from years of eating the wrong foods or genetic predisposition, we can also have \"emotional arteries\" that become clogged with negative thoughts until we lack motivation for doing anything. Please try this exercise. You need to feel worthy. YOU ARE WORTHY!!!!! Do not shortchange yourself any longer!!!!!","author":"sdan","replyTo":"post1090830","postID":"post1092844","date":"20090909-00:00:00 -0400","authorID":"http://ehealthforum.com/health/user_profile_218027.html"},{"content":"it is amazing it feels like you just described my life as well, i feel the same way, i struggle to find a reason to wake up in the morning i just wished that one day i won't wake up. you go around with a fake smile just please people when your dead on the inside, i tried that positive excessive only problem i ended up writing more reasons why i don't like my self","author":"lg_lg_20","replyTo":"post1090830","postID":"post1097089","date":"20090919-00:00:00 -0400","authorID":"http://ehealthforum.com/health/user_profile_220387.html"},{"content":"To lg_lg_20: I know it's difficult to type positive messages to yourself when you've been feeling negative for a long time (believe me, I've been there, done that, and have finished with it, goodbye and good riddance to it because it did nothing for me except keep me down). The goal is to type ONLY positive things about yourself, NO NEGATIVE. If you start typing something negative, turn it around to a positive, like: \"I love and appreciate myself very much,\" or something like that. Type it over and over again until something else that's positive comes into your mind that you want for yourself. If you have a goal to be a success in a certain field, for instance, type something like: \"I am now working successfully on...\" whatever you would like to be. Type everything as if it's in the present, as in \"I NOW have a positive outlook on life,\" instead of \"I will have a positive outlook on life.\" When I'm typing positive sentences, I'm also automatically picturing doing those things that would make me happy, so the typing helps point me in the right direction for the day. It takes time and effort to change your way of thinking, but it's absolutely worth it. You might look up on the Internet some positive affirmations that you can type in the beginning to get yourself started. Later on you'll think of sentences on your own to type. I do this as an exercise in the morning for about 30 minutes. I know that seems like a lot, but the result is that throughout the day I'll find myself automatically saying positive things to myself, which is something I welcome, since I spent so long saying mostly negative things to myself (which got me absolutely nowhere). Good luck!!! YOU DESERVE ALL THE VERY BEST that life has to offer, lg_lg_20!!!!","author":"sdan","replyTo":"post1090830","postID":"post1097148","date":"20090919-00:00:00 -0400","authorID":"http://ehealthforum.com/health/user_profile_218027.html"},{"content":"wow.....it's as if you are describing me as well..except for the dream part. I can see thousand of ways to kill myself when i just look around me Y^Y its horrid. i want to keep on sleeping, hibernate or sleep forever. Almost all the time i thought of dying, nothing in the world suits me, i don't belong here, I've got no love, no *true friends* who i can really depend or talk to, I'm not good in anything, academics, music, sports, art...knowing the truth of the reality is very very sad... and through out my whole life, everything is going against me. I often argue at home, i can't talk to anyone, sschool frds are always two face biotch so i had to put on my mask every single day and laugh with all i've got to hide myself away. It's as if the world, everyone doesn't like me... i really really want to die...BUT you see, there are still a lot of things, many things in the world i haven't done or experienced...\"i think this is why you don't want to die yet\" AND for me, don't know about you, i need to get a good and stable job in the future to be able to give my mom a good life, she's been much worst than i am, but she still strive with all she got, so i can't leave it be....even though i don't want to care about family and friends and i can just go to a place no one, be myself, free. i agree with you too, a pill can do us nothing...once u look at the surroundings, you will be back to your extreme depressed mode. sdan \"I am now working successfully on...\" by typing that won't work, perhaps if worked for you but not for others, i mean lostandalone can try but if you think about it...what are you working successfully now? it's nothing...if i just make something up, that would be lying to myself. anyways...because i can't find anyone to talk to in my real life, so i try my best to find someone online to talk to, or even typing a blog would help a little, at least temporary cause really i think when someone is so depressed, like you and i really need someone who we can hug on to, cry with all our might and spill everything out...(only if you have someone that can be trusted). If possible try start to think a bit positive, there's no harm to it. Anywayssssssssss............try putting a little effort in everything you do, there will always be a little difference, and that little difference is already like a light to you. btw, watch something funny and laugh your arse off....or watching something sad and help cry yourself a little or go for a walk for taking some fresh air or eat BUT NEVER.>> please do not go to the path of self harm... this is just my suggestion, what i think, oki,...","author":"CrimsonNight","replyTo":"post1090830","postID":"post1097194","date":"20090920-00:00:00 -0400","authorID":"http://ehealthforum.com/health/user_profile_203737.html"},{"content":"yeah i agree doing things that make you feel good make you laugh i tried that for a while i even made sure i did regular exercise just in case it was something with my health but in time i started thinking of ways to kill myself then that let me down the same road i was on before just pretend put on a smile. i have also been isolating myself for awhile I've separated myself from friends and family i haven't spoken to any of my previous friends for two years but one day they contacted me i decided to meet up with them and i realized i didn't know these people anymore so i left and haven't spoke to them since. and then I'm slowing fading out my family's life. all in all i'm slowly going disappear all together. people tell me to get a life i ask them what is your classify as a life most people turn and say get your own home and family but i don't care about having my own home and i don't want to make any connections i.e family ooppps I've waffled on long enough i don't use forums often now i think i know why","author":"lg_lg_20","replyTo":"post1090830","postID":"post1097213","date":"20090920-00:00:00 -0400","authorID":"http://ehealthforum.com/health/user_profile_220387.html"},{"content":"Listen to your thoughts, people! Believe me, I've been down about myself and my life for decades, and from that very long path I've come to realize that it's the thoughts that I give to myself that either raise my spirits or keep me down. I was angry about life for a very long time, then lost all motivation. People in my family passed away, another downer. I suddenly realized that I cannot live this way any longer, that I don't deserve a life where I'm feeling that everyone else deserves good things but I don't. Typing positive things about myself has helped turn my thoughts around. It takes time. There are no quick fixes here. I set a timer because I know it requires discipline to sit down and do it. But I also know that I need positive messages to live a good life because they form the basis for the type of life I lead. Do I want to keep telling myself that I'm a loser and that there is nothing for me in the future? No, not anymore. I won't do that to myself any longer. I've been to a number of therapists in my life who all tried to help me. But in the end I realized that it's what I think of myself that matters the most. It's like being addicted and going to rehab (i.e., therapy) and then, as soon as rehab is over, I'm back to using again (negative thoughts). By the way, having a number of addictions didn't help either: drugs, alcohol, eating disorder. Just more ways to defeat myself. Those had to go from my life because they perpetuated negative thinking as well as being very destructive. I have to look at myself as my own best friend, not my worst enemy. What have I learned from going down the long road of negativity? That it feeds on itself and gathers speed as it goes downhill, that it's difficult to stop but that I had to stop it and fill my mind with positive thoughts. It started with a critical parent, and then I carried on from there, mindlessly, for a very long time until I realized I was nowhere in life. Now I'm slowly building myself up again, and with me it begins with my daily thoughts, the messages I give myself. Obviously putting myself down hasn't served me well. Please tell yourself some positive things about yourself each day, something that you appreciate about yourself. I know it's tough to start on a different path because the more familiar way, though abusive, has become a deeply-ingrained habit. Start small and build up. Maybe type 5 minutes a day some positive things about yourself and then stop, instead of doing it for a longer period. Listen, you deserve a great life, and you deserve to be valuable to your community and to society in general. But more than that, you deserve to have a trusted friend in life: YOURSELF. Give yourself the gift of loving thoughts. Quit the road to negativity. You're at the fork in the road. CHOOSE THE POSITIVE (from one who's been down the other path much too long).","author":"sdan","replyTo":"post1090830","postID":"post1097265","date":"20090920-00:00:00 -0400","authorID":"http://ehealthforum.com/health/user_profile_218027.html"},{"author":"concernedn","title":"Mirror Image of My Life","replyTo":"post1090830","postID":"post1097332","date":"20090920-00:00:00 -0400","authorID":"http://ehealthforum.com/health/user_profile_176715.html"},{"content":"Can you get some help??? This is beyond forum advice. Do you have a spiritual advisor of some kind? Do you have family that can help? If not, is there someone else close by? A suicide prevention hotline? Life is worth living, but you have to take the steps to make it happen. Being in a downward spiral is not the way to go. Have you thought of getting antidepressants for the time being? I offer my prayers for you. Please get help. There is help out there. Being alone is not a good idea. Look around, and you will see people who need your help in this world. You are a very valuable person. You have gifts that the world needs. Please do not waste your life. A belief in reincarnation may reinforce the idea that taking your life would not ever be a good idea. What caused all of your self-loathing? What is at the core of it? I would like to know.","author":"sdan","replyTo":"post1090830","postID":"post1097402","date":"20090920-00:00:00 -0400","authorID":"http://ehealthforum.com/health/user_profile_218027.html"},{"content":"concerndn, you just said a inner me \"D i completely understand and yes i do\"3 sdan do u not get the point?..it is that there is no one to consult to, some people who are depressed has someone to talk to but for some certain unfortunate one, there is no one there for them, no one there for them to consult to, cause this person will tell that person, or this person will think of me as a weirdo, or i don't want to bother my family. 1 example, if i ever tell my parent about it...i would be beaten and or scold badly and which would make me more depressed;. Everyone is different frm another, their surroundings, their ability to do something and many many factors. wellllllllllllllllllllllllllll i agree, try to think something positive, sometimes when i get ot laugh..ill just try to laugh with all i got....just to feel happier that day. anyways, frm what i heard from you, i know you won't suicide, because there is still sumthing inside you, something that links to you that does not allow you to suicide..i hope this is you.cause this is me, so lets try to strive for a better life/ when something bad happens to you, become numb, n think..ugh..something bad happened again...just leave it..n the next day start a new/","author":"CrimsonNight","replyTo":"post1090830","postID":"post1097591","date":"20090921-00:00:00 -0400","authorID":"http://ehealthforum.com/health/user_profile_203737.html"},{"content":"CrimsonNight, I'm so sorry that your parents would beat or scold you for asking for help. You need love and support!!!!! I used to think that all the people around me were more together than I was and that I was always the weirdo of the group. I was an absolute mess. Then I happened upon a job where I dealt with people from all walks of life. It was a real eyeopener to realize that people I thought had everything actually had the same problems everyone else had, the same doubts about themselves, the same fears. Do you have something to set your sights on, like some goals to achieve? Something you can focus on that's positive? Being really focused on a goal helps take away fear as well as helps raise self-esteem. One thing I like about Michael Jordan is the fact that he wanted to prove people wrong who put him down. He gave it all he could in basketball, and proving people wrong was one of his prime motivators. Just start, a little each day, to get ahead in life. Of course there will be setbacks; those are to be expected. But don't let the setbacks keep you down. Just keep improving your life, little by little, by doing something kind for yourself each day, giving yourself some positive messages about yourself, something you really like about yourself. And then keep building up from there. It used to be all or nothing with me. If I failed at one thing, I might as well have been a total failure. Then I would stop trying and would give up. DON'T GIVE UP ON YOURSELF. I look at where I am and start from there because I know it's not a good idea to compare myself to others. I'm working on being my own best friend, treating myself with love and respect, watching what I put into my body and giving myself positive messages about myself no matter what type of day I've had. CrimsonNight, treat yourself with love and kindness always, no matter what happens around you, no matter what negative messages you get from others. Just keep walking forward in life. You will start to attract people who want to help you and who are kind and trustworthy. I wish you all the best!!!","author":"sdan","replyTo":"post1090830","postID":"post1098315","date":"20090922-00:00:00 -0400","authorID":"http://ehealthforum.com/health/user_profile_218027.html"},{"content":"just out of curiosity what happens to you if you fail to commit suicide do you get locked up in a white jacket or arrested and sent to prison. just wanted to find what would happen to someone if they failed to kill themselves.","author":"lg_lg_20","replyTo":"post1090830","postID":"post1098844","date":"20090923-00:00:00 -0400","authorID":"http://ehealthforum.com/health/user_profile_220387.html"},{"content":"My sister tried to commit suicide many years ago, and she was able to get psychological help. lg_lg_20, DON'T WAIT TO GET HELP. YOU NEED HELP; otherwise, why would you have constant thoughts of doing away with yourself? Those are not healthy thoughts. Can you talk to someone at a suicide hotline??? Please do that. There could be an imbalance in your system also. My sister was bipolar, but we didn't know it at the time. PLEASE take that first step and call the hotline. They would know what you could do to get help, and the low cost involved. You cannot be isolating yourself. You need to be a part of society. Okay, I admit, life is difficult a lot of the time. There are so many ups and downs. Having a goal is important. You don't have to take giant steps. Just start small and build up, okay??? BUILD UP, not down. Please tell us on this forum that you are getting help. You owe it to yourself to live a good life filled with joy and accomplishment, feeling proud of yourself for who you are. PLEASE GET HELP NOW.","author":"sdan","replyTo":"post1090830","postID":"post1098907","date":"20090923-00:00:00 -0400","authorID":"http://ehealthforum.com/health/user_profile_218027.html"},{"content":"well cheers for the advice but unfortunately i don't want to help myself, i don't enjoy life, i don't want to exist. i only decided to write on the forum because what the first person wrote it was very similar to how i feel. I don't normally talk about it so this is a rare occasion, but all the same cheers for the advice.","author":"lg_lg_20","replyTo":"post1090830","postID":"post1098926","date":"20090923-00:00:00 -0400","authorID":"http://ehealthforum.com/health/user_profile_220387.html"},{"content":"You sound like a very nice person, and therefore you need to be here on the planet with the rest of us!!! What if you were to make a 180-degree turn and just walk the way of the positive? Have you ever given that a try? What's to lose? What about taking some classes in meditation and yoga? Body, mind, spirit, the trinity. Give life a chance, won't you????? The energy you expend on not wanting to live could be channeled into something wonderful, something artistic, creative, helpful to others. An art class??? A writing class??? Do you have a job? Are you going to school at all? How are you isolating yourself from people? Okay, too many questions, I know, but it seems to me that you have too much to give in life to sit and feel that you shouldn't exist. Just my opinion.","author":"sdan","replyTo":"post1090830","postID":"post1098934","date":"20090923-00:00:00 -0400","authorID":"http://ehealthforum.com/health/user_profile_218027.html"},{"content":"thats my point i have nothing to give i basically homeless unemployed and there is nothing that comes to mind that i do enjoy i have no friends because i disappeared out of there lives all in all i don't even laugh anymore, i don't say your only like this because of your current situation no i have been this way for as long as i can remember which i guess is about 10-11 yrs maybe more. as the forum header says i have no reason to live i don't effect people's lives anymore","author":"lg_lg_20","replyTo":"post1090830","postID":"post1098945","date":"20090923-00:00:00 -0400","authorID":"http://ehealthforum.com/health/user_profile_220387.html"},{"content":"Okay, look, there are places you can go to that would help you as a homeless, unemployed person. Every city has resources. Can you get help from them? 10 or 11 years - well, hmmm, that's how long it's been since I've had a date since my divorce, but I'm on my way to changing that at some point. There's just been a lot of fear. YOU CAN CHANGE YOUR LIFE!!!!! It takes effort, I know. I mean, I haven't gone out on the dating scene so no wonder I'm the way I am. But don't look at the whole rest of your life as it is right now! Things can change for the better!!! My last depression, I was in bed staring at the ceiling and seeing only a blank slate, nothing there for the rest of my life. It scared me so much that I finally decided to set some goals in order to get my life going again. I had to think, what is it that I enjoy doing??? Even the small things, think of those things. Sometimes I stop and say to myself, \"Why am I doing this? What is it all for?\" But then I realize that I've made a choice to go the positive route and to have a good life for myself. You can change your life, lg_lg_20!!! Make it happen!!!!!","author":"sdan","replyTo":"post1090830","postID":"post1098974","date":"20090923-00:00:00 -0400","authorID":"http://ehealthforum.com/health/user_profile_218027.html"},{"content":"Hello, lg_lg_20, I've been thinking a lot about your homeless situation. I know this sounds crazy, but if you ever need a knitted hat to keep your head warm in the cold, I would like to knit you a hat and send it to you. That way you would know that someone out there cares for you. I wouldn't know where to send it, but maybe you could give me a general delivery address or something. Let me know!!!","author":"sdan","replyTo":"post1090830","postID":"post1099305","date":"20090924-00:00:00 -0400","authorID":"http://ehealthforum.com/health/user_profile_218027.html"},{"content":"I'm not out on the streets at the moment I'm staying with someone i know but that won't last to long and when that does happen i won't be the streets for long. and as to giving you my address for one i don't know you and secondly you would most likely alert someone that i was suicidal which I'll pass on that idea. but thanks for the offer but I'll pass. and anyway my i ask why you are so concerned people die every day of every hour whats one more","author":"lg_lg_20","replyTo":"post1090830","postID":"post1099739","date":"20090925-00:00:00 -0400","authorID":"http://ehealthforum.com/health/user_profile_220387.html"},{"content":"Hello, lg_lg_20, I wasn't thinking of alerting anyone, but I can understand that you would be wary. I'm concerned because I know that even in the worst situations, there is hope. But one thing you need to do is to start turning around and thinking differently about your life to give yourself a chance. YOU CAN DO IT!!!! You need encouragement in life, and even though I don't know you, I would like to offer encouragement. My sister was only 17 when she tried to commit suicide, and I'll tell you, if she had, so many people wouldn't have benefited from her wonderful spirit. As it was, she did pass away from lung cancer at age 59, and she was also a recovering alcoholic as well as being bipolar and hooked on prescription pills. But she was the most amazing person. Unfortunately, she didn't see herself in that light a lot of the time, but everyone else saw it. She turned her life into a spiritual quest, which helped her a great deal, and she was a very intuitive person. What I'm trying to say is that you have gifts to offer the world. The hard part can be discovering what those gifts are, especially if your parents or other authority figures squashed those gifts or didn't notice. What is it that you enjoy doing with your time? That is a start to discovering what your gifts are. Whatever that is, go for it. Do more and more of what you enjoy doing. It could even be taking walks out in nature or reading or whatever. Drawing? Some type of art? Writing? Because if you're feeling down, some creative part of yourself isn't being fed and needs to be in order for you to be free. LET THAT CREATIVE, ARTISTIC SPIRIT OUT!!!! It's something that lifts your spirit and helps you focus so that you're not aware of all your troubles but you're just having fun and time passes and you don't even notice. You may have to get art books out of the library or something. It seems to me that people who want to commit suicide are so many times people who are very artistic in some way. My sister was also. I just want to make sure that you don't go down that sad path of doing away with yourself, lg_lg_20. Now, that would be a total waste. Do you pray? Do you have some deep spiritual feelings? Even though I don't attend church, I do pray and ask for guidance a lot, which helps me very much. Maybe going into a church and just sitting there, when it's pretty empty, would help. Just you and God, you know? Give a heartfelt talk and spill all your troubles. Then walk out of church and feel that a weight is lifted. Keep doing it until your life starts changing. ONE STEP AT A TIME, YOU CAN DO IT, lg_lg_20!!!!","author":"sdan","replyTo":"post1090830","postID":"post1099767","date":"20090925-00:00:00 -0400","authorID":"http://ehealthforum.com/health/user_profile_218027.html"},{"content":"Hi lg_lg_20, I'm just wondering how you're doing. Today hasn't been a good day for me, but I'm looking forward to a better day tomorrow. I do think about you and hope you're hanging in there!","author":"sdan","replyTo":"post1090830","postID":"post1101171","date":"20090928-00:00:00 -0400","authorID":"http://ehealthforum.com/health/user_profile_218027.html"},{"content":"i'm also having a fantastic day life just on you all the time. it always makes me ask myself whats the point. and i'm not looking forward to tomorrow because all that will bring is more crap. HAPPY DAYS but what is the point i just can't understand i don't believe in god i feel i'm slowing falling deeper and deeper in to darkness and i don't even care. well never mind what's the saying or something along those lines. so what was it that got you down","author":"lg_lg_20","replyTo":"post1090830","postID":"post1101389","date":"20090929-00:00:00 -0400","authorID":"http://ehealthforum.com/health/user_profile_220387.html"},{"content":"Hi lg_lg_20, Well, I have to keep looking up. Yesterday I don't know exactly what happened except that I probably didn't eat right or something, but I ended up sleeping for hours and then just sitting, knitting, and reading, feeling very low, probably a physical imbalance. At least I got something done, but I was down in the dumps. I'm going to be moving sometime in the near future and then would like to get a job and be out in the community. I know I'll have these days. They've been with me all my life. I just have to keep looking forward. And I do type the positive affirmations every day. That helps me very much. You take care of yourself and be good to yourself no matter what the day brings, okay, lg_lg_20?","author":"sdan","replyTo":"post1090830","postID":"post1101421","date":"20090929-00:00:00 -0400","authorID":"http://ehealthforum.com/health/user_profile_218027.html"},{"content":"not sure why i'm writing because i have decided that i don't want help anymore i'm feel so tired i just want it to end so i won't do anything for a couple of months or sooner depends on how things go. i've been thinking about there is nothing holding me hear, i feel empty. i can't just simple exist anymore i don't want to exist, i can't look to the future to say i could do this that and the other all i see is darkness. what do you believe happens when you die because i believe that there is nothing you simple cease to exist. sorry for the rant i just needed a outlet sorry if this upset you but i wish you all the best for your future regards LG","author":"lg_lg_20","replyTo":"post1090830","postID":"post1104759","date":"20091007-00:00:00 -0400","authorID":"http://ehealthforum.com/health/user_profile_220387.html"},{"content":"I see what you're talking about. I feel like the same. Touching from the distance, further all the time. The differences? I'm getting a little better now, or maybe I'm just pretending to myself. I'v been cutting myself and well, waves of self-harm and self-hate. It sucks. NEVER START SELF-HARM! That's where the trouble really started. I've been wearing a mask for years over years. I've talked to quite some friends, but they say they can't help me anymore. One of them's been thru a lot more crap than me, but if I talk to her now she always says the same, she gets angry. They're fed up with me. I was a really closed person, then I got a boyfriend, he and my friends talked me into opening up, I started talking about everything, Got worse every day, but now they can't help me anymore, and I don't want to upset them so I just shut up now. I'm putting on my mask again, oh hell, I don't want this. I hate it so badly. I have eating and sleeping disorders. I'm physically ill because of my bad mental health state. But I'm trying really hard to get to think positive. I need advice, but I mainly just need people to talk to. I'm really good at academics and stuff, quite good at sport, I;m the girl everybody's jealous to cause she seems so very smart and happy. But in fact I just want to be an artist, I'm not bad but I have no talent. Like no. I hate that, really hate, hate hate. I have attacks in which I'm completely out of control. Yet I'd rather help others than myself. I care abotu others, that's why I hate talking, I don't want to bother people. PLEASE DONT BOTHER PEOPLE. But I can't go on like this. I've been numb, just totally numb numb numb. The situation you describe, I know it. OK, now some advice. Don't get isolated. That's hypocrite because I'm getting emotionally isolated every day more and more, and I can't help it. Touching from a distance, further all the time. But, physically, I'm trying to be with people. It's safe to, to be with people. Make free time. There's always people who love you, even though you hate them so much, hate yourself so much. Even though you hate them, there might be someone who understands you, and will help you even though you say you hate them and shout at them. You're not alone. You'd be amazed to find how many people are depressed. My physical health is going down faster and faster. That's why I don't believe my mental health is actually getting better. Now another tip. WRITE. Even though you're not a talented poet, write. it really helps. Or put your thought in music, noises, whatever. Write diaries, letters, dialogues. But don't write negative things. And don't get isolated. Talk&Write. The problem with me is, I write peoms and lyrics, I've got like 90 of which 85 are depressing. Well, I'm trying. I'm writing, or trying to write a diary too. For 2 days, I've just been carrying a notebook with me, writing all my thoughts down, during lessons, free hours, whatever, whenever I can. It helps driving out the numbness. I feel like I'm a split person. I can sometimes hear voices in my head. Sometimes I hear my name being called. I often argue with myself in my head. But I can't destroy myself. But I try to be positive. Try to do things you used to enjoy. And if you can't think of them, find something new, just something. Listen to happy music, no depressed songs. start not to happy, that will only annoy the crap out of you. If you're angry, and agression is building up in you, dont turn it on others. DO NEVER EVER TURN IT ON YOURSELF. go kickboxing or so. No serious. Get out, get fresh air. sit down on a bench under the trees. Loook around. You are alive. If you really wanted to die, you would have suicided long ago. Something makes you cling to life so desperately. Find it. Look around and find it. Look for things that please you, and write them down. Maybe it's just a view. Maybe it's a song, a person, a comment, a piece of artwork, a colour, a feeling, a thought, your neighbour's cat, a colleague, a noise, anything. Don't look at other people and think 'they are so much better off. why do I get all the crap in this world?' you dont. everyone gets crap. Prove you are atrong. Oh, you've got to carry that weight. But don't suppress it, DON'T FIGHT YOURSELF. try to find peace inside yourself. Holy Jesus, I sound like a priest. Lol. I'm just making this all up right now, and I'm not doing any of these things. SEe, there's some positive energy in mee. Even though I'm just drained all thru the day. Sucked. My text is messy, oh really. try to pick important things out of it. the last part is best I s'ppose. maybe someone could give me some advice to, or just talk. whatever. I like to try and help people. I like to talk. That's the spirit. Oh hell. Spirit. sure. I hope my English doesn't disturb you. I'm not a native speaker and I'm only learning English for 2 years. Peace Love Dream Flowers.","author":"WhiteFlower","replyTo":"post1090830","postID":"post1104974","date":"20091007-00:00:00 -0400","authorID":"http://ehealthforum.com/health/user_profile_224582.html"},{"content":"hi there dream flower how can i help you maybe that will improve my mood tryng to help some 1 what has been getting you down of late not really sure what else to say.","author":"lg_lg_20","replyTo":"post1090830","postID":"post1104986","date":"20091007-00:00:00 -0400","authorID":"http://ehealthforum.com/health/user_profile_220387.html"},{"content":"If my family was gone, I would have no reason to live, I would kill myself immediately. I hate this life, I'm only 19, but I have screwed up so many times, that anything good seems unattainable. I prefer to just hide away, but when I do socialize, I put on this mask of perfection, and I try so ridiculously hard to appear to have no weaknesses. The only reason I don't just die right now is because it my would ruin my entire family, immediate and extended, and I believe that being cause of the resultant pain and suffering would be an incredibly evil act. I constantly think of ways where I could leave this earth and not leave my family name besmirched. I hate that I hate","author":"PsyChameleon","replyTo":"post1090830","postID":"post1115180","date":"20091031-00:00:00 -0400","authorID":"http://ehealthforum.com/health/user_profile_230134.html"},{"content":"Dear PsyChameleon Nobody is perfect. We all make mistakes. Anyone who has never made a mistake has never tried anything new. It is not the mistakes we make that matter, but how we handle the situation. It seems as if you place high value on what people think of you, but donâ\u0080\u0099t let peoplesâ\u0080\u0099 opinion of you determine your reality. It seems as though you experience a bit of pressureâ\u0080¦ I am not sure if this is from your family or your own high standards. Give yourself a break â\u0080\u0093 there are a lot of good qualities in you â\u0080\u0093 you just need to open your eyes to them. One I can already tell you is that you are a very unselfish & thoughtful person â\u0080\u0093 your family must absolutely adore you for it!!","author":"friendlygoose","replyTo":"post1090830","postID":"post1116841","date":"20091104-00:00:00 -0500","authorID":"http://ehealthforum.com/health/user_profile_230735.html"},{"content":"LG...I came on here because i am bipolar and have been for over 35 years. Recently i had shock treatments and i am on medication that attemtps to stop the depression and mania but also numbs me to the point that i wonder why i am living, too. I know exactly how you feel... I tried to commit suicide twice when i was in my teens and ended up in a coma in icu for 3 days. My point being, i guess this life doesn't always make sense or even feel good or right...but you sharing today helped me not to feel so all alone. Because of your honesty,(which alot of people feel but won't ever say) you touched my heart. You eased my pain for a moment in time and i hope i can ease yours by saying, yes, it's a tough life and it hurts like hell sometimes...but if it didn't, we all wouldn't be on here sharing our deepest, most intimate thoughts...I don't have all the answers, but for some reason God spared my life and I would have to say that I have helped many people through the years with many deep trouble, when others could not have given them the time of day. I could relate because i went through it. You too, lg 20 are like Gold...precious as can be...because today, you touched my heart with the hurting truth, when no one else lately would even go there with me...thank you. And it will get better for both of us, for our gift in this crazy world is helping the wounded hearts...the ones on one want to hear...the ones that are shut out into the cold because they are very sensitive, kind caring beyond this worlds capacity to love them...because they are different. Jesus was different. I know you say you don't believe in God but if you want to relate to anyone's suffering it would be Jesus. Even though I believe in him, some days i still don't understand it all. Just keep helping the hurting by your honesty and you will realize that is part of (if not all of) your purpose in this world...my love and prayers go out to you...Jazzlind","author":"Jazzlind","replyTo":"post1090830","postID":"post1119831","date":"20091110-00:00:00 -0500","authorID":"http://ehealthforum.com/health/user_profile_232393.html"},{"content":"lostandalone85, if your initials are J.H., no matter what you think.... \"I STILL LOVE YOU\" and its not going to change. We all have our ups and downs, but I can't stop thinking about the what might have been, and honestly I don't know how much longer I can live a lie.","author":"livingalie84","replyTo":"post1090830","postID":"post1130272","date":"20091204-00:00:00 -0500","authorID":"http://ehealthforum.com/health/user_profile_238064.html"},{"content":"Yeah that is exactly me.","author":"no_one","replyTo":"post1090830","postID":"post1344084","date":"20110405-00:00:00 -0400","authorID":"http://ehealthforum.com/health/user_profile_356927.html"},{"content":"what is exactly u? the initials or description? if it's the initials, u know how to get a hold of me... the number has never changed.","author":"livingalie84","replyTo":"post1090830","postID":"post1354474","date":"20110421-00:00:00 -0400","authorID":"http://ehealthforum.com/health/user_profile_238064.html"},{"content":"Just like me! I feel the same way! The funny thing is, I have a wife I love dearly! But I have no friends. If my wife dies, I'd just not know what I'd do, but i'd be very close to taking my life with her in my life, imagine without her! I have no friends, and no family that cares for me! Until recently I had a few hobbies, but because of a change of situations I understood I no longer can continue these hobbies, and even if I did, I would not be happy. Watching my favorite movies of the past no longer inspire me. I'm like a source that has ran empty. I find no specific joy in going to work, quite often work is leaving me with 80% annoyance and stress, and only 20% happiness. The thing is, ALL the things I loved to do, I no longer love to do them! My hobbies, my movies, my music, my everything. I tried looking for (Yet another) hobby, but so far without success. I don't have the money to support the only hobby I'd like to do! My life is meaningless. There's nothing I can do, no one I can be a help for. And I wonder... I just wanted to be appreciated. You know, and the worst part of it all is people saying !**@! like 'You are special, you are precious\"; those words are meaningless to me! Can they give me comfort? They are but meaningless words like a vapor in the wind, not capable of bringing any form of substance in my life! I believe what I'm experiencing is what every great musician of the past experienced, and tried to compensate with drugs, women, and fame! Unfortunately the world is far from perfect, and there is no peace here! The only places of peace are in my dreams, but lately I've even stopped dreaming. Since I have no hopes, being in bed won't do me any good neither... A big emptyness something's missing inside! Something that nothing can fill that I know! Something that can only be filled by something great, something marvelous, something awesome, something beyond my expectations and dreams and hopes.... And I have no clue what that would be... Some say God, but there's nothing much I can do to make that work out! What I need is a family, friends, and hope!","author":"Falcon80","title":"depressed, no desire to live, no hope","replyTo":"post1090830","postID":"post1438737","date":"20111003-00:00:00 -0400","authorID":"http://ehealthforum.com/health/user_profile_418702.html"},{"content":"You know, once or twice I tried robbing myself of my own life; in a pinch, a really hard time. A time where I had to live a few weeks without money, and only had a bit of rice, and some powder coffee and sugar and powder milk to survive. I told myself this: \"I will go to the doctor, ask how much a lethal morphine injection costs (probably $100 to $150) and just inject myself, to leave this world without a trace, without anyone knowing, without bothering anyone.\" Thing was, I didn't even have that money, so I went to work, and saved money so I could do it. When things where bad again the next time, and I was crying in my own bed (think, I'm an adult man, not a female), I realized, that I could take my life at any time I wanted. But if I did that, I would never know what tomorrow would bring! If tomorrow was going to be worse, I could take my life tomorrow! I had the money ($50) to kill myself without pain or bruises, but if tomorrow was better, then it would be a shame to kill myself, and never see what's ahead of me! So I decided to stay. And thank God, because I married, had 2 cars, and a house now! But I am not 100% happy yet! There's still some things that need to be done! My life hasn't come to the point of total happiness yet! Once I define why I'm unhappy, I may find a way to relieve that, and become happy by addressing the issue!","author":"Falcon80","replyTo":"post1090830","postID":"post1438742","date":"20111003-00:00:00 -0400","authorID":"http://ehealthforum.com/health/user_profile_418702.html"},{"content":"life is tireee !! evrday is the same !! n u just gonna hav to live with it, rite now i feel vry insecure,afraid cuz my friends who is movin on, findin new friends, i too though about dyin, but u kant wat about my family, my mum who been wrkin non stop to feed me !! i feel soo scare of the change around me !! dat y no matter whever sumthin happn i just try to hide myself with the poker facee !! i was scare to get hurt !! afraid of reality,i hav no GOAL,ambition,no dream, but u cc i believe dat one day !!i dunno when just one day i will find it ! my reason fur livin, together with a person who i kan share my feelin with !! but rite now all i kan do is wait !! till time past through, killin myself is wat i've wished to do !! but it stupid soo i tried to stop thinkin about ^^","author":"sn0wang3l","title":"Follow the flow of lifee","replyTo":"post1090830","postID":"post1488005","date":"20120108-00:00:00 -0500","authorID":"http://ehealthforum.com/health/user_profile_454834.html"},{"content":"Each day I think and wish for my own death. I don't have the strength of mind or as some would say the weakness of mind to do it myself. I have responsibilities and things that make each day go by a little easier but it doesn't stop the thoughts. I know some would recommend medication or talking to someone but what about what the result maybe. I pray for my death each day like people pray for life. I go through the day with smiles and little happy words for others but it isn't my true thoughts. It is like a mask, and fake stupid machine. I wish for a corner and less feeling time, weightlessness. I remember writing my own obituary at 6 and making my mother cry and realized not to do that again.","author":"AndWhy","title":"feeling the same","replyTo":"post1090830","postID":"post1489929","date":"20120111-00:00:00 -0500","authorID":"http://ehealthforum.com/health/user_profile_456103.html"},{"content":"Whyu pepl r still alive. U have so many ways to suicide jst try one ov them ....bt i know u wil not do coz u dont have courage to do that...its easy to die but its very difficult t live a life wid no reason..still if u r alive it means still u have something may be u need to explore that.... If u dont have anything to do just spend ur time to explore that hidden reason for which u r still alive..","author":"daydreamer88","replyTo":"post1090830","postID":"post1570614","date":"20120529-00:00:00 -0400","authorID":"http://ehealthforum.com/health/user_profile_512376.html"},{"content":"I have been experiencing suicidal feelings for a very long time now. I have invested too much emotionally and financially in a relationship that has no future and it is time to end this stupid rut. Get busy living, or get busy dying.","author":"Msds","title":"Get busy living, or get busy dying","replyTo":"post1090830","postID":"post1579644","date":"20120616-00:00:00 -0400","authorID":"http://ehealthforum.com/health/user_profile_518469.html"},{"content":"I have wasted a lot of money in a bad marrital relationship. I have lost much .....","author":"yoyosiulaba","replyTo":"post1579644","postID":"post1863335","date":"20150702-00:00:00 -0400","authorID":"http://ehealthforum.com/health/user_profile_726805.html"},{"content":"Throw the job away, shut the phone off and get a extremely great sleep. The next day you wake up felt the life still hanging around just walk into the coffee shop with peace environment. Look around and judge them and give answer why and once you get through it u will understand everyone is walking in a same problem.","author":"Sandlest","replyTo":"post1090830","postID":"post1635449","date":"20121019-00:00:00 -0400","authorID":"http://ehealthforum.com/health/user_profile_557050.html"},{"content":"Throw the job away, shut the phone off and get a extremely great sleep. The next day you wake up felt the life still hanging around just walk into the coffee shop with peace environment. Look around and judge them and give answer why and once you get through it u will understand everyone is walking in a same problem.","author":"Sandlest","replyTo":"post1090830","postID":"post1635450","date":"20121019-00:00:00 -0400","authorID":"http://ehealthforum.com/health/user_profile_557050.html"},{"content":"I have been depressed for several years and like many people, namely the first poster who nailed my problems with perfect clarity, and I have learned that Life isn't worth living and we do not \"live\" we exist. Death would be a welcome release from pain and people need to remember that. I love Life, as it is in my head, but my Life is worthless and I hate it. I look at myself in the mirror and wanna end the existence of what stares back at me. There is no Hope for myself and once the rest of the world realizes this then we can all end this illusion of 'life'","author":"Kimura1972","replyTo":"post1090830","postID":"post1663864","date":"20121231-00:00:00 -0500","authorID":"http://ehealthforum.com/health/user_profile_578231.html"},{"content":"I'm about to graduate high school, and I don't like living with these feelings anymore. I have lived with body aches, migraines, and arthritis since i can remember. The migraines are getting worse, and I don't want to live with them anymore. Just recently i have started having anxiety attacks, expecially in crowded places. I'm socially awkward, i cant find words to say to my girlfriend, and i can feel myself slipping away. I wish that i would just vanish one day, welcomed by a blanket of cold darkness, i wish i would become nothing. If i cant live life without having to be drugged all the time, without pain, i don't want to live. I can understand why that woman took her life with that pill, instead of letting the cancer take her. I want to die. I tried to take a new perscription for the migraines, a perscription the doc didnt warn me of the side effects. Anxiety, confusion, memory problems, extreme irritability, i can't even remember them all. I've stopped taking it, but the anxiety attacks are still there. It was also an antidepresent. I want to die.","author":"Horridthoughts19","replyTo":"post1090830","postID":"post1844775","date":"20150216-00:00:00 -0500","authorID":"http://ehealthforum.com/health/user_profile_716273.html"},{"content":"Depression is so bad that any one can think about to end of life. There are so many treatment centers are available in offering services to prevent depression. People should contact them and find solution of their problem.","author":"edwardcejka","replyTo":"post1090830","postID":"post1845298","date":"20150220-00:00:00 -0500","authorID":"http://ehealthforum.com/health/user_profile_700761.html"},{"content":"To the OP, nice work man, well written. To the people saying to get help, I mean this politely, but please stop posting \"be positive.....get help......please talk to someone...\". You have no idea what is going on, you may think you do but you dont. I really mean that and I want any of you who read this to stop and think about the fact that you are not in any position to give advice, you have your experiences sure, but they are not the same, proven by the fact that you got through it. You are talking as though there are people out there, who are easy to find, accessible and actually have the ability to make a difference. These people are rare, expensive and/or at the very least incredibly hard to find. True depression, not the depression caused by the consequences of foolish choices (ie bipolar), but the realization that your life is meaningless despite your greatest and most sincere efforts and motifs does not need help. Think about that. What help is there that can be given to someone who honestly realizes that they simply have no place in this world. Does an honest realization of personal bankruptcy need correction? Does anyone really think for one moment that a truly depressed person has never given life a fair try? maybe even over and above what most people would consider truly remarkable if the same persistence was displayed by someone deemed successful? Perhaps in many cases this realization that our lives are futile is more honesty than depression. We at least cannot afford the luxury of illusion. We are not able to fool others and maybe even ourselves, in to believing we have a great life when an honest evaluation would clearly show that most peoples lives are a sham and a lie. Over many years I have learned the hard way that I do not belong here, that I simply have no place. I cannot hold a job, I cannot manage a relationship, I have nothing to offer anyone. I cannot relate to people, I am insensitive, I am a poor Father, I bring division and condemnation with me where ever I go and above all I know that I cannot change. To my shame, this, Ladies and Gentlemen, is what I am. I am destitute. Please dont bother with....\" But you have access to the internet which is a greater luxury than X% of the world etc\". Being thankful and being happy are not the same. Since when does luxury equate to personal worth and in turn happiness/contentment? Does that mean the more people I know and the more I have mean the happier I \"should\" be? And the line that people need you etc.....Am I supposed to suffer this lot to so as to avoid any ripples in the pond? What about others? Are they also Morally obliged to remain in a terrible situation so as not disrupt my happiness?? Would I want them to remain suffering? Would any of you want a family member to either : a) suffer out a wretched life to keep you happy. or b) get \"help\" (whatever that means) from a \"professional\" whos only claim to fame is a degree from a university and only motivation is a hefty paycheck. Based on experience, Id rather pass on both of those thanks. In an age of political correctness and mutual respect, this anti suicide thing is as backward as cultural intolerance. If a family member kills them self, it is my duty to respect their decision and it is their duty to respect mine should I make that choice. Before I go, I want to make sure that everyone understands that I am NOT saying \" Hey if things are tough. go end your life\". If someones reads that in, thats on their head not mine. What I am saying is that we are no longer living in the dark ages and big pharma is making a killing on people trying to fix what cannot be fixed. Is suicide the answer......NO Is sticking things out the answer.....NO Is getting help the answer ........NO Is there any answer.......I hope one day there will be.","author":"almost_human","title":"suicide vs futility","replyTo":"post1090830","postID":"post1861729","date":"20150623-00:00:00 -0400","authorID":"http://ehealthforum.com/health/user_profile_726096.html"},{"content":"I'm 62 years old and I've felt this way many times. My mother used to say, life is what you make it. I am in a lousy mood right now, so life stinks. I don't feel this way because I am alone, I am. Nor is it that I care how much I am missing, I'm not missing much. Nor is it because of what my family or other people think of me, given a choice, I wouldn't hang out with them anyway. I feel this way because I am dissatisfied with myself. The prescription for that is to find something that gives me satisfaction. It doesn't have to be anything big. Just something I've been putting off, plenty of things to choose from; something new I can learn, there's still a lot I don't know; something I wouldn't normally do, I put myself in a box too often by saying I don't want to or I can't. If I go for help, this is pretty much the advice I'll be paying for anyway. I am far from successful, I'm just living my life same as the rest of them and I don't care what school or life coaches say, not everyone will find their bliss. For me it's more like, I can't stand feeling like crap all the time so I try to find satisfaction in what's available to me which I assure you is not much. If no one else cares about you at least care for yourself. You're allowed to do that. It's what the one pointing the finger at you is doing.","author":"Josey59","replyTo":"post1090830","postID":"post1864446","date":"20150709-00:00:00 -0400","authorID":"http://ehealthforum.com/health/user_profile_524952.html"},{"content":"Maybe it's best if you talk to someone within your circle about it. No one understand you more and have your best interest at heart than the people around you. Count all your blessings and maybe that could help you get that feeling out of your head and maybe you could help others with the same thinking.","author":"ccas1220","replyTo":"post1090830","postID":"post1871173","date":"20150820-00:00:00 -0400","authorID":"http://ehealthforum.com/health/user_profile_730421.html"}],"URL":"http://ehealthforum.com/health/no-reason-to-live-t199795.html"}