{"title":"Lonely, sad and poor","thread":[{"content":"Iv been married for almost 13 years. I love my husband. He works a lot, and spends a lot of his free time \"out\". I only have one friend who doesn't have much time for me. I understand why. She has a daughter and she is doing the girl scout thing with her. She is now going to be a troop leader. And she just started working after being a stay at home mom for a long time. And to top it off my husband and I moved a good 10 hour drive away from where she lives and where we use to live. So we talk once a month or so. My family doesn't talk to me much at all. I'v tried. When I lived close to them, they never wanted to see me. I was never invited to go out with them when everyone was going out to lunch or dinner or just shopping. So when I moved I didn't think it was too odd that it took weeks for a returned phone call. Id call, no one would answer so I'd leave a message.","author":"Bunny80","postID":"post1862213","date":"20150627-00:00:00 -0400","authorID":"http://ehealthforum.com/health/user_profile_726375.html"},{"content":"It posted while I was typing ... Odd lol anyways, I just found a job after years of looking. I like my job enough, but it pays nothing. I couldn't even pay rent on my own. My husband makes just enough to cover the major bills. I ride a bike to work because I don't have a car. Im trying to make friends at work. But when I come home. I'm lonely. My daughter is a teenager and has her own life now. She keeps to herself mostly. We talk for a little while every day about her issues and social stuff. But she doesn't want to hang out with her mom. I cramp her style lol. My dog is my only real companion. I like walking her. But other than that, I am alone almost all the time. When my husband comes home, he is always on his iPhone. He only puts it down when he wants to have sex. That's all the interaction I get anymore. And honestly I don't want to. Even though I love him. I'm not happy at all in our relationship. I'v been telling him this for years. I'm just so lonely. I wanted to go to school and have a career, but I couldn't afford it. And I still can't. I want to move out and just support myself (and daughter). Be my own person, but like I said I can't even afford rent with what I make. Im out looking for a better job all the time, but I'm limited on how far my legs can carry me to work. And better paying jobs require schooling and skills I don't have. I'm only 34. I look very young for my age. I'm fit and not bad looking. I'm nice and friendly. I try to be outgoing. But I still don't have any friends. I don't ever do anything. I can't afford to do the things I'd like to do, and even if I could I don't have anyone to do them with. I go to work. I come home, walk my dog and go to sleep. On the weekends I clean. And try to go shopping for groceries. I haven't gone anywhere in a few weeks because my husband has been working long hours But for the past 6 days he has been gone. He hasn't gone to work and all I get is a story about how his car broke down in the mud on Sunday. I improvised my lunches for work this week because we didn't go shopping. He has my money from my paycheck. I don't get paid again until next week, and I'm broke. I can't even ride my bike to the store to buy food or anything because he has all the money and is MIA now for 6 days. I don't know what to do. The loneliness is killing me. I have no life, or anyone to share it with. No one wants to spend time with me. It's been this way for at least 10 years. When my daughter was younger, I just put everything into her. Now she doesn't want much to do with me. And now I'm just alone and heartbroken all the time","author":"Bunny80","replyTo":"post1862213","postID":"post1862216","date":"20150627-00:00:00 -0400","authorID":"http://ehealthforum.com/health/user_profile_726375.html"},{"content":"I am financially burdened to stay with my husband. I love him, but I'm so unhappy, I want to leave and change my life. I have no one to turn to. I never wanted my life to be like this. I dreamed of raising my daughter in a house, a yard to play in. A place to invite friends and family over for a cook out and all of that. My life is nowhere near what I wanted. I try so hard to achieve my goals, but I always fail. For years I was so optimistic about my future, that other people would make fun of me for it. Now the world has beat me down. I dont even know if I want hopes and dreams anymore. They hurt too much.","author":"Bunny80","replyTo":"post1862213","postID":"post1862217","date":"20150627-00:00:00 -0400","authorID":"http://ehealthforum.com/health/user_profile_726375.html"},{"content":"Sorry to bother people with my problems. I normally keep it to myself. But i haven't had someone to talk to for so long and the heartache and loneliness are not even letting me sleep tonight.","author":"Bunny80","replyTo":"post1862213","postID":"post1862218","date":"20150627-00:00:00 -0400","authorID":"http://ehealthforum.com/health/user_profile_726375.html"},{"content":"Its ok bunny..i am lobat but i know some have read n msybe ans.soon ok? Wil try to get back.","author":"samm00","replyTo":"post1862213","postID":"post1862275","date":"20150627-00:00:00 -0400","authorID":"http://ehealthforum.com/health/user_profile_707378.html"}],"URL":"http://ehealthforum.com/health/lonely-sad-and-poor-t455813.html"}