{"title":"Animal Cruelty","thread":[{"content":"Hi, I am a real animal lover, but recently I am getting so depressed over animal cruelty. I am crying at work and at home. I feel so helpless that there is nothing I can do for these poor creatures. The photo's I see of dogs in cages ready to be used for testing on or of what other human beings have done to them, it breaks my heart, how can people be so cruel!! It is effecting me so bad that I want to curl up in a corner and die. I really am suffering over this and I don't know what to do. I have 3 dogs and 5 cats and if I had the space for more I would take them all. Please help!","author":"Doglover3033","postID":"post1865726","date":"20150717-00:00:00 -0400","authorID":"http://ehealthforum.com/health/user_profile_727997.html"},{"content":"You have enough animals in your home to take care of. It is truly very sad what you see on TV. Visit your local shelter and check on them. Some things that they put on TV are the absolute worst things to get your attention. Most shelter are run very clean & fair to the animals........you could volunteer at one.","author":"mcilvaine","replyTo":"post1865726","postID":"post1865748","date":"20150717-00:00:00 -0400","authorID":"http://ehealthforum.com/health/user_profile_724875.html"},{"content":"I don't watch animal programmes on tv, I see it mainly on Facebook, so have now deactivated my account. I couldn't work at a shelter as I would get too upset and want to bring them all home, I don't think this pain will ever go away. I don't know anyone who is as passionate about animals as I am, so find it hard to talk to people as they just don't understand. Thanks for your reply though.","author":"Doglover3033","replyTo":"post1865748","postID":"post1866318","date":"20150721-00:00:00 -0400","authorID":"http://ehealthforum.com/health/user_profile_727997.html"},{"content":"I have just read a story about 2 garbage men who tortured a dog then dumped it ALIVE in a garbage truck and crushed it...................WHAT!!!!????? How the hell can you see this and not read it, although I didn't read it all, so not sure if they were caught. Someone filmed the whole thing, which is why it's come out for the public to see.I am totally distraught over this. I am on anti-depressent medication, but it doesn't seem to work, I have tried so many different one's. I am not a crack pot or have mental issues. I am a normal person who goes out to work, but devote my life to my animals and giving them the best life I can.","author":"Doglover3033","replyTo":"post1866318","postID":"post1867504","date":"20150728-00:00:00 -0400","authorID":"http://ehealthforum.com/health/user_profile_727997.html"},{"content":"Omg!! I so understand! I've always been a tender hearted animal lover, but recently, my sensitivity in general is so much more heightened as I get older. I have become frustrated with stories shared on fb as well, bc they upset me so much that I just want to find these sick people and beat the crap out of them. I found that connecting with a volunteer at a rescue and rehab organization that helps injured animals has brought so much joy and meaning to my life and big heart for animals. I may not be able to help every animal, but knowing I'm helping some makes me feel useful and like I'm making a difference.","author":"AmRL","replyTo":"post1865726","postID":"post1867550","date":"20150728-00:00:00 -0400","authorID":"http://ehealthforum.com/health/user_profile_728874.html"},{"content":"I am also the same, I have found since getting older that my love for animals outweigh's my love for mankind. Humans are cruel & greedy and it's getting worse. I have lost one of my cats since initially writing this, he was put to sleep last Friday and I was devasted, still am. He was my family and I miss him dreadfully, but it just makes me love the others even more now and all I want to do is be with them. I look after my sick mum plus I work and look after my 3 dogs and 4 cats and my 20 years old daughter, so I do not have time to help out at a animal organisation, it would break my heart to see animals injured, I just couldn't do it, plus I would be bringing them all home and I can't afford to. I keep praying that one day I may win some money, so I could donate loads of money into helping animals, one day maybe. If we could get rid of all the evil in this world then I would be happy.","author":"Doglover3033","replyTo":"post1867550","postID":"post1867658","date":"20150729-00:00:00 -0400","authorID":"http://ehealthforum.com/health/user_profile_727997.html"}],"URL":"http://ehealthforum.com/health/animal-cruelty-t456916.html"}