{"title":"Depression, Neuropathy, ADHD far from able to work","thread":[{"content":"Hello, I'm tired of fighting just so people can acknowledge the pain I'm going through. I'm nowhere near a treatment, so I thought I should ask you guys for advice, and maybe a proper diagnosis. I've been injured a lot through sports as a child due to my tendency to lose track of what's happening around me (mainly focusing on the goal of the sport). I've never completed physiotherapy because I was too anxious to get back out there, thus making my injuries worse. Throughout high school I've had complex migraines, the symptoms always appearing in the same order: loss of depth perception, seeing stars, losing half my vision in the right eye, numbness in right arm, numbness in right side of the face, and finally a massive migraine. I would get those once every two months and I'd be incapacitated for the day. My brother (who's never been diagnosed) also experienced the same migraines with the same symptoms. I went through blood tests, cat scans, and specialists but none of them gave me answers. As I had to start working in high school, my physical and mental conditions eventually got worse. I felt incredibly frustrated because of the pain, but also because I couldn't tolerate the lack of effort and insight my coworkers were content with. When I couldn't tolerate it anymore I would go to my doctor, who would always administer the same tests (I've had xrays for every joint in my body!), which would show nothing, of course. I'd get a dose of random medication which would not work. Eventually while I was in university I got diagnosed with ADHD- Inatentive Type. The diagnosis made sense to me, but it did nothing to help me with the now intolerable physical and emotional pain I was going through. I still had to work to pay for my studies, and my symptoms got worse. I started experiencing short blackouts, where I was conscious but all my senses shut down. Afterwards all my muscles would convulse for a few seconds, which would leave me weak, dizzy, and incapable of working. Sometimes I would get so dizzy I'd end up vomiting before passing out from exhaustion. I eventually quit university and have since then relied on family for my subsistence, but they are getting impatient with me. I've used this time to focus on undoing all the tension in my body, and I've had some success. In the process I've been able to stabilize my mood and the \"episodes\" have decreased from a few each week to once every three-four months. I feel a lot less physical pain, and I even feel happiness now and then. But while these achievements mean the world to me, they mean nothing to everyone else. I'm still far from able to work, and I'm not sure how long my family will support me. I don't know how I'll pay for rent, food, and I'm seriously on edge since I can't pay for the ganja. Doctors do not want to give me a diagnosis for fear of being wrong, so here I am. Do you have any advice-big or small- to give me?","author":"Inane","postID":"post1868409","date":"20150801-00:00:00 -0400","authorID":"http://ehealthforum.com/health/user_profile_729149.html"}],"URL":"http://ehealthforum.com/health/depression-neuropathy-adhd-far-from-able-to-work-t457706.html"}