{"title":"Withdrawal symptoms of cipralex (Page 1)","thread":[{"content":"I have been on 20mg of Cipralex for almost two years now and my doctor and I decided that I should start on Wellbutrin instead as I felt that the cipralex wasn't having the good effects that it used to. I am now on 300mg of Wellbutrin XL a day and was supposed to gradually reduce lmy cipralex dosage over a period of time to the point that I no longer needed it. Unfortunately, all these drugs cost money and I can't afford to take both. I stopped taking Cipralex cold turkey about 2 weeks ago and the past two days have been nothing short of hell for me. My tounge is constantly tingling, if I move my head to quickly I get these weird almost electric sound in my head (always three zap sounds each time), I am dizzy, not hungry, constantly tired, body feels as though it does not belong to me (lots of mumbling, clumsiness) and have been having very intense dreams where I wake up sweating so bad that my sheets are soaked. I guess my question is: It has already been 2 weeks and symptoms are becoming worse. How much longer do I have to suffer these withdrawal symptoms???","author":"Lamb01","postID":"post1520913","date":"20120304-00:00:00 -0500","authorID":"http://ehealthforum.com/health/user_profile_478350.html"},{"content":"These are the listed withdrawal symptoms of Cipralex : .aggression, anxiety, balance issues , blurred vision, brain zaps, concentration impairment, constipation, crying spells, depersonalization, diarrhea, dizziness. electric shock sensations, fatigue, flatulence, flu-like symptoms, hallucinations, hostility, highly emotional, indigestion, irritability, impaired speech, insomnia, jumpy nerves, lack of coordination, lethargy, migraine headaches / increased headaches, nausea, nervousness, over-reacting to situations, paranoia, repetitive thoughts or songs, sensory & sleep disturbances, severe internal restlessness (akathasia), stomach cramps, tremors, tinnitus (ear ringing or buzzing), tingling sensations, troubling thoughts, visual hallucinations / illusions, vivid dreams, speech visual changes, worsened depression. So, quite a bit and explains why there is a need to taper off this drug. COst is one thing but taking risks is another. Best thing is to talk to your doctor and ask what to do now. If it's like most drugs it may take several weeks of pain before it settles down. Unavoidable since you've already done it. So sorry you are going through this stuff.","author":"Oneofus","replyTo":"post1520913","postID":"post1520968","date":"20120304-00:00:00 -0500","authorID":"http://ehealthforum.com/health/user_profile_455608.html"},{"content":"I have been on Cipralex for a year and a half. I feel this drug as ruined my life. 2 years ago I went to the eye doctor and had 20/20 vision...I now have to wear glasses. One eye has double vision and is totally near sighted and the other eye is the total opposite of far sited. 6 months ago I had to episodes of like a electric shock feeling in my head...very scarey while driving. My doctor sent me for every possible test you could think of and everything came back normal. I feel worse than I did before I started taking this drug...Has anyone else had this. I am starting to ween myself off and am a little nervous with all the things I have read on the withdrawal symptoms","author":"TaraHaley","replyTo":"post1520968","postID":"post1775892","date":"20131219-00:00:00 -0500","authorID":"http://ehealthforum.com/health/user_profile_669686.html"},{"content":"Hey I'm a 19 year old girl, I've been on cipralex since January and recently went off it unwillingly because i was unable to pay for the medication. I experience frequent shocks, crying spells etc etc I don't know what to do and my parents and doctor will be upset if I tell them. I am very scared. Thank you for confirming these side effects","author":"Alexa16","replyTo":"post1520968","postID":"post1796497","date":"20140326-00:00:00 -0400","authorID":"http://ehealthforum.com/health/user_profile_686074.html"},{"content":"Hey I'm a 19 year old girl, I've been on cipralex since January and recently went off it unwillingly because i was unable to pay for the medication. I experience frequent shocks, crying spells etc etc I don't know what to do and my parents and doctor will be upset if I tell them. I am very scared. Thank you for confirming these side effects","author":"Alexa16","replyTo":"post1520968","postID":"post1796498","date":"20140326-00:00:00 -0400","authorID":"http://ehealthforum.com/health/user_profile_686074.html"},{"content":"I seem to have suffered at some point with almost all of those withdrawal symptoms that you posted. Glad I'm not going crazy here!!! I knew that there would probably be some side effects from just stopping after being on it for so long, I just didn't realize the severity of it. Thank you so much for responding. That in itself calms and relieves me a bit.","author":"Lamb01","replyTo":"post1520913","postID":"post1520976","date":"20120304-00:00:00 -0500","authorID":"http://ehealthforum.com/health/user_profile_478350.html"},{"content":"heyy how do you feel now after stopping this dose ??? i have also stopped 3 days ago please reply its urgent","author":"Ahsaan","replyTo":"post1520976","postID":"post1858228","date":"20150528-00:00:00 -0400","authorID":"http://ehealthforum.com/health/user_profile_724174.html"},{"content":"I'm glad a reply helped. When depressed always remember Google is your best friend. WHat a horrible thought, feeling most of those things. So sorry you had to find out the hard way. Remember too that docs don't say taper unless there's a problem. Still, a lesson learned huh? Hope it stops soon.","author":"Oneofus","replyTo":"post1520913","postID":"post1520988","date":"20120304-00:00:00 -0500","authorID":"http://ehealthforum.com/health/user_profile_455608.html"},{"content":"Lesson learned for sure. I did do some research and somehow got to this website. Very informative. Thank you for the kind encouragement. It helped me through this day","author":"Lamb01","replyTo":"post1520913","postID":"post1520991","date":"20120304-00:00:00 -0500","authorID":"http://ehealthforum.com/health/user_profile_478350.html"},{"content":"OMG I seem to experiencing most of the symptoms listed above - the sleep disturbances, sweating and dizziness being the worst of them. The dreams are weird like a different colour to usual and I keep dreaming of green and food cans - weird. The symptoms are at the worse in the morning hours until about 2pm and then I start feeling a little better for it all to repeat again after midnight. It has been going on for 5 days now and wondering when it will all just go away. I didn't have any of these problems when starting the medication!","author":"Zappy","replyTo":"post1520913","postID":"post1542091","date":"20120409-00:00:00 -0400","authorID":"http://ehealthforum.com/health/user_profile_493019.html"},{"content":"Does anyone know how long these symptoms will last ? I am in week 3 of being off the Cipralex , and the past one and this one is the worst ! Dizziness , lightheadedness , fatigue and just not sleeping are the worst for me . Also a faster hearbeat and palpitations. It is to a point where it is really concerning. I am wondering how long these symptoms are going to continue for ??? Any help would be appreciated. Thanks.","author":"lostra3","title":"Symptoms from coming off Cipralex.","replyTo":"post1520913","postID":"post1651150","date":"20121127-00:00:00 -0500","authorID":"http://ehealthforum.com/health/user_profile_568530.html"},{"content":"I had forgotten all about this thread until I got an email saying someone replied. It seems like forever ago that I was going through all of this. I'm trying to remember how long my withdrawal symptoms lasted and I think it was around 3-4 possibly even 5 weeks. I know it got a lot worse before it got better. Hang in there if you've gone 3 weeks I would think your almost at the end of the agony. If symptoms continue to stay quite steady and strong maybe a quick trip to the doctors is needed. It's so hard on your body both mentally and physically, so you need to be eating healthy and trying to get some exercise. Good luck to you and I hope you start to feel more human soon Take care","author":"Lamb01","replyTo":"post1651150","postID":"post1651279","date":"20121127-00:00:00 -0500","authorID":"http://ehealthforum.com/health/user_profile_478350.html"},{"content":"Thank you very much for your reply ... kinda lousy to know it carries on for a while , but at the same time , I know it's \"normal\" for the situation . I hope I feel more human soon too . Thank you so much.","author":"lostra3","title":"Reply to Lambo","replyTo":"post1651279","postID":"post1651292","date":"20121127-00:00:00 -0500","authorID":"http://ehealthforum.com/health/user_profile_568530.html"},{"content":"I have been on 30mg Cipralex for years now and went off cold turkey a week ago after a switch to Prozac was worse. I feel it is the cipralex is to blame for my dizziness, nausea, heart palpitations and brain zaps. I too am concerned about my heart rhythms and wonder whether I should go back on the meds even though emotionally I am feeling more alive and connected to the world again. What should I do?????","author":"phoenixmom","replyTo":"post1651150","postID":"post1771000","date":"20131124-00:00:00 -0500","authorID":"http://ehealthforum.com/health/user_profile_665898.html"},{"content":"Hi, I found this forum while searching for information about how long these awful zaps throughout my body are going to last. I don't seem to have many of the other symptoms, but the zaps are so strong. I think I am in about week three now. I was on Cipramil (assuming this is the same as Cipralex but not sure) for six years. First 20 mg and then down to 10, back up to 20 last year and then 10, then less, then none as of three weeks ago. I stopped from there pretty abruptly but I wouldn't say cold turkey. I am in shock (pardon the pun) at how strong the shocks are. I'd started getting used to them but tonight, I wonder, is this normal? They seem to get worse in the evening. Sometimes I even wonder if my insides are convulsing or something! If an end is in sight I think I'll be all right, but, otherwise am wondering how long I can put up with this. Would be grateful to hear if anyone can relate and of their experiences.Thank you.","author":"JanePenny70","title":"Horrible zaps","replyTo":"post1520913","postID":"post1667818","date":"20130111-00:00:00 -0500","authorID":"http://ehealthforum.com/health/user_profile_581698.html"},{"content":"I've been off cipralex for a week now, and Im just starting to feel the shocks/tingling in my jaw. have you or anybody else experienced this?","author":"bread1","title":"cipralex","replyTo":"post1667818","postID":"post1670187","date":"20130118-00:00:00 -0500","authorID":"http://ehealthforum.com/health/user_profile_583567.html"},{"content":"I just started weaning off of 20mg, on for 2 1/2 yrs, of cipralex to 10mg 3 days ago and the symptoms are scaring me. I'm super confused, dizzy, extremely tired but can't sleep, headache and the zaps. i dont feel like myself and feel alone. my hubby is very understanding but hes never been through this so doesnt truely understand how scarey it can be. I start cymbalta in 2 days but only on 30mgs for a week then up to 60mg. It's good to know I am not alone in this but I still don't know how to deal with it. Ugh, this is the tough part of struggling with major depressive disorder and anxiety and transitioning to a new med.","author":"alone76","replyTo":"post1520913","postID":"post1675448","date":"20130202-00:00:00 -0500","authorID":"http://ehealthforum.com/health/user_profile_588213.html"},{"content":"Thankfully I only started taking Cipralex a month or so ago, and I was still on 10mg and had not been upped to 20mg. I knew and still currently know very little about depression and since I ran out, I thought I'd just cut off about a week ago and just wait until my next doctor's appointment to get more. Having never really taken any sort of serious prescription drug before, I had no idea how stupid that was. I've experienced a great deal of the listed symptoms and can say I was truly frightened and had no idea what was going on with my body. I don't want to know how much worse it would have been had I been on 20mg. Thankfully my mom and fiance are there for me and we managed to get me another two weeks until I can see my doctor again. I will definitely be more responsible with taking my pills consistently and on time. Thanks to all the wonderful people who posted on this thread, the information was very useful and it's nice to know I'm not alone. To be honest, I was entirely ashamed of my depression until I saw how many other people are suffering just like me. Or worse, in many cases. Again, thank you so much, and I wish everyone the best of luck with their respective mental challenges.","author":"Shayzy","replyTo":"post1520913","postID":"post1681674","date":"20130223-00:00:00 -0500","authorID":"http://ehealthforum.com/health/user_profile_593928.html"},{"content":"I'm glad that you have the support of your family. Depression is actually quite common, but it's almost as of people are embarrassed to even admit to it. But it is what it is and you can either chose to deal with it or suffer. It's been almost a year since I started this thread. And to be honest I never want to have to go through those withdrawal symptoms again. What a horrible and helpless feeling that was. But life is good right now. And I hope that you all are happy and healthy.","author":"Lamb01","replyTo":"post1520913","postID":"post1681740","date":"20130223-00:00:00 -0500","authorID":"http://ehealthforum.com/health/user_profile_478350.html"},{"content":"I'm still on Cipralex 20mg, 2 years. I want to get on with life; it's making me so lethargic but I still have days when I am tearful - chicken and egg am I tearful because I can't do anything (sleeping a lot - lazy) or because there are still elements of depression. Thing is I'm worried about these Zaps people are talking about as I'am also being treated for epilepsy. Something has to change - I'm getting really frustrated.","author":"Dhplt","replyTo":"post1520913","postID":"post1681816","date":"20130224-00:00:00 -0500","authorID":"http://ehealthforum.com/health/user_profile_594062.html"},{"content":"Gosh, you sound like me 6 months ago - I totally understand how you feel!!! Just to give you my background I was diagnosed with clinical depression in August 2011. It was triggered by months and months of extreme anxiety, sleeplessness and stress from starting my own business and believing I had to succeed at all costs. I had been seeing a psychologist for more than a year prior to my breakdown, in anticipation that the business would bring me a great deal of stress. NO idea it would get as bad as it did though and I finally made the choice to see a psychiatrist when I realised that although my behaviour had contributed to my breakdown, understanding those mistakes and learning from them alone wasn't going to get me out of the mess. My psychiatrist immediately put me on Cipralex plus anti anxiety meds and some sleeping pills to give me a chance to rest. Within a month the feelings of despair, helplessness, intense anxiety and pure lack of resources and ability to deal with the pressures in my life were, for the most part, gone. It was such a huge relief! But then the recommended minimum 18 months of ongoing medication started. I didn't want to be on medication, nobody wants to be on medication - not only is there stigma, but it's expensive and you're putting chemicals into your body. But I wanted to get better, be better and most importantly try stay better so I'd resigned myself to the reality that I had to stick to the plan, regardless of the how quickly I'd started feeling better and deferred to my psychiatrist on all counts. But oh my, the gradual lethargy that pretty much took over my life completely blindsided me. I started a relationship about 8 months into my treatment and the poor guy was convinced that he was dating a sloth! I thought I had lost the plot because I was at the point where I could easily sleep 14, 15 hours if left, and be able to do that easily 2 nights in a row (work commitments during the week prevented me from ever actually seeing how many nights in a row I could go for!) Inevitably the feelings of self loathing and the judgment started. And I started wondering had I always been like this? Or was I just more aware of it? Plus I was scared of the implications for my relationship. I felt lazy and useless and SO bored, despite not feeling depressed! Which totally bummed me out, which made me wonder if that meant I was still depressed and needed to stay on the medication?! Exactly the chicken and egg you're describing above! All I can say is thank the universe for my psychologist. I think our history prior to the depression helped, because she had a reference point for \"undepressed\" me. She kept pushing that the lethargy and \"laziness\" which I was so ashamed of, was a physical response, and not a psychological symptom. Unfortunately, it took me a while to start listening to her and believing her, because my 3-monthly check ups with my psychiatrist left me feeling like I still needed medication, subsequent dose increases, yet such disappointment and frustration as he didn't really seem to understand the negative effects the lethargy was having on me. I made the mistake of completely deferring to his medical judgment that the lethargy wasn't a big deal, because after all, he is the doctor and I had to trust that he knew what he was doing. Otherwise what was the point of any of it. And so it carried on. My psychologist eventually had a very candid conversation with me explaining that I had to trust myself, trust that I'm not a lethargic individual prone to sleeping away my weekends at the cost of not being active, not having fun in my relationship and not seeing my friends, and that I actually had a responsibility to voice my feelings about the medication more loudly and not just passively be \"steam rolled\" by my psychiatrist's treatment plan. My need to stop my medication and, as you say, get on with my life just became stronger and stronger and eventually I had the confidence to speak to my psychiatrist about all of it and the need to move on. It was a fantastically positive conversation. He was great. And it highlighted how I should have been more assertive in our sessions sooner, instead of just arriving to be treated, only to leave feeling more upset. But to be fair, that assertiveness only came with the confidence that I would be OK off meds and that it was time to try. We came up with a plan, because, as it's clear on this forum, the side effects if you go cold turkey can be absolutely horrific. So started the plan to taper me down from 20mg to 0. In January I was on 20mg and last week Monday I took my last 5mg dose. Just tapering my meds from 20mg down to 15mg, down to 10mg had a noticable difference within 2-4 weeks. I was shocked at what a difference I felt. I WANTED to get up in the mornings. My days were longer and enjoyable and it was such a small indication that I had made the right choice and that I could do this. And it only got better from there. It's only been 10 days of no Cipralex and I think I'm experiencing some final withdrawal - I'm having extreme moments of frustration and the inability to let go of things that bother me, which then inevitably result in some tears because on reflection I can see how ridiculous I'm being. My poor boyfriend. But I'm awake! And getting on with it! And it's great. The confidence alone, from taking the next step is a huge boost. I think it will take me a while to find my balance. So I expect the frustration and the random outbursts of annoyance and tears will be here for a while. But they're not in my character, so I trust they will eventually fade. Fingers crossed. And if not, well then I'll have to find a way to deal with them. *sigh* I haven't had any zaps that other people on the forum have described. Touch wood. There were some headaches and some sleeplessness. But nothing else that I've noticed. All I can offer you is my experience and my deepest empathy for what you're feeling, because I was THERE. Instead of judging yourself, remember why you started the medication in the first place, give it the recognition and respect it deserves but also acknowledge and understand it's limitations. When you break your leg, you put it in a cast. The cast serves a purpose, but you weren't born with it and wearing it for too long, especially once your leg's healed comes with it's own problems. Especially if you start believing you'll never be able to walk without it... Well that's what I think","author":"Meemee37","replyTo":"post1681816","postID":"post1694088","date":"20130404-00:00:00 -0400","authorID":"http://ehealthforum.com/health/user_profile_605650.html"},{"content":"I think I made every mistake I possibly could have regarding coming off Cipralex. I've been on Cipralex for at least 2 yrs now, and felt that I was stable enough to come off. I didn't discuss it with my doctor, because I really don't think he knows any more about the drug than I do (maybe I'm wrong here too?). I decided to go from 20mg to 10 mg, which I did, for a little over 2 weeks. I tried to cut the pill in half again (to make a 5 mg) but it was too difficult without a pill cutter, so I just stopped altogether. That was about 2 or 3 weeks ago (I don't actually know when I stopped). I thought that was that. Then I started having crazy, vivid dreams, became sooo irritable and had no frustration tolerance. I feel lightheaded, have heart palpatations, cry at the drop of a hat, feel like ripping heads off anyone who comes too close, have these zappy shocks (thankfully mild), headaches, you name it - the list of withdrawl effects describes me to a tee. I felt such relief just now reading others' experiences because I thought I was losing my mind. I wish I had googled this BEFORE I stopped the damn drug. Now I'm not sure what to do, but may talk to the pharmacist where I work for advice on managing the withdrawl (i.e. do I suck it up for the next several weeks or do I take a reduced dose of the medication for a longer period of time) I have an appointment to see my GP and I will talk to him about this. What I was really afraid of was that the depression was back. Reading this has reassured me that that is not necessarily the case. I really want to experience life off antidepressants.","author":"jfk2013","replyTo":"post1694088","postID":"post1714443","date":"20130602-00:00:00 -0400","authorID":"http://ehealthforum.com/health/user_profile_621981.html"},{"content":"Thank you so much for taking the time to write this. I'm so glad you hear that you're doing so well and are ok off of the medication. I hope it continues to improve!","author":"Lizeroo","replyTo":"post1694088","postID":"post1767537","date":"20131106-00:00:00 -0500","authorID":"http://ehealthforum.com/health/user_profile_662987.html"},{"content":"I've been on Cipralex 20mg for a year, I would experience nausea, headaches and mood swings on any missed dose but a couple weeks ago was forgetting so often and feeling alright that I was stupid and figured maybe my body was able to handle going off it now. My withdrawal is getting intense. I know I should probably still be on Cipralex, but will starting my regular dosage again make the symptoms even worse? Will that just confuse my body more? Or will I start to feel better? My doctor is eight hours away, so an appointment is kind of impossible at the moment.","author":"b4ande","replyTo":"post1520913","postID":"post1690595","date":"20130324-00:00:00 -0400","authorID":"http://ehealthforum.com/health/user_profile_602141.html"},{"content":"Call your pharmacist for advice. They know more about drugs than your Dr. does.","author":"M0ntag00","replyTo":"post1690595","postID":"post1780823","date":"20140113-00:00:00 -0500","authorID":"http://ehealthforum.com/health/user_profile_673518.html"},{"content":"I am just about to come off Cipralex. I have tried more that 3 times in the past! It is soo hard! But here I go. Today I am at 5 mg of cip. I have been taking 10 every day for 2 months. I am going to take 8 days of 5 mg of cip, then I am going to 2.5 for 14-20 days. then zero. I have noooooooo idea howwwww anyone could stop cold turkey without dying. omg. You people must have been through hell. I'm so sorry for that. This is my final try. Support me if you can pleaasee","author":"2013Pass","title":"DAY 1","replyTo":"post1520913","postID":"post1696132","date":"20130411-00:00:00 -0400","authorID":"http://ehealthforum.com/health/user_profile_607457.html"},{"content":"good luck to you and remember you are not alone","author":"jfk2013","replyTo":"post1520913","postID":"post1714433","date":"20130602-00:00:00 -0400","authorID":"http://ehealthforum.com/health/user_profile_621981.html"},{"content":"Sorry for stealing your thread ( And if this isn't how you do this - I'm new ) but I was just wondering if anyone knows whether alcohol can increase withdrawal symptoms? Been on 10mg cipralex for nearly three months and was having quite bad side effects as well as them not really helping me with my anxiety, and decided to quit. I know you're meant to step down gradually but due to circumstances where I was unable to take them for 2 days, I just decided to quit full stop. It's only been just under a week, but I am definately feeling the withdrawal symptoms. Electrical shock sensations,dizziness as well as increased depression. Last night I went out for a few drinks, and all I remember was throwing up in the toilets for half an hour, but not being able to stand up to leave. I've never had an experience like that before, even with larger amounts of alcohol, and I always manage to stand on my own feet. I managed to stagger myself into a taxi eventually, but even today I feel horrendous, and my anxiety and depression is a lot worse. Could this be due to going cold turkey so quickly or should I suspect someone slipped something in my drink?","author":"norumsen","replyTo":"post1520913","postID":"post1715639","date":"20130605-00:00:00 -0400","authorID":"http://ehealthforum.com/health/user_profile_622976.html"},{"content":"Hello, just wondering if the Wellbutrin was working for u? Was it for depressiion or anxiety?","author":"nelly2010","replyTo":"post1520913","postID":"post1723611","date":"20130623-00:00:00 -0400","authorID":"http://ehealthforum.com/health/user_profile_628366.html"},{"content":"Thk you to everyone posting (s.times long) accounts - very helpful. On day 4 quitting 5 mg Cipralex for 5 months. Mainly feeling the dizziness when moving my head at times - was afraid I had screwed sthg up in my neck doing yoga before reading these posts. On the more psychological withdrawal (i.e. anger - flipping out etc.) starting to feel these. I just would like my own experience with a softer approach to mood management i.e. Mindfulness Meditation. Tried that 3 years ago before resorting to meds for depression - it is call Mindfulness Cognitive Behaviour Therarpy (or MBCT). I feel the mindfulness practice (3 years off and on) is really helping with the withdrawal symptoms (as well as it helps with the onset symptoms of emotional roller coaster). Why? well simply because all the mindfulness practice does is teach oneself to observe one's thoughts or emotions - and simply get that millisecond of perspective to go \"Oh yeah, I am going at it again. I am.... [fill the blank: upset - sad - angry - etc.] Lots of online guided meditations (i.e. recordings) for whoever is interested - but also lots of \"crap\" out there (i.e. the Meta meditation or \"feel good\" types of visualizations - which is not what Mindfulness is really about. Another \"google\" keyword could be one of the US Psychologist who brought the mindfulness more mainstream in a hospital setting (in Boston, MA): John Kabat Zinn . I even found at my local public library some of his CDs with guided meditations - you can load the MP3s on a smart phone or Ipod or other play and practice anytime any where. Not to say this is a magic bullet - but it does help - basically to pick-up on the downward negative spiral - vicious circle of thoughts - and simply become aware of that spiralling of neg. thoughts (i.e. becoming mindful vs. on autopilot). I also understand it as \"rewiring\" the neural connections in our brain i.e. the associations of ideas and emotions we may have (auto-pilot) by first identifying them and as soon one thought pattern gets in the foreground vs. auto-pilot background, it is a start to lessenning the strenght of that neural connection (like taking a footpath, every day meaning to grass can grow, like sleep walking on it - then one day one goes - hmmmm I am walking on this path. Then we simple wwalk awake on it vs. sleep walking (i.e. autopilot). Eventually we might be awake and look around and see the bushes tnext to that path, maybe a wide patch of grass on the side we never noticed. Eventually one might simply wonder and walk into the taller grasses and maybe start cutting a new path.) Hopefully this imagery does not sound too \"new agy\" - it has helped me over the last 3 years to pick up on some of my thoughts patterns - now you'll argue (rightly) - I still went on Cipralex 5 months ago.... Indeed (I am self-employed - my biz. not moving forward as fast as I'd like - and I live in Canada so long winters which are making my mood condition worsen - while summertime it feels better - so I thought I'd try the Meds. see if my biz. + energy would get better - mood has been more stable in Cipra but energy not ideal - and just on 5 mg. So talked to my doctor and expressed the desire to get off it. She said \" A lot my patients want to get off it during summer.\" but you are on a baby dose so it is up to you she added. Also - I had stopped exercizing (due to a shoulder repetitive strain partly due to bad computer ergnomics - and I am typing right now... !!) Shoulder feeling better and planning to exercize again. My Doctor replied: \"If you can exercize more, this is a good anti-depressant.\" So here is my little 10 cents worth of exploring within and outside the Meds. to stabilize my mood (mainly depression.) We in the middle of summer... Ask me again when november comes around again But thx for sharing experience with side effects of getting off Cipra. I am going to go for massage or shiatsu - also more yoga and more cycling and swimming. At least now I know my dizziness not due to a neck issue - nerve or spinal problem","author":"AltExploring","title":"Quitting 5 mg Cipralex with Mindfulness practice + Exercize","replyTo":"post1520913","postID":"post1740506","date":"20130802-00:00:00 -0400","authorID":"http://ehealthforum.com/health/user_profile_642019.html"},{"content":"I have been taking cipralex 10 mg for a year now , and i'm off for Two weaks , i feel dizzy , nausea , diahrrea , anxious I dont know for how ling these symptons will go on","author":"girly80","replyTo":"post1520913","postID":"post1748256","date":"20130826-00:00:00 -0400","authorID":"http://ehealthforum.com/health/user_profile_648592.html"},{"content":"I am experiencing all of the above symptoms. I am terrified of the depression returning. It was a very dark place to be. I put a call into my psychiatrist today, because I now am having crying spells along with the nausea, irritablity, trouble focusing at work, dizziness, tiredness, headaches, anxiety and those \"electric shock\" feelings. All these symptoms were present with my depression and this is soooooo scary. Can someone please tell me how long this last?","author":"Jessie1966","title":"Cipralex","replyTo":"post1520913","postID":"post1748272","date":"20130826-00:00:00 -0400","authorID":"http://ehealthforum.com/health/user_profile_648610.html"},{"content":"I feel that I never should have been put on this drug that is proving difficult to get off of without the debilitating withdrawal symptoms that everyone is describing, especially the brain zaps and the depressed physical state (I find the dreams fascinating). However, this three part series is really worth listening to. I clearly went through a burnout and a following depression but I wish that I would have faced the dark days myself without this drug. http://www.cbc.ca/ideas/episodes/2013/03/0 7/rethinking-depression-part-1/","author":"guest69928","title":"withdrawal symptoms cipralex","replyTo":"post1520913","postID":"post1750872","date":"20130903-00:00:00 -0400","authorID":"http://ehealthforum.com/health/user_profile_650612.html"},{"content":"Hey Axonman, I feel the same way, I wish I never started. I am on Day 5 of being Cipralex free and the brain zaps are starting but this feeling is nothing compared to what I went through when I started taking Cipralex 6 months ago. It was my first and last anti-depressant pill and I will never go back. I understand some people need something to help them through the dark days and their depression is debilitating as mine started to be... but what this pill does is not how i want to live for the rest of my life. Any drug that gives you these kind of symptoms should not be taken lightly. I am not looking forward what the next couple of weeks will be like but looking forward to be drug free and try homeopathic options next.","author":"Tryingtobedrugfree","replyTo":"post1750872","postID":"post1753131","date":"20130911-00:00:00 -0400","authorID":"http://ehealthforum.com/health/user_profile_652455.html"},{"content":"I don't know if this will help you but I can tell you what happened to me. After being on anti-depressants for 4 years, Cipralex was the last one I was on and at a high dose. I was about to be switched to Effexor which scared me. I was also on a high dose of Ativan. I was losing my mind. I went cold turkey off all the medication. My husband suggested I try, since it had been 4 years. I asked my doctor and he looked at my husband and said something like \"good luck with the next couple weeks.\" It was hell. I slept a lot. Had vivid dreams, waking up in a pool of sweat. Extreme dizziness/vertigo. Nausea. Jackhammers in my head. Could not control my tears. I felt like a baby. I was an adult and had people babysitting me. It was irritating that a stupid little pill could technically take all the pain away but I wanted to be stronger than a pill. I actually spent the time I was awake reading Google results for Cipralex withdrawal like this; reading if other people were experiencing this. It helped a lot. I wasn't insane to be experiencing this! That was the first 2 weeks. The vertigo/dizziness tapered off along with the nausea, dreams, drowsiness and random crying. The headaches, extreme sensitivity, and anxiety took longer though. For the headaches I went off ALL medication including birth control. I found that the type I was on was intensify the headaches I was already having into migraines. It helped quite a bit for me to be completely med free. As for the the anxiety and sensitivity, that took months. Part of me thought maybe I was still depressed but I realized that when I was crying at things, it was to sad stories on the news, or sad parts in movies. I would cry my eyes out and this never happened before! But that was normal to other people. I had become so numb emotionally while on antidepressants. That's the point of them though! When you're depressed you can't control you emotions, you're either too high or too low, so the meds try to balance that. Your emotions become so dull after a long time. Where a movie where even men would be tearing up, I could sit through it thinking, \"meh ... could be sadder.\" Now I was crying at EVERYTHING sad. They showed a bunch of neglected animals at a shelter on the news and I couldn't stop crying. I thought maybe this meant I couldn't control my emotions = depression, but I was just experiencing emotion I hadn't for years! Granted it was being slightly enhanced by withdrawal. This might sound too hard but it took me 6 months to feel \"normal\". I had to basically re-learn emotions. I wasn't use to them. If your on the meds for a long time you kinda have to re-learn who you are in many ways. There are days where I feel depressed. I have to remember that Everyone, Everyone, has days like that though. I will probably always feel more susceptible to it as well. But I realize it. It's a bad day. Everyone has them. There's a good chance that that particular day I didn't eat that well or slept like poo the night before. I'm not stupid, I realize this isn't possible for everyone. I had a good environment to go med free in. My husband was EXTREMELY SUPPORTIVE. That made things a lot easier for me. At the end of December this year, 2013, it will be 3 years I have been medication free. I was born and lived in Canada my whole life. Never thought I could leave cause of my meds. In May 2013 we moved to Japan. It's crazy but I haven't been this happy in my life! Sorry that this is long. I hope it helps someone though.","author":"HappyinJapan","title":"Cipralex","replyTo":"post1520913","postID":"post1755686","date":"20130920-00:00:00 -0400","authorID":"http://ehealthforum.com/health/user_profile_654262.html"},{"content":"I am currently in the process of weaning off of Cipralex and starting on Wellbutrin. I was taking 10mg for the past 2 years and have gained 25 pounds in the past 8 months and have not been able to orgasm either. My Dr. suggested Wellbutrin as it is supposed to help with the losing of the weight and regaining the ability to orgasm. So I have now been on 5mg of Cipralex for the past 10 days and started the Wellbutrin 4 days ago. I feel absolutely awful!! I am so itchy all over my body. I feel like I have he flu, headache, sweating, nausea, twitching, totally zoning out. I can't tell if it's the coming off Cipralex or starting the new one. I will start taking the 5mg every other day tomorrow for about another 8 days. Does that seem slow enough? I'm not sure I can handle this getting any worse. My husband works out of town and I'm having to look after my two kids on my own. Can somebody please tell me what the \"brain zaps\" are? They sound very scary!! I can't seem to do much more than lie in bed. Cant focus to read or even watch tv. Glad to read that this is normal but on the other hand kinda scary that it is!!","author":"Littlepawz","title":"Anyone else weaning off cipralex and starting Wellbutrin?","replyTo":"post1520913","postID":"post1756660","date":"20130923-00:00:00 -0400","authorID":"http://ehealthforum.com/health/user_profile_654933.html"},{"content":"Hey all, I've been going through withdrawal from Cipralex for a week and a half, and the dizziness is almost unbearable! I've had almost every single symptom. Did anyone find something to help them relax, feel more connected to the world and help deal with symptoms? Thanks!","author":"thisgirl113","replyTo":"post1520913","postID":"post1763036","date":"20131017-00:00:00 -0400","authorID":"http://ehealthforum.com/health/user_profile_659420.html"},{"content":"Analysts believe that Cipralex rapid onset, exit this test will help low Citalopram S isomer as a different product to participate in market competition, if the drug for anxiety disorder, generalized anxiety disorder (GAD), and social anxiety disorder (SAD) is also effective, market prospects will be broader, because citalopram is not approved for these indications. Lundbeck company in March 2002 released data show that, Cipralex compared with placebo, significantly improved symptoms in patients with GAD or SAD, but the application is not found, and now Cipralex is still in Europe, Canada, Australia and the United States waiting for approval for the treatment of depression in the United States by Forest large pharmaceutical drug market, the trade name Lexapro.","author":"farwell","replyTo":"post1520913","postID":"post1763114","date":"20131018-00:00:00 -0400","authorID":"http://ehealthforum.com/health/user_profile_655657.html"},{"content":"Hello everyone! Thank God for this forum! I have been on and off anxiety/depression drugs for over 20 years (Prozac, Zoloft). Four years ago, I was put on Cipralex for drepression. It was like a wonder drug. No more anger, frustration, could focus, and no more mood swings. This year, I lost my job. I decided to wean myself off of the drug. I was on 25 mg, then tapered to 20, then 10 and finally 5 for the last 4 weeks. The last day was October 18th. Two weeks prior, I started getting these incredible dizzy spells that came on suddenly, coupled with nausea. After a few days, it went away but I still felt fatigue, aches and pains, tinnitis, and felt extremely cold and then extremely hot. Two days after the final pill, I got this debilitating dizzy spell again with the ringing in the ears and all the flu-like symptoms plus zapping when turning my head. I went to my family doctor today and he told me that I may have a brain tumor and wanted me to do a CT scan! I knew he was wrong but I didn't know what was wrong with me ... until I talked it over with my friend and we figured out it was because of me going off Cipralex! And then I found this forum. I thought I was losing my mind! I hear similar accounts posted here and I feel so relieved. I have almost all the symptoms. Instead of going back to my idiot family doctor who should've figured this out as he was the one tapering the meds, I would like to ask you guys a question. I am afraid he may have tapered me off the meds a tad too quickly. But, I guess that is a moot point at this time. Should I maybe go back to 5 mg for a couple of more weeks to continue the tapering off process or just suffer through it? So far, no psychological symptoms have reappeared, just physical ones. I'm assuming I can expect to be like this for at least a month, correct? Thank you so much for sharing your experiences. I don't feel so alone. Good luck to everyone and I pray that we are all able to have a happy, healthy life without drugs!","author":"Gadabout","title":"Withdrawal Nightmare","replyTo":"post1520913","postID":"post1764766","date":"20131024-00:00:00 -0400","authorID":"http://ehealthforum.com/health/user_profile_660745.html"},{"content":"I am so Happy I read this. I decided a month ago to go off my Cipralex. I wanted to just move on. I was tired of sleeping for 12-14hrs a day and what felt like I had no life! it was like the treatment was as bad as the disease for me. BUT side effect HOLY COW BATMAN! The head zaps I had never had and slowmotioness ( not sure that is even a word )WOW! And constipation is unreal. Along with laughing one minute and crying the next. I was crazier coming off that than i was before I took it. But thankfully it is starting to change. I can feel it. And get this only one nap this week and I work 5pm to 1am shifts. I am now up at 7 and in bed at 130am. I could never have functioned like that on this medication.","author":"LouiseBalmy","replyTo":"post1520913","postID":"post1766345","date":"20131031-00:00:00 -0400","authorID":"http://ehealthforum.com/health/user_profile_662072.html"},{"content":"I've been on 10mg of Cipralex for just over a year due to an event that occurred last summer that sent me into a deep depression. I feel now that I'm able to cope without the medication so have been tapering myself off. As of about two weeks ago I've only been taking one pill every other day and so far I can say I'm feeling good. I know two weeks is still relatively recent but overall there haven't been any really raunchy side effects. While on the medication, I became very, very lethargic. I could spend an entire weekend sitting on the couch not changing my clothes or showering. Considering before I went on medication I showered every day without fail, that was a noticeable change. I also gained a decent amount of weight, not necessarily as a reaction to the medication but because I just didn't care if what I ate was going to make me fat. It's great not to be bothered by anything but in that context, it's very, very bad. I ate anything and everything. I didn't have that anxiety-ridden voice in my head telling me not to eat like a pregnant hippo. I had a really hard time concentrating and remembering things while on Cipralex. My grades in school dropped, I couldn't remember from one day to the next what my boss had asked me to do or how I'd done things so needed to be re-trained several times. I just felt absent and disconnected from what I was doing. Like clockwork, about a week before I'd start my cycle while on Cipralex, I'd experience depersonalization coming in waves lasting about 15-20 seconds throughout the day. It's almost as if I was experience withdrawal symptoms while on Cipralex. I slept. ALL. THE TIME. I was tired almost constantly. I was used to being more than ok and awake with about 7 hours of sleep, but while on Cipralex, anything under about 9 or 10 was awful. I'd wake up around 11am every weekend morning and sleep my days away, which was not like me at all. I love how the medication mellowed me out and stopped me from stressing over the little things but more importantly, allowed me to not dwell in depression when it was at its worst. I'm looking forward to coming off of them completely and feeling like my old awake self again. So far the only real side effects I've noticed are headaches in the evenings, a bit of nausea throughout the day, and ever so often I will feel what I would describe as a brain zap but very, very mild. I would more likely describe it as a zap of lightheadedness. To all of you going through wicked withdrawal symptoms, I wish I could reach out and give you a big hug because you're all so strong. You'll get through this. We all will.","author":"Lizeroo","replyTo":"post1520913","postID":"post1767542","date":"20131106-00:00:00 -0500","authorID":"http://ehealthforum.com/health/user_profile_662987.html"},{"content":"Hi Warriors, I have been on Cip, 5mg (cannot handle more as it will give me panic attacks) for the last two years for extreme anxiety and am weaning off for the last two weeks by taking 5mg every other day. Have been experiencing heavy night sweats, vivid dreams, tremors, cold, and dizziness. Am going to switch to taking it daily by shaving the dose down to 2.5mg everyday for a few weeks. I read somewhere that the reduction has to be really gradual. We will all be ok...with the support such as this forum. Thanks for sharing, Everyone.","author":"Warrior1","title":"Weaning...","replyTo":"post1520913","postID":"post1769699","date":"20131118-00:00:00 -0500","authorID":"http://ehealthforum.com/health/user_profile_664877.html"},{"content":"I'm so glad that I decided to \"google\" the withdrawal symptoms of coming off of cipralex. I started taking cipralex 10mg for anxiety and depression (anxiety was mainly the cause of my depression) in march 2013. It was increased to 15mg within a month or so I believe. Then it was tapered down to 10mg for few months, then 5 mg for a month or two and finally I decided that I was ready to stop it. So, I talked with my psychiatrist and he suggested that I take 5mg every other day for another 2 weeks and then stop it. Here I am, I stopped taking it a week ago. At first, I didn't feel any difference but recently, last 2-3 days..I'm feeling lightheaded especially if I get up too fast or move my head to right/left. At first I thought, maybe my blood pressure was dropping from standing up too fast. However, I feel it even when I'm lying down. It's not stopping me from doing anything but I definitely feel this is not the \"normal\" me. I guess I am lucky that my symptoms are mild as of now (hope it doesn't get worse). It had me wondering what could be the cause of it, especially considering I am a nurse and immediately started connecting the symptoms to million other diseases and then it clicked..oh the cipralex. After reading the comments, I'm hopeful and confident that it will go away soon and I'm going to stay strong. Never want to go back where I was before. Cipralex was a miracle drug for me, although this was the only one I was put on, it worked, it changed my life. Good Luck to everyone. It will get better, just hang in there!","author":"silenceisbliss","replyTo":"post1520913","postID":"post1771192","date":"20131126-00:00:00 -0500","authorID":"http://ehealthforum.com/health/user_profile_666050.html"},{"content":"I have been on Cipralex for a year and a half. I feel this drug as ruined my life. 2 years ago I went to the eye doctor and had 20/20 vision...I now have to wear glasses. One eye has double vision and is totally near sighted and the other eye is the total opposite of far sited. 6 months ago I had to episodes of like a electric shock feeling in my head...very scarey while driving. My doctor sent me for every possible test you could think of and everything came back normal. I feel worse than I did before I started taking this drug...Has anyone else had this. I am starting to ween myself off and am a little nervous with all the things I have read on the withdrawal symptoms","author":"TaraHaley","replyTo":"post1520913","postID":"post1775895","date":"20131219-00:00:00 -0500","authorID":"http://ehealthforum.com/health/user_profile_669686.html"},{"content":"I have been on Cipralex for around 7 years and finally coming off this month. Initially I started at 10mg for the first few years then found that my body was becoming immune to that dosage as my anxiety started to reappear. I also believe an incident where I was drugged and a bad relationship contributed to me increasing my dosage from 10mg to 15mg to 20mg. I was on 20mg for 3 years then weaned myself down to 15mg a year and a half ago. I stayed on 15mg for 6 months then went to 10mg for 6 months then 5mg for 6 months. Now I'm taking 5mg every 3 days for the next few weeks then I'm done. I have noticed the brain yaps today (it's been 3 days since I've taken Cipralex) and also noticed I'm very emotional, crying and letting small things get to me. I also find I'm getting hot and cold (flu like symptoms). Because I knew I was getting off the drug, I started to eat really clean and get into yoga and exercise. Also taking a B complex vitamin helps with the anxiety. My question is, are there others on here that have been taking Cipralex for 5 years or longer? If so, have you managed to wean off the meds and how long did it take for the withdrawal symptoms to go away? Thanks!","author":"JennB83","replyTo":"post1520913","postID":"post1780650","date":"20140112-00:00:00 -0500","authorID":"http://ehealthforum.com/health/user_profile_673354.html"},{"content":"Good Find this thread helped me tremendously been medicated for 6 months (50)pristiq 2 months (10)cipralex weened myself off every other day for 2 weeks 3 days after completely stopping medication severe dizziness, out of control feeling, major zaps which till now I described as shaking severe neck/throat flu like symptoms Hot/Cold Flashes My life was WORSE on these drugs and bring on the widthdrawl. Im free and Will be Myself again one day wrote this 5 days after completely off meds My backup plan is clozapam works instantly for me take when you need and fun with no bad symptoms other than having to much fun pass out Always Consult your Doctor Before changing anything","author":"TRACKER420","title":"Cipralex widthdrawl","replyTo":"post1520913","postID":"post1781004","date":"20140113-00:00:00 -0500","authorID":"http://ehealthforum.com/health/user_profile_673642.html"},{"content":"Hi everyone, I'd like to add my take on coming off of Cipralex. There are a lot of horror stories out there about the worst of the worst that can happen and I'm happy to say that this is not one of those cases, so it's definitely possible to come off Cipralex without watching your body and life fall apart in front of your eyes. I was on Cipralex for about a year and a half and came to the point where I wanted to be off of them. I'd gained a lot of weight and was just generally tired of how they made me feel; considering I didn't need them to \"support\" me emotionally anymore, I was more than happy to let them go. I didn't go the smart way of tapering off, one day I just decided to stop taking them and wait and see what happened. The first few days were normal. On the fourth day I started getting very mild \"brain zaps\" (although I'd describe them more as the feeling of a momentary gust of wind inside your head). They would only really happen after standing up too quickly or turning my head really fast, but overall they were nothing that bothered me too much. About a week and a half after stopping the dose, I had one day where I felt a bit sickly, dizzy and the \"brain wind\" was a bit strong, but after that, it was good. The wind significantly reduced after that and I never had a dizzy day again following that one day. The only side effect I notice now is that I do cry easier than usual but you know what, I'm actually ok with that. It's so nice to feel strong emotions again. It's been a long time since I haven't felt numbed out. And now, several weeks later, I feel better than I have in a long, long time. And I'm so glad. So for anyone worried about it, it is possible to come off of them with a good experience.","author":"BBopper","title":"Very little withdrawal","replyTo":"post1520913","postID":"post1784810","date":"20140131-00:00:00 -0500","authorID":"http://ehealthforum.com/health/user_profile_676800.html"},{"content":"update : Finally done with withdrawal was not fun for me But much better than on, took almost a month of severe symptoms, life is better","author":"TRACKER420","replyTo":"post1520913","postID":"post1785297","date":"20140203-00:00:00 -0500","authorID":"http://ehealthforum.com/health/user_profile_673642.html"},{"content":"I'm coming off Cipralex myself. I've relocated and don't have a doctor where I am now. Having had experience with anti-depressants with my ex-wife, I knew I couldn't go cold turkey. So I planned myself a long taper and it's working. Because the dosage of this drug is low, it's difficult to adjust easily. I was on 20mg a day so I decided to take 10mg out of my entire weekly dose, one weeks at a time. So week 1 & 2 was 20mg a day except Saturday when I took 10mg. Week 3 & 4 was 20mg a day except Wednesday and Saturday when I took 10mg. I'm down to 10mg a day now and will not be taking any on Saturday starting in two weeks. Although this seems like a ridiculously long taper, its working because I'm having zero withdrawal symptoms. I am having some mood swings but I don't attribute that to actual withdrawal, that's just reduced SSRI volume and I'm going to have to adjust again to being without the constant leveller. I can't imagine just chopping the dose in half for two weeks and then getting off of it two weeks later. I think a lot of people make that mistake with their anti-D's and then just end up going in a circle. Don't rush it. You didn't get to the point of needing that drug in a month, you're not going to get off it in a month.","author":"DonewithCipralex","replyTo":"post1520913","postID":"post1785387","date":"20140203-00:00:00 -0500","authorID":"http://ehealthforum.com/health/user_profile_677317.html"},{"content":"I as on Cipralex for about 6-7 years , and had wellbutrin added a couple of years ago, I had a lot of side effects was on other drugs for increasing migraines and also a daily (take as needed) anti- depressant.Thought it was way too much and wanted to get off of them.So I just went off them in a panicked move, now Im basically in my own personal hell.I have pretty much every symptom I have read about ,the head zaps and dizzyness , are the worst.My head just feels like its all pressurized and its a scry feeling, that noone understands unless theyve been throught it.Its already been a couple of months since I stopped, and stopped the daily's(aprazolam) about a month ago.Im in a bad state of confusion over what to do, my gp never said a word about dangers or withdrawls when I told him Id stopped, actually just said \"good for you\" and that was that.I don't know at this point if I should go back on and taper again (after months of no drugs) or try to hold out with the hopes that all these symptoms will end soon.","author":"jjglenn","title":"Withddrawl from cipralex and wellbutrin","replyTo":"post1520913","postID":"post1793181","date":"20140312-00:00:00 -0400","authorID":"http://ehealthforum.com/health/user_profile_683650.html"},{"content":"I am so happy i found this page. i am french canadian and we don't have anything like it. I have been off Cipralex for 2 weeks tomorrow. I have to say this was the worst ride ever. I have experienced all the above symptoms: headhaches like shockwaves, dizzyness, crying, anger, vivid crazy dreams etc. It seems to get better. This morning i had a couple of seconds when i felt happiness and there it was: this is the good effect of getting off Cipralex. For the past year, i did feel happiness but in some sort of a daze. Like a synthetical happiness. i know it sounds weird but i feel like the past year even tough i tought Cipralex was helping me, it was also covering the good parts inside me. Fortunately, i am very active and i do alot of yoga which is helping a great deal with withdrawal and meditation also. I have been also sick since i stopped the medz (the cold). Maybe it is not related dough. I am happy to hear some same ideas i have. For example how doctors know soooo little about medication! My doctor told me there was no side effects for taking Cipralex, no addiction and no withdrawal! God, i am going to give her the url to this page. I feel better reading i am not alone.","author":"yogaQueen78","title":"Withdrawal from Cipralex","replyTo":"post1520913","postID":"post1801972","date":"20140423-00:00:00 -0400","authorID":"http://ehealthforum.com/health/user_profile_690049.html"},{"content":"I just started taking cipralex, to help with a mental drug addiction. I didn't have any real bad depression or anything...maybe just minor...mostly due to cirumstances in life. but think I was maybe self medicating with other drugs... I took half of a 20mg dose to start, because of the side effects. but I felt really horrible and stopped for a couple days, then started again, taking the tiniest piece, probably 1mg. I kept taking this 1mg for about 5 days, and it was giving me bad anxiety and paranoia, so I stopped again. But it has been 5 days now, and it's still not gone away. I still have the anxiety, paranoia, lack of appetite, bad libido, and I'm feeling pretty depressed, more so than I've ever normally felt. What the heck is going on. How can such a small dose be causing me so much problems? When is this going to go away? How the hell is anyone supposed to start @ the recommended 10mg/day and stay on, when 1mg is killing me? For anyone thinking of starting SSRIs, they are no joke. I don't think doctors are very good at explaining the side effects of coming on/off them. They probably really shouldn't be touched unless very necessary. It could just be worse. Definitely don't start them if you have school, or work, or responsibilities. Probably should only be started if you can have some time off, or if you're already in a very very bad place and it can't get any worse. I know it works different on everyone, and for you there may be no side effects, and it could work miracles. But for me, it has really caused me trouble and I deeply regret taking them. My doctor failed to mention this possibility...","author":"JiminyCricket55","replyTo":"post1520913","postID":"post1805919","date":"20140513-00:00:00 -0400","authorID":"http://ehealthforum.com/health/user_profile_214585.html"},{"content":"Hi Everyone! I've been on Cipralex for about 5 years, it has been a miracle drug for me. I was depressed and did not know it. My wife got me to a good psychiatrist, who determined I was clinically depressed. I started at 10mg and now am up to 20. ... and I feel great. I no longer have that dark place I would go to, especially in the mornings. I am in my 50's but feel like I am 18 again... very natural, normal... As a Flamenco musician, I was worried that I would lose my musical 'edge'. The psychiatrist said this would not be the case as for those who should be taking it, the drug really just helps your mind work normally. ... And he was right, I am playing better now etc. Certainly, there are side effects. The main one for me is decreased libido. This is irritating but not a big deal. I tried mixing in some Welbutrin, which helped the libido but made me feel too 'jumpy', so I stopped. Regarding withdrawal, the psychiatrist recommended I never go off. He said if you go off an antidepressant, and find you are depressed again, it is likely that taking the drug again will not work. So for any of you thinking of withdrawing, be careful and do your research. Actually, I just was reading about the author David Foster Wallace. I think he had a more serious situation than me, but when he went off his medication, things did not work out. He tried to get back on, and when the drug did not work again, he wound up hanging himself... Yikes! Anyway, this is serious stuff, as is life. I think the key is a good Psychiatrist if you can find one and/or doing lots of research...","author":"Cipralexfan","title":"Do your research before you decide to withdraw","replyTo":"post1520913","postID":"post1808113","date":"20140526-00:00:00 -0400","authorID":"http://ehealthforum.com/health/user_profile_694426.html"},{"content":"I just started going off 20mg of Cipralex and boy everyone is right..........it is hell, but I decided that I would rather be drug free than be on this sh_t medication. I went from 20-10mg the first week. This medication should not be allowed for resale. I am feeling everything everyone is and it is truly nice to know that you are not NUTS or CRAZY. This website saved my life. Thank you for starting it and everyone who contributed to it. Week one and will update as I move forward.","author":"Sillyme4","replyTo":"post1520913","postID":"post1820685","date":"20140811-00:00:00 -0400","authorID":"http://ehealthforum.com/health/user_profile_701823.html"},{"content":"I just started going off 20mg of Cipralex and boy everyone is right..........it is hell, but I decided that I would rather be drug free than be on this sh_t medication. I went from 20-10mg the first week. This medication should not be allowed for resale. I am feeling everything everyone is and it is truly nice to know that you are not NUTS or CRAZY. This website saved my life. Thank you for starting it and everyone who contributed to it. Week one and will update as I move forward.","author":"Sillyme4","replyTo":"post1520913","postID":"post1820686","date":"20140811-00:00:00 -0400","authorID":"http://ehealthforum.com/health/user_profile_701823.html"},{"content":"I read all of your posts and thank you all for being so open and honest, it goes a long way in helping others. I'm on day 7 off Cipralex completely (still on 150mg WellButrin) and the head zaps, dreams and crying have been a bit worrisome, though nothing as bad as being on Cipralex. What I have noticed missing from almost all posts is the discussion of exercise and nutrition. I used to be into working out hardcore and eating quite well, life was good. I let that slip for more than a year, mix in my family history of depression and anxiety, and I found myself on Cipralex. I thought it was a miracle drug, until I started having all my natural highs and lows blunted completely. I turned to recreational drugs on weekends to feel something again, nothing that jeopardized my career or responsibilities, but enough that it was an issue. I stopped and I've resumed my exercise and nutrition routine and the benefits are greater and just as fast as any anti-depressant, with NO side effects. If this isn't something you have tried or considered, please do. If you can commit to 2-3 full weeks of honest effort to start, the reward will be worth it. I apologize for being preachy, i just wish the best for all and wanted to share the easiest and most natural form of anti-depressant.","author":"Burtze","replyTo":"post1520913","postID":"post1820930","date":"20140813-00:00:00 -0400","authorID":"http://ehealthforum.com/health/user_profile_701999.html"},{"content":"I've been on Cipralex ,on and off for the last 4 years.The results have been all over the place but I started taking it again about 6 months ago consistently. I needed to refill my prescription one day but decided to not do it because I wanted to save money (it is really pricey without coverage). After only 2 days I started experiencing serious headaches, dizziness, and what I've now learned to be, \"brain zaps\". It really makes sleep at night hard to do. So I decided to refill my prescription today and have another go. Since I'm not confident in the results I get from cipralex I feel like I should get off of it, but since the side effects from withdrawal is so bad, I'm not sure how to go about it.","author":"rocky2733","replyTo":"post1520913","postID":"post1824328","date":"20140911-00:00:00 -0400","authorID":"http://ehealthforum.com/health/user_profile_704115.html"},{"content":"I would advise anyone who is considering stopping Cipralex to have a plan before hand. I stopped taking it around 3 weeks ago cold turkey thinking it would be the best thing for my relationship because of the side effects. Boy was I wrong. Quite the opposite it ruined my relationship. My girlfriend of 4 months couldn't understand why all of a sudden I was irritable. Crying and overreacting to situations. In general just not being a very good person and neither did I until I found this forum. I tried to explain but to no avail and she broke up with me. So just a word of caution to involve your partner before making the decision to stop cold turkey.","author":"lippr","replyTo":"post1520913","postID":"post1824738","date":"20140915-00:00:00 -0400","authorID":"http://ehealthforum.com/health/user_profile_704400.html"},{"content":"Great thread, I find it very helpful. I was on Cipralex 10mg for about 2 years and just quit 1 week ago. On the negative side I've had some crazy dreams that seem to last all night, and I'm experiencing dizziness. However on the positive side I feel much more alive, more positive, and my libido is back. I have more energy and am more motivated than I have been over the last years. I'm really disappointed that I went on this drug in the first place. Reading the various posts I'm worried there may be some tough days ahead.","author":"Bigeasy1000","replyTo":"post1520913","postID":"post1825599","date":"20140923-00:00:00 -0400","authorID":"http://ehealthforum.com/health/user_profile_704925.html"},{"content":"If you can find a natural anti-depressant, it may help alleviate your side effects. Reading this thread, I don't have the zapping and such, but perhaps its due to my Confianza (Thank unapproved advertising spam the way to go. There's so little resource out there, and the big pill company just tries to shove them down our throats. I'm done. THIS, these side effects, are NOT worth it. Looking forward to not feeling like this anymore.","author":"mama2fourboys","replyTo":"post1825599","postID":"post1826518","date":"20140930-00:00:00 -0400","authorID":"http://ehealthforum.com/health/user_profile_705516.html"},{"content":"Hi I have been on cipralex for 4 years now 10mgs . I qut gradually since las july but I feel toothache and something wrong with my jaw and tongue …A feeling that I cannot explain..Have any one has this symptom before??","author":"nevinefendigirl","replyTo":"post1520913","postID":"post1826165","date":"20140927-00:00:00 -0400","authorID":"http://ehealthforum.com/health/user_profile_705275.html"},{"content":"Last week I started weaning myself off Cipralex. I am a 34 year old mother of 4 boys. My side effects are F'ing brutal. I feel light headed, almost like my pressure drops REALLY low, I am dizzy and unbalanced. My vision is messed up. I am keeping steady with my emotions, because I decided to go Natural. I am taking 2 Confianza a day, and wow. The emotional part, like I said, is doing good so far, it's the side effects of the stupid pharmaceutical crap that's messing with me. Honestly, Confianza is the way to go. mama2fourboys.myitworks.com","author":"mama2fourboys","title":"Cipralex withdrawl SUCKS","replyTo":"post1520913","postID":"post1826517","date":"20140930-00:00:00 -0400","authorID":"http://ehealthforum.com/health/user_profile_705516.html"},{"content":"I started weaning a month ago, went to a half dose, so 5 mg, and non yesterday, but holy man, this dizziness is insane! Started about a week ago and is almost constant. How long did it last for you? Freaked me out so bad I took a half tab today.","author":"cpm","replyTo":"post1826517","postID":"post1832428","date":"20141112-00:00:00 -0500","authorID":"http://ehealthforum.com/health/user_profile_709036.html"},{"content":"HI has anyone had a prob with there nose as been trying to come off pills, but seem to have a bad smell all the time and only since i have been cuting down on the pills","author":"anonymous","title":"nose","replyTo":"post1520913","postID":"post1828798","date":"20141020-00:00:00 -0400","authorID":"http://ehealthforum.com/health/user_profile_707089.html"},{"content":"This is a very helpful conversation - thank you to everyone who has responded. I, too, have been on 20mg Cipralex for about 2.5 years. Just recently, I have decided to halve my prescription to 10mg per day - which has gone fine. This process has taken place over the past 2-3 months. This past weekend I decided to go off Cipralex completely and have been suffering from similar symptoms to everyone else on this thread. Dizziness, difficulty sleeping, weird sweating patterns and abnormal heart rythyms. I am seeing my doctor tomorrow and will discuss these symptoms but, I hope to stay off this drug for good! Keep well everyone!!!","author":"mothermcgee","replyTo":"post1520913","postID":"post1835572","date":"20141203-00:00:00 -0500","authorID":"http://ehealthforum.com/health/user_profile_710607.html"},{"content":"I am a 19 year old girl and I've been on cipralex* for 2 years. I recently decided to try to gradually stop taking it. For about a week I took half my dosage and then this week I stopped entirely. I've been getting these weird shocks and like out of body feelings, I'm also hungry all the time but have no appetite if that makes any sense, I don't feel my depression coming back but my anxiety is about half throttle because of the symptoms im experiencing, I'm worrying myself about my medication that's supposed to repress my worrying! I don't know how long this will last but I'm hoping to stick it through so I can stop feeling so weird... Anyone successfully get off their cipralex* ?","author":"GymGirl95D","replyTo":"post1520913","postID":"post1841759","date":"20150126-00:00:00 -0500","authorID":"http://ehealthforum.com/health/user_profile_714554.html"},{"content":"I went through many of the mentioned symptoms when coming off Cipralex. I went from 20mg to 10mg for about 4 months. Then, I cut out the Cipralex and suffered through some of these symptoms - dizziness, headaches, etc. Tough it out - the symptoms subside and eventually go away. Do not retreat to taking it again - if you feel these things!!! Stand strong and get off this med.","author":"diamond4348","title":"Coming off Cipralex","replyTo":"post1520913","postID":"post1841762","date":"20150126-00:00:00 -0500","authorID":"http://ehealthforum.com/health/user_profile_714556.html"},{"content":"Its been almost 3 years on Cipralex,I started 10 mg and noticed,I didn't felt myself,allot of side effects. Sleeping almost 13 hours,I gain weight,suffer blurry visions,headaches for sleeping too much or deep sleep,weird lucid dreams...adding more anxieties...when, its the main reason for taking this meds. Then,I felt this brick into my stomach,couldn't breathe sometimes,I had to sleep sited...so, I don't snore or get my breath. Two years ago,I went for my flu shot,I felt head lighted,dizziness,scared to faint and few days after,I bleed below the waist,thinking it were my time of the month. But,it wasn't and soon I felt...I had an yeast infection and urinated often,itching. So,I tried to cure it with Canesten product,two months apart and it didn't do much...it returned each time,after my periods...I was discouraged,no sexual desire. I constantly in pain below the waist and felt like constipation,cramps,body aches,this brick in my stomach gotten worst...less of breath,dizziness,electric shocks,ear ringing or buzzing,body itching or twitching,tightening of the throat,mouth...to a point I swallow a small chicken bone...it took years to unstuck. So,I decided enough and lowed my dose to 5 mg...without my doctor to know,almost a year,now. After,I noticed the same side effect...with the withdrawals and I were to scared,to have my flu shot years after. Its been 3 days...suffering with this upset stomach,constipation,the brick into my stomach gotten,to a point cramps,couldn't eat much,felt full for hours,suffering heart-burns,bleeding lightly pink-brown below the waist,less yeast infection,urinated less often...less body tightening,losing weight,my chicken bone in the throat is gotten loose,but,still there.(2 years now) That's my experience and side effect or withdrawals.","author":"PhoenixPunisher","replyTo":"post1520913","postID":"post1844988","date":"20150218-00:00:00 -0500","authorID":"http://ehealthforum.com/health/user_profile_716408.html"},{"content":"Hey I am 16, and have been on cipralex since late January, I went of it cold turkey. I have read up on the symptoms of going off of it and many of them I have. There is one thing that I haven't seen come up, and I don't know if it is a side effect of going off it or just a random thing that is happening. Every few minutes, I feel a pulsing sensation which I am finding very irritating. It occurs in my fingers, hands, arms, legs. This has only been happening for about a day, but i'm very jumping and just freaking out, I was wondering if anyone else has had a similar experience","author":"10_Dakota_10","title":"Withdrawl Symptoms from Cipralex","replyTo":"post1520913","postID":"post1870451","date":"20150814-00:00:00 -0400","authorID":"http://ehealthforum.com/health/user_profile_730156.html"}],"URL":"http://ehealthforum.com/health/withdrawal-symptoms-of-cipralex-t333192.html"}