{"title":"Every Other Day Depression?","thread":[{"content":"Hi, i'm writing on behalf of my father, who for the last 4 years has suffered mood swings on a 24-hour basis. Seriously. One day is \"good\", he's active, alert, on the computer all day, watching tv, etc. The following day is \"bad\", he can barely sit in the armchair and listen to music, has to close his eyes, can barely talk or walk, his muscle tone is lax -- everything changes. Doctors diagnose him as 'depressed' -- but this is bs...I have never heard of 'depression on an every-other-day basis. He does not fit the diagnosis for bipolar either. He is age 77, had a stroke 6 years ago, left arm paralysed, can shuffle around a bit still but is not physically active. Mentally he is completely alert and functional, even on his bad days (just that he can't communicate well those days). Any advice, experience -- even if you've ever heard of somebody else with a problem like this - would be appreciated. We don't even know what to call it.","author":"dechenla","postID":"post305094","date":"20051126-00:00:00 -0500","authorID":"http://ehealthforum.com/health/user_profile_53030.html"},{"content":"I am not a professional but I am sure that your father has what is called rapid cycling.The symptoms are exactly as you described. Take him to a psychiatrist that has experience in this disorder. Let me know what happens david","author":"pineystein","title":"77 Year Old Father","replyTo":"post305094","postID":"post305108","date":"20051126-00:00:00 -0500","authorID":"http://ehealthforum.com/health/user_profile_53039.html"},{"content":"David, I agree that the 77 year old father has what is called \"rapid cycling\". From what I've read on the Internet, most \"rapid cycling\" is used to refer to bipolar depression. However, I found a Jan. 1988 paper documented in the Journal of Nervous and Mental Disease in Vol. 176 (1), pp. 53-56, written by Sidney Zisook. The Abstract of the paper entitled \"Cyclic 48-hour unipolar depression\" follows here: ********************** \"This single case study reports on a 74-year-old woman with 48-hour cycles of mood disturbance for 2 years. Every other day she awakened feeling sad with low energy, decreased appetite, fatigue, diminished enjoyment of normal activities, increased irritability, occasional self-deprecatory thoughts, and difficulty concentrating. On alternative days she was active, outgoing, energetic, and cheerful. Her past history was marked by mild postpartum depressions, not requiring treatment, with each of her six pregnancies, and a more severe depression at age 57, which seemed to respond to Premarin. During the recent 2-year period of mood swings, the patient was given trials of several heterocyclic antidepressant medications, but side effects precluded the use of therapeutic doses or durations of treatment. Reluctantly, the patient agreed to a trial of lithium carbonate. After the second week of lithium treatment, at a level of 0.4 mEq/ml, she reported marked improvement, feeling fine every day without mood fluctuations. After almost 1 year at this blood level, she remains asymptomatic. Thus, the patient's cyclic 48-hour unipolar depression responded dramatically and completely to low doses of lithium carbonate.\" ******************************* This condition (which I have and have posted about on this thread) appears quite rare....................Kent","author":"Kent1","replyTo":"post305108","postID":"post1865410","date":"20150715-00:00:00 -0400","authorID":"http://ehealthforum.com/health/user_profile_727516.html"},{"content":"Thank you david, for suggesting this. I checked out rapid cycling (ultradian) and there are some intriguing leads on the internet I will pursue furher. He has been to any number of specialists and psychiatrists but they seem pretty dimwitted about this stuff, at least in the area he lives (small town near austin tx) the best they have offered to date, beyond more antidepressants, is electroshock (no thank you) -- and even then it's pure guesswork as to what that would actually do. Thanks again for your suggestion, it really helps.","author":"dechenla","title":"Re: 77 Year Old Father","replyTo":"post305094","postID":"post306062","date":"20051129-00:00:00 -0500","authorID":"http://ehealthforum.com/health/user_profile_53030.html"},{"content":"Hello, Yes. I have this . I am 56 y/o. In '08 I had 18 hours of brain surgery. Since then I have had the exact same description as dechenla's Dad. I have great doctors. One of them- a pharmaceutical proponent called it \"odd\".","author":"Lisa01","replyTo":"post306062","postID":"post1802913","date":"20140428-00:00:00 -0400","authorID":"http://ehealthforum.com/health/user_profile_690757.html"},{"content":"I realise it is an incredibly long time since you posted this message but I just felt I had to reply as the post in which you described your father's pattern just rang so many bells to me. My Grandad (who is 84) also suffered a stroke a few years ago and a series of small strokes following this. Since then he too has had a regular pattern of alternating days between 'good' (high energy, almost elated in mood) and 'bad' (low energy, depressed), so similar to how you describe. We (as a family) have also been searching for answers and have been frustrated to find none. He has seen a psychiatrist who originally thought it was rapid cycling cyclothymia (on the spectrum with bipolar conditions) but has now ruled that out. I know my Grandad will be very interested to hear of someone with a similar experience. Please do let me know if you are still active on here.","author":"lauraliz","replyTo":"post305094","postID":"post965246","date":"20090107-00:00:00 -0500","authorID":"http://ehealthforum.com/health/user_profile_155115.html"},{"content":"Hi, Need u r all assistance in understanding the Problem or is it depression ? I am writing about my broother who is 32 year old and working for a IT Firm. At onset let me give some background,When he was about the age of 5 yr he had thyroid operation but when he was 10 yr doctor advised us that he has some throid problem for which he has to take life long Thyroid tablets (ELTORCIN - not sure abt actual name),still he is taking the same on regular interval he vist doctor set the dosage of template(100 to 150mg). My worry of cause is with his behaviour not sure is this is his depression. after multiple attempts he could'nt clear for graduation but frankly speaking i have never seen ,him preparing seriously then we made him join some technical course of his choice but later that also failed to clear for me reason was same. Later we manage to provide him to get job but he could'nt retain their for every thing he has his own excuses we tried to put him various organinzation but he was not able to achive success. Now he is working in same firm where i work and i see a lot of negative attiude in his work and behaviour ,(Is that depression ?) He is not able to mingle with his team members nither bosses rather he get more attach to senior of other dept which actully make fun of him but he feel comfortable with him. The feedback i get about his work is that he is slow learnner and have lot of negative attiude. Many people counsel him but they fail as its v v v tuff to get him convince for his weakness / fault. Can u belive ,Today was his salary hike but he did'nt want to come office because he was tried of night traveling and this hike is THE Must for his survival but he gave priority to sleep. On the other side ,He is very punctual on certain aspects ,cooking food of his choice (But as proffesion he failed) cleaning . whenever he plan to holiday he do excelent planning ,no body can beat him for his memory (Only roads/lane). Once he said he is not feeling to go office coz of headache after while i ask him shall we go for shoping the answere was yes:((( He is yet to get marry ,we are really worry pls help us so that we can help him Regards San","author":"San123","title":"Pls help - Is this is derpression","replyTo":"post305094","postID":"post985738","date":"20090217-00:00:00 -0500","authorID":"http://ehealthforum.com/health/user_profile_164876.html"},{"content":"Hi San, Does your brother's symptoms follow an every other day pattern? Lisa","author":"Lisa01","title":"Every Other Day","replyTo":"post305094","postID":"post1802910","date":"20140428-00:00:00 -0400","authorID":"http://ehealthforum.com/health/user_profile_690757.html"},{"content":"I have the every other day high-, low-energy pattern and I have had this for at least a year. I have not had a stroke or any sort of brain operation. I do have MS but my most recent MRI didn't show any activity. I basically was told that I was crazy and expected too much of myself and needed to get more sleep. That is what I thought at first to but than I purposefully became more consistent with my sleep pattern and it hasn't changed anything. It is frustrating but now I have started planning around my pattern because I was like can't fight it might as well work with it and make the most of my high-energy days. That said I would really like an answer to why and how to make it go away.","author":"qoiy09u","title":"High-energy vs. low-energy","replyTo":"post305094","postID":"post1807153","date":"20140521-00:00:00 -0400","authorID":"http://ehealthforum.com/health/user_profile_693849.html"},{"content":"Hello all, I'm an age 76 male who's had this condition (diagnosed by my PCP) since early 2013. On my \"down\" days, I have trouble getting out of bed and am lethargic. I feel like doing nothing that day and cope by being on \"automatic\". I am generally pessimistic, tired & drowsy, with less appetite at mealtime. Little bothers me. On my \"up\" days, I feel energetic & optimistic and seem to be able to socialize and concentrate more effectively. My wife says that on my \"up\" days I also am more demanding and short-tempered. The condition is so predictably cyclic, I schedule important occasions for my \"up\" days, weeks and months in advance. Physically, I'm a wreck! In early 2010, I developed ataxia said by a neurological surgeon to be caused by Vertebral Basilar Insufficiency (VBI), where blood flow to the vertebrobasilar system is reduced by plaque in the arteries that support the cerebellum. This condition is accompanied by double-vision (diplopia), corrected somewhat by prisms in my glasses. I've also had chronic left leg sciatic nerve pain since early 2013. Lumbar back surgery in Oct. 2013 did not help. So, I've had reasons to be depressed but not every other day! My PCP started treating the depression with the drug \"Lexapro\" (20 mg daily max.) in April 2015. That didn't help so he switched me to \"Effexor\" XR in June 2015, working up from 37.5 mg to 75 mg daily. As of today it too has not helped prevent my \"down\" days. Enough said for now..............Kent","author":"Kent1","title":"Every Other Day Depression - new post 7/11/15","replyTo":"post305094","postID":"post1864654","date":"20150711-00:00:00 -0400","authorID":"http://ehealthforum.com/health/user_profile_727516.html"}],"URL":"http://ehealthforum.com/health/topic47905.html"}