{"title":"My life is a living hell.","thread":[{"content":"With each and everyday passing by, I'm getting sicker and sicker of living life. I'm so confused, I'm never happy, nothing seems to be working out, I don't feel important, I feel empty and useless. Why should I go on when I have nothing to look forward to and just feel helpless like I've always been for the past 10 years in a house where nobody cares about me or my feelings? And why pretend there are people and a God who care about me when people show no interest in helping and yet I still live a miserable life with no hint of God's existence? I highly doubt him, I feel like life itself is just a delusion. I don't even know why I am even alive. I'm sick of always feeling miserable, always fighting and always end up losing. I really wish I was dead. I want my pain to end. My situation feels hopeless, I've made too many mistakes, I can't start over again, my mind is messed up, I don't feel like myself, and my whole life has been a lie. There is no hope. I would sit here rambling all night but there is no point, in the end nothing's accomplished, being in this state there's really not much I can do about it, at least that's what it feels like. My whole life has been a living hell, nothing ever goes the way I would like it to be. I'm suffering without a cause and I feel like I'm living a life of vanity. Why? What did I do to deserve this? Why do I feel like the laughing stock, and nothing ever seems like it's working? I feel like I'm being tortured for someone's joy. I'm pretty sure everyone is making fun of me. I still cling on to hope though. What kind? I don't know. I want to believe there is more to life than this experience I'm having, but it seems unlikely. In the end, I wish maybe there maybe a life where the experience itself doesn't have to be painful and heartbreaking, that's all I ask for. But even that is too much. I just wish to die and remain out of existence, because it seems that living is a mockery of everything for me, except for what it is. I hate my life. Sorry for the long post and poor grammar, just wanted to know if there's anyone else that feels this way.","author":"Zandy12","postID":"post1870849","date":"20150817-00:00:00 -0400","authorID":"http://ehealthforum.com/health/user_profile_729982.html"},{"content":"This is a quick one, ok. Maybe i can come again, but not now. If u have osme time, viewthestory dot com.","author":"samm00","replyTo":"post1870849","postID":"post1871203","date":"20150820-00:00:00 -0400","authorID":"http://ehealthforum.com/health/user_profile_707378.html"},{"content":"Please dont say that. Many others make mistakes all the time, and i too. There was a time i was so 'secure' thinking alls well. But that was complacence, and trusting in myself. We are told to trust in the Lord and lean not on our own understanding. (Prov. 3.5) Not easy to understand, but ppl have done it and aer doing it. You started to vent here... why not seek as David did.. even he talked w. himself saying, Why so downcast o my soul, put your hope in God, and bless His holy name. He found what was important, and dwelt on that. Find a Bible-based church, read and listen to teachings that build up. Why do u say everyone laughs at u-- u only think that. Listen to uplifting music, not the pop stuff that says nothing and focuses on us. Help out, reach out, give.","author":"samm00","replyTo":"post1870849","postID":"post1871752","date":"20150823-00:00:00 -0400","authorID":"http://ehealthforum.com/health/user_profile_707378.html"}],"URL":"http://ehealthforum.com/health/my-life-is-a-living-hell-t458534.html"}