{"title":"Depression, Nausea, not at all interested in any activity","thread":[{"content":"My brother is a sort of depressed. He has gone so dull since 2 years, he wakes up very late in the morning, doesn't talk much about anything with his wife and all. Since 2 years he is having a problem of vomiting. His vomiting is very frequent, about twice a day. Sometimes he feels OK also for about 15 days but the problem again arises without any specific reason. He feels pain in the center part just below chest regularly. Also if he is not having that stomach pain, some other pains like tooth-ache, head-ache, ache in legs, weakness etc is always there with him. He feels not at all interested in any kind of activities, sports, games or any good stuff. Sometimes it happens that he not at all baths for 10 continuous days. He keeps on resting the whole days, don't go for work for weeks and weeks. It feels like he doesn't care about any other person feelings not even his wife/parents. Usually he not at all responds to anyone's query/talk. Please help me, I will be very grateful to you.","author":"prashant170392","postID":"post1844048","date":"20150211-00:00:00 -0500","authorID":"http://ehealthforum.com/health/user_profile_715921.html"},{"content":"You brother IS depressed-not bathing, not taking to anyone,skipping work, laying in bed all day-and having what is called \"somatization\" which is having lots of aches and pains all over-indeed he is. Have you talked to him about this? He needs to see a mental health professional ASAP. You have not mentioned that he has talked about suicide but if that is a possibility then really ASAP and also have him talk to the national suicide hotline people. Now issue #2 is what is this vomiting about? He has a pain in what sounds like his esophagus or food-pipe or maybe the junction of his esophagus and stomach. I wonder if this junction is too narrow (causes are varied) and THAT is what is making him vomit? At any rate THIS is a medical problem, not a psychiatric issue unless proven otherwise. He needs to have THIS evaluated NOW. Perhaps a good Primary Care doctor can do a total evaluation of the other aches and pains to make sure they are not a medical problem. And this same doctor could refer him to a GI Specialist for the vomiting and to a Mental Health Specialist for the mood issue. Occasionally we see physical issues causing depression but the vomiting and the mood APPEAR to be separate issues. I hope this has been helpful. Best wishes, Dr.Kim","author":"Dr. Kim Crawford","replyTo":"post1844048","postID":"post1866565","date":"20150722-00:00:00 -0400","authorID":"http://ehealthforum.com/health/user_profile_728017.html"}],"URL":"http://ehealthforum.com/health/depression-nausea-not-at-all-interested-in-any-activity-t448835.html"}