{"title":"You can get over it and learn to love yourself","thread":[{"content":"I was depressed in the period of 07-13 and with good help and understanding people I have gotten over it. I had psychotherapy back in 2010 and that helped me but did'nt solve my problems, still I had the courage to apply to business administration in a polytechnic university. That went well for two years and then I broke up my relationship because I wasn't happy anymore, that threw me in a bottomless void and I was ready to kill myself. I had considered the possible outcomes of my actions and called 911, I got help! The next day I was evaluated and got medication''Cipralex/Mirtazapin'' and ofcourse schedule for psychotherapy. It went on for a year and struggled with school, only attending courses/lessons I could manage. I started to oilpaint, listen to more soothing classical music and write poems, sometimes I would just write random things about my feelings and emotions, It helped a lot. In time I would burst into tears because I felt such a relief, colours began creeping into my life, so intensely I could swear I had been colorblind all my life. The feeling of happiness and pure joy also began to emerge from everything I did! Now I'm In my fourth year and everything is going better that I had ever hoped! I love myself and life although sometimes life is hard, but now I can appreciate that feeling too. If I would have to name one of the most important thing that got me trough my hardship, it has to be a book called: The four agreements. PS. I wish all the well, love and stamina from the bottom of my heart to those who struggle with depression, learn to have hope and faith in yourself.","author":"MrEB","postID":"post1840493","date":"20150117-00:00:00 -0500","authorID":"http://ehealthforum.com/health/user_profile_713841.html"},{"content":"Good for you. I also love that same book. Best wishes, Dr.Kim","author":"Dr. Kim Crawford","replyTo":"post1840493","postID":"post1866572","date":"20150722-00:00:00 -0400","authorID":"http://ehealthforum.com/health/user_profile_728017.html"}],"URL":"http://ehealthforum.com/health/you-can-get-over-it-and-learn-to-love-yourself-t447503.html"}