{"title":"Excitement problems (no real happiness?)","thread":[{"content":"Hi, Let me start off by saying I am a very happy and a social person. I love meeting new friends, exploring life, traveling, communicating etc etc. I moved to a foreign country about 2 years ago and everything has been fine. With ups and downs but still. About 3 years ago I started having these.. excitement problems? I can say I love to do this or that but in reality.. I don't really FEEL those feelings for anything. I can be watching my favourite tv show, meet friends, eat the best food etc etc and I just feel nothing. I miss oh so much to feel that movement , that small ache in your heart(like when you go on roller coaster). Everything is just like \"acknowledged\"?? not felt. Im not amused at all. It's very weird honestly cause these past 2 years iv'e been constantly having these crazy opportunities of seeing the world, do my hobby and earn living with it, meet people I used to admire, yet while doing all this...It's just normal.... But even though already before that, I just don't feel it.. I went to visit my family and friends in my home country over half a year for the first time, feelings were 0. I recently had a very bad nervous breakdown . I used to have them in the past, but this one was the first one over a long time. Just to put it out there I am in a very loving relationship, I have amazingly supportive friends, family has some of it's problems(but show me a family that comes with no problems). Also, I analyze a lot about life and everything that happens in the world a lot. I am very good in psychology(funny how I can't diagnose myself). I have a very clear view on everything surrounding me. I was just hoping that is something that will pass after a while, but now I am getting slightly worried. I can't really connect it with anxiety or depression cause it doesn't really match up. I am a 23 year old female. Please don't let my age be a factor in this. Iv'e heard a lot of the \"You are still young and will grow out of it\". Ive read a lot about this topic but still can't find an answer. Also, cause I am in a foreign country , seeking for help in that is very complicated. Hope that anyone has any ideas about this topic","author":"wsid","postID":"post1867906","date":"20150730-00:00:00 -0400","authorID":"http://ehealthforum.com/health/user_profile_729037.html"},{"content":"Maybe you really miss adventure in your home country and are not really happy living where you are.......make a list of your likes & dislikes..........write them on separate sheets.......then beside each one write which country you like that in.........check out how many likes to dislikes.......this might take you a while to do............it should be very interesting.","author":"mcilvaine","replyTo":"post1867906","postID":"post1867913","date":"20150730-00:00:00 -0400","authorID":"http://ehealthforum.com/health/user_profile_724875.html"}],"URL":"http://ehealthforum.com/health/excitement-problems-no-real-happiness-t457608.html"}