{"title":"Friendship suffered due to depression","thread":[{"content":"Ive been battling with depression and anxiety (diagnosed Dec2014, but my family claim ive been this way longer). My behaviour has obviously taken a negative turn, and I've been trying to sort myself out. Im 26 and didn't want to need antidepressants to get through my day to day life, so I've left a stressful job for a much calmer one, dropped negative hobbies for more active and refreshing ones, and quit facebook as I find this too easy an outlet (started a journal instead). My family and partner have noticed the difference, and I'm happier. However I'm still reeling over the affect my behaviour had on a very close friendship. My partner and I were mutual friends with another couple- I got on with the girl he got on with the guy respectively, and we all spent time together as a group and in pairs. We have a lot of shared interests. A month or so ago I became very self destructive; I was paranoid everyone hated me, couldn't do anything right, I was in the way and worthless etc etc. This girl, who I felt as close as family to, became fed up of my attitude. Rather than talking to me about it, she said she didn't want my drama in her life. Apparently I had snapped at her in public one day (I didn't realise), and that was the last straw. Being in an emotional state after this text message, I lashed out quite publicly. I wasn't abusive or calling names, but my selfpity monologue incriminated her in the eyes of mutual friends. At the time I obviously did not see this- all I registered was the pain, heartbreak, betrayal of my friend cutting me out instead of sticking by me. She refuses to speak to me now. Her partner told my partner they had always had problems with me (which my partner does not understand as he claims prior to the last 8 months I have always been my usual lovely self). The guy told my partner that they'd still like to spend time with him, doing the things we used to do as a group of 4 (walks,zoo, holidays) but I would no longer be welcome. My partner obviously said this was ridiculous and they have not spoken since. It hurts that my behaviour has hurt his friendship too. But mostly in gutted that they/she dropped me so easily. My reaction was terrible and I doubt i can ever take that back. But what gets me is I am, and she always claimed to be, the kind of friend that forgives anything, supports and listens and would be the first one there with a cuppa and a kind word if the shoe's on the other foot. Did I misjudge this friendship? Did they really dislike me all those years, fake our friendship, or are they just saying that now to save face and hit me where it hurts? My lifestyle changes over the past month mean im in a better headspace now. But I miss this girl. I always considered her like family. The thought that the relationship is irreparable absolutely kills me. I have told her this, to no response (not that I expected one). And its not simply a case of \"stuff her, let it go\" like family suggest. I'm grieving deeply for this relationship. Any advice as to what I should do?","author":"willowdragon","postID":"post1856009","date":"20150512-00:00:00 -0400","authorID":"http://ehealthforum.com/health/user_profile_134093.html"},{"content":"I believe that you are obsessing about the importance of this relationship you are mourning. I am not discounting your pain but am suggesting that perhaps it is not or was not what you thought. A good Therapist would be my suggestion. Best wishes, Dr.Kim","author":"Dr. Kim Crawford","replyTo":"post1856009","postID":"post1868629","date":"20150802-00:00:00 -0400","authorID":"http://ehealthforum.com/health/user_profile_728017.html"}],"URL":"http://ehealthforum.com/health/friendship-suffered-due-to-depression-t453522.html"}