{"title":"don't think i have the right to be depressed...","thread":[{"content":"Hi im 14. my dad has mild ocd, which makes it really hard to meet his expectations so i constantly feel like a failure. And i cant really trust people because i always suspect their motives behind each action. I feel like im being used and am always the \"backup friend\".....as i was treated like that in the past. I'm always taken advantage of because of my \"niceness\". Im so tired of being treated like s**t. The stress to get good grades is really overwhelming because i don't want to be a disappointment to my parents, teachers and myself. My parents always argue with my brother and hit him and sometimes force him out of the house (hes 9). My parents fight too....i dunno....but im really scared of the violence and the possibility that i might be next to end up like my brother. I struggle with body image issues too. I feel so lonely..I can't really deal with people. and its like there's a hollow feeling inside, like im empty and numb. I get frustrated easily and I always hate the world and hate my life. I remember hinting my negative feelings to my parents and my dad said \"have I not raised you well enough?? I've given you everything you could've asked for. You are not starving on the streets or homeless, there are tons of people worse than you. how dare you say you feel like this\" it hit me really hard. i know that there are many people who have it worse, i don't think i have the right to be depressed. so when i feel low i feel guilty. I self harm to cope with my emotions, making me feel more guilty and ashamed afterwards. I never told this fully to anyone as I don't want to become a burden and im afraid to be vulnerable. Im afraid that people will judge and change their perceptions of me. so yeah....vent over (sorry for the long post)","author":"dark_rose","postID":"post1804328","date":"20140505-00:00:00 -0400","authorID":"http://ehealthforum.com/health/user_profile_691676.html"},{"content":"So sorry you are having such issues. Sounds to me like you need someone to \"talk to\" about this stuff. And please disregard dad's opinion-he is abusive (or so it sounds to me).... Guidance Councillor? Favorite teacher? Religious institution person? Health department counseling if nothing else? And of course,good friends who \"don't tell \" are priceless...... Actually your dad IS abusive so I'll say it...so don't devalue yourself and don't give up but find people to talk to and vent to PLEASE! Best, Dr.Kim","author":"Dr. Kim Crawford","replyTo":"post1804328","postID":"post1868634","date":"20150802-00:00:00 -0400","authorID":"http://ehealthforum.com/health/user_profile_728017.html"}],"URL":"http://ehealthforum.com/health/don-t-think-i-have-the-right-to-be-depressed-t433037.html"}