{"title":"dr says chemical imbalance. is lexapro 10mg useful?","thread":[{"content":"i think negative all the time . i am not happy in my life. i have anxiety or OCD for hiv/aids. always think if i do like that may be i get hiv. i talk to ,my doctor he says there is chemical imbalance in your brain .. he suggest me to take lexapro 10mg. before he gave me cymbalta. cymbalta did not work properly . now he give me lexapro10mg. i have too much depression like always think negative always scare from disease not happy. so i wanna ask if i take lexapro 10mg then how much it usefull for me. can i will fully recover from my problem. lexapro 10 mg is good for my condition. please help me i wanna recover 100% i wanna live normal life like you guys..","author":"DoctorQuestion","postID":"post1867510","date":"20150728-00:00:00 -0400","authorID":"http://ehealthforum.com/health/user_profile_55473.html"},{"content":"Welcome to e health forum. From the description it seems that you may have a anxiety disorder and or depression probably due to being lonely, which is probably resulting in a low mood. Medications can help improve your symptoms, but you need to use them for long term duration and not stop them unless advised by your doctor. In addition, you will need to de-stress and find ways to relax when ever you can. This you can do by various means, like listening to music, spending time with friends and family, learning a new art like music, reading books, being active in sports or at the gym, etc. Other methods by which you can find relaxation and calm is by meditation and doing breathing exercises. Regular physical exercise, good nutrition and stress management techniques will give you a basic foundation to build a new positive outlook. Have a positive attitude and develop a confidence in yourself that you have a important place in the world. You may consult a psychiatrist or a counselor, who can take a complete history and with proper counselling and behavior therapy can help you start enjoying life.","author":"Deepak Anvekar","replyTo":"post1867510","postID":"post1867533","date":"20150728-00:00:00 -0400","authorID":"http://ehealthforum.com/health/user_profile_322742.html"}],"URL":"http://ehealthforum.com/health/dr-says-chemical-imbalance-is-lexapro-mg-useful-t457489.html"}