{"title":"I feel so damn lonely...and I'm seriously dredding school","thread":[{"content":"Hi there! Right now, I'm a senior in high school and I've been feeling so lonely. I feel like a lot of people dislike me and that nobody really wants to be around me. I really dont know where to turn to anymore, so please read this and help me out. But first, let me start from the beginning so you understand my background. Starting 6(?) Years ago, I was diagnosed with Generalized Anxiety Disorder. I've always struggled with this and it's something that I don't really like bringing up to people (unless I really, really have to). I know a lot of people from school who are open about their anxiety but for some reason, its something that I can't talk about at all. I was on medication for a few years but I decided to get off of it, in fear I would get addicted to it (I took Lexapro, Xanax, and another one I don't remember the name of). So instead of taking medication like that, I went on birthcontrol to control my hormones (and the bad cramps I had), which is supposidly causing my anxiety and depression. Since starting birth control in the 8th grade, I seemed to have almost completely gotten rid of my anxiety and depression. Sure I would get anxious here and there, but I wasn't as nearly as bad as before. I think everything started going downhill 2 years ago when I started going out with my first (and only) boyfriend. Everything in our relationship was going well up until I met his mom (who disliked me A LOT because I'm Irish-Catholic). 2 months in, she tried to make him break up with me, but we kept seeing eachother. We eventually got into an on and off relationship 4 months in. He was always the one to break up and leave me, then come back. About a year into our relationship, he started acting really nasty towards me. He started telling me things like \"guys won't like you if you don't gain some weight\" or \"no guy wants a girl with B cups\". Then, he would tell me to stop working out everyday and he started accusing me of cheating. Not surprisingly, I was very hurt by this. To think the person I loved thought those things about me just killed me inside. To sum it up, he left me for 2 girls 2 seperate times. I officially ended this abusive relationship back in the beginning of June. Since the breakup, I felt way happier about myself and my life. I felt free for the first time in years and so much happier. I've met many different guys, and I even hooked up with one over the summer. One of the guys I met (whose in the Marines) and I still talk, so that's good I guess. In a nutshell, my summer was awesome. I hung out with my friends all summer and I felt like myself. Now that school started, I don't feel that way anymore. I feel so lonely now and I'm seriously dredding coming to school. I don't see my friends as much anymore and I feel like my peers dislike me. Even some of my \"friends\" started ignoring me during school and they would only talk to me outside of it. Every time I walk around campus or if I sit in class, I pretty much have all eyes on me. Most of the girls in my classes either give me nasty looks or eye roll me all the time. I have no idea why. I'm a pretty quiet girl at school and I mind my own buiness. I'm also not very popular either. I basically just do my own thing when I'm at school and at home. Also, I highly doubt that there's bad rumours about me going around. Nobody knows me or talks to me!! But seriously, It sucks that a lot of the girls at school don't like me or accept me. I feel kind of sad that I have more guy friends than girl friends. Even though I'm pretty open with my guy friends and I like them, it would be nice to have other friends who are girls as well. I honestly think that I could relate to girls on a more personal level and relate more. Plus, my guy friends could be creepy towards me, which is uncomfortable for me too haha Anyways, Im just so lonely now. I don't know where to turn to anymore and I can't just transfer schools either. And the last thing I want to do is go to my school counselor because she gives me attitude when I go for help. Can somebody please help me out? I'm running out of options. Thank you","author":"KHart02","postID":"post1870352","date":"20150813-00:00:00 -0400","authorID":"http://ehealthforum.com/health/user_profile_730070.html"}],"URL":"http://ehealthforum.com/health/i-feel-so-damn-lonely-and-i-m-seriously-dredding-school-t458311.html"}