{"title":"Just Upset ... Giving Up.. Stress..","thread":[{"content":"I guess I'm just gonna write this long \"story\" about how I hate my life and wish I wasn't even here. I'm a teenager, I was bullied at school when I was 8, up until 10 when my parents took me out of school, and I've been homeschooled for near enough 5 years. I haven't got any friends, due to me being scared and nervous around people, I just feel awkward and shy whenever I'm around new people, so its hard for me to make friends. I've self-harmed through out the years of being home-schooled, due to me also getting bullied online it hasn't exactly helped me. I've cried myself to sleep most nights, and had suicidal thoughts, but never actually attempted. I've never been to the doctors for this, my Mum knows I self-harm, (I haven't did it in 2 weeks now) My Mum said if she catches me doing it again, she'll tell my Dad and I'll end up going to hospital. I've stopped self-harming as much as I used too, but yet I just feel so un-happy with everything, from the day I got bullied at school, I've had threats made to me online on Facebook, I once sent a nude photo, and the guy spread it everywhere (I was young) and this Social Worker was involved, and my parents found out because they came to our home. I don't use Facebook anymore, I mainly play on virtual worlds, yet cyberbullying continues. I do go out in real life, I go out with my Parents, I go shopping, to the park, etc, but I just feel so un-happy with everything that's going on. I've stoped eating as much because whenever I try eating, it just hurts like hell, my stomach hurts, and the food gets stuck in my throat, I've been waking up during the night with nightmares, and end up having panic attacks. I used to be able to eat tons of food, no questions asked, but now for about 4-5 months I've stopped eating, I don't eat breakfast, I'm not on a diet, but I just don't feel like eating, and whenever I do eat, I end up feeling so sick afterwards... stress in my family isn't helping, my parents do love each other, but they argue now and then, (which most families do) but it just upsets me. My Brother suffers with depression, panic attacks, and blury vision, both my Parents, Mum and Dad have depression, and my Mum has a bad liver, and my Sister has a eating disorder. Mum has tried attempting to kill herself many times due to the stress in our family. Everything over the past years from the day of getting bullied at school, everything has just been complete hell, I feel no purpose of eating because it just causes arguments in my family when I don't eat, they just think I'm on some stupid diet, but I'm not. I don't want to tell my family that I want to get tested for depression (I know for certain I am) If I ask, they'll probably get upset, and they have enough stress already, and I don't want to add to the pile. I've cried myself to sleep again last night, mainly every night. Sorry I wont go on anymore.. I just don't know what to do anymore. I feel so upset with everything Help.","author":"Sparklez445","postID":"post1863928","date":"20150706-00:00:00 -0400","authorID":"http://ehealthforum.com/health/user_profile_727128.html"},{"content":"And your name isnt Sparklez, is it! I'd have said many homeschooled kids are quite blessed, having something unique from those in usual classmrooms. However, you say it isnt so in your case and i'm sorry. I wish there was more one from far away could do for you, but just here, a hope and prayer that the stressors would one by one be gone and replaced by more joyful events as you seek. Seek and with all your heart, and lean not on your own understanding. (from Proverbs 3) To start with, read psalms and proverbs, wc tell how generations of people have lived with successes and blessings and overcome hurdles here and there, like people now do. The practical advice from proverbs should be very helpful esp. for the young. Keep at it, esp. that PRov. 3 5-7 verses.","author":"samm00","replyTo":"post1863928","postID":"post1864206","date":"20150708-00:00:00 -0400","authorID":"http://ehealthforum.com/health/user_profile_707378.html"},{"content":"thanks for sharing this information.","author":"ananya34","replyTo":"post1863928","postID":"post1864379","date":"20150709-00:00:00 -0400","authorID":"http://ehealthforum.com/health/user_profile_727194.html"}],"URL":"http://ehealthforum.com/health/just-upset-giving-up-stress-t456350.html"}