{"title":"Just..sad.","thread":[{"content":"Um..Hi, I'm new to this site, but I really needed someone to listen. So I guess I'll just get right to it. I'm depressed. Have been since I was about 14. But it wasn't so apparent til my Senior year of high school. I'm 20 now, with two suicide attempts over my head that no one knows about, and cuts over my arms and thighs that people have either ignored or simply haven't seen. You see recently my mother was diagnosed with stage 4 bone cancer. The doctors say it's incurable and she will live with it for the rest of her life. She can't work, and her spine has so many fractures in it, she's constantly on pain killers. And my father has been retired from work for a couple of years now, with apparently no intentions to return. So my little sister and I have gotten jobs to help keep the house and pay the bills. She's 19. Anyway I'm the only with a full-time job right now as my sister only works part-time. But the stress this is causing us, has been horrendous to deal with. I can even see that my parents share no real love for each other anymore, and I'm afraid they'll get separated. I'm trying to stay strong, but when you feel so powerless, so unheard in your own home, I mean how can you hold onto hope when you don't have anything to grab? Forgive me if my thoughts wander but I can't help it when I start to ramble. I just feel very pushed off to the side. Swept under the rug like some kind of trash. No one at home really understands me, but then again I guess I don't really understand me either. I just feel lost, sad, and misunderstood. I want to be a writer, but I've never really had someone believe in me, or given me a boost in the right direction. They've just kind of half heartily given me thumbs up and said 'oh yeah you're really good' but showed no further support. So I stopped showing them. I just hate feeling so worthless. I have more to say but not sure how to get it out, so for now I leave with this. Thanks for listening.","author":"Wolfcharmer","postID":"post1862201","date":"20150626-00:00:00 -0400","authorID":"http://ehealthforum.com/health/user_profile_726369.html"},{"content":"Start writing about your life and what is going on from when you can remember until now. It will help you and will produce a book for us to read.","author":"mcilvaine","replyTo":"post1862201","postID":"post1862273","date":"20150627-00:00:00 -0400","authorID":"http://ehealthforum.com/health/user_profile_724875.html"},{"content":"Hey wolfcharmer, I am so sorry that you are going through this. I can only imagine the pain that you are dealing with. Your not alone, I'm 22 and I have been depressed since I was 13, and it wasn't too long ago that I ended up in the ER because of suicidal threats. Life can be difficult when you have no one to talk to, so coming here on this forum was the right choice. It's messed up how your dad has got you and your sister working, and he also plans on leaving your mom. That's not love, its pretty funny how when you always need someone the most, they always are never there. Dealing with depression sucks really bad. Your lost, confused, anxious, hopeless, and just feel like your better off dead. I mean your so young, you have no idea what life will be like in the next couple of months, maybe it might've gotten better. But you never will know if you attempt to end your life. Life is a gift, and pain is only temporary. You only have one life to live, so why not experience it in all it's glory? Do you believe in God? I feel like all the credit should be given to him for coming this far in my life. You need something to believe in, something to look forward to, and for me God was the answer. I will pray for you, and remember, never act upon these feelings. suicide is a permanent solution to a temporary problem. God bless.","author":"Zandy12","replyTo":"post1862201","postID":"post1870189","date":"20150812-00:00:00 -0400","authorID":"http://ehealthforum.com/health/user_profile_729982.html"}],"URL":"http://ehealthforum.com/health/just-sad-t455808.html"}