{"title":"Lonely and depressed. i really dont think i can handle this","thread":[{"content":"I just feel so so so low, I am trying not to cry I am trying not to go crazy , i am trying so hard.. but i really dont think i can handle this on my own now . I 23 yrs old girl, i have no friends, am an indian living with parents and home based online work. I just broke up with my bf cuz the relationship was getting very stressful and we didnt seem to connect at all. He loved me a lot, i loved him too, but we had nothing in common. in our 13 month relationship we had been fighting for 10 months ! He was too distracted and irresponsible to have a sensible communitaion with me. we had hardly talked for more than a few hours since last 3 months. even then we would mostly just fight. This is not my first break up btw, and i dont think this is the main reason for my anxienty. i have just not had any close friends since almost last one year. There are days when i go without uttering barely a few words the whole day. when someone approaches me for friendship, i want to take it up, but somehow i find myself shying away from building bonds eventually . that leaves me alone. now all i wanna do is bounce back and stop feeling so lonely. I want to be happy and i want to feel hopeful. But how can i when i have no friends? and i am too tired of being betryaed and cheated by ppl to start feeling like i can trust easily again. Ppl dont seem to like me much anyway. Most of the times people just tend to begin dislinking me after a while, or its me who doesnt like them. I know i am sounding like i am very fussy, but my childhood friend turned into a big liar and used me for years before i cut it off with her. A cousin of mine who was my best friend , she started insulting me a lot - way too much and then lots of people advised me to move away for the sake of protecting my own dignity. My relatipnship with my parents is very stressed too, since they scold me and hit me at times. and yes i am 23 ! i cant move out since this is india, i am quite dependent on them at the momeny and financially i cant possible do that. i hardly talk to my bro since he is a teenager and things i am a freak who has no friends and sits at home all day long. i am almost tempted to go back to my ex cuz i am suddenly even more lonely now that i dont even have him. But i know it will never work out fine with him. help me ! I am going crazy especailly with no one to talk to.","author":"morningsunshine","postID":"post1590527","date":"20120708-00:00:00 -0400","authorID":"http://ehealthforum.com/health/user_profile_525824.html"},{"content":"I feel sorry for you. I felt the same as you, except that my parents don't hit me. I can relate to your feeling with your bf, your shyness, your loneliness, your feeling that people dont like you, your fear of betrayal. \"I am 23 and I'm supposed to be a happy people, so that people will love me.\" I always feel like that. I cope with it by praying 5times daily, and telling God whenever I feel stressed. And thank God, I did feel better, although I'm still thinking negatively etc. But I feel better than before I prayed. I guess we need to know more about God and nurture belief in Him, as He never ever betrays us. It's just our lack of knowledge that we don't understand what He's plotting for us. How do you feel now?","author":"thinkingstyles","replyTo":"post1590527","postID":"post1593652","date":"20120713-00:00:00 -0400","authorID":"http://ehealthforum.com/health/user_profile_527836.html"},{"content":"i agree wid you ..my story also relates with you both but m elder than you.m 27 thst only the difference..rest all is same..m feeling like hell right now","author":"angelji","replyTo":"post1590527","postID":"post1866381","date":"20150721-00:00:00 -0400","authorID":"http://ehealthforum.com/health/user_profile_728349.html"},{"content":"Why, i was passing this by on YA and u might find it, for it has links u may find helpful too. -- more and more people needed for making true, good and beautiful ripples in eternity, something all can do, start with the small things you can do and it will grow endlessly; and stay at home reading wise books on Friday and Saturday nights... Ask God for guidance and inner strength all of the way (that's the secret to never collapsing). (deleted link).. Help where you can if they are willing to receive, but remember that you cannot help where it is not wanted and forced help is very dangerous for you. Never join their fights, avoid large crowds of the ignorant and uncouth. Shun profanity, those with impure mouths will pass away in disgrace soon enough.","author":"samm00","replyTo":"post1590527","postID":"post1867251","date":"20150726-00:00:00 -0400","authorID":"http://ehealthforum.com/health/user_profile_707378.html"}],"URL":"http://ehealthforum.com/health/lonely-and-depressed-i-really-dont-think-i-can-handle-this-t355492.html"}