{"title":"I feel like this will never end","thread":[{"content":"I feel like i am loosing rhe struggle. Everyday feels like a battle, like i am raging a war against the thoughts in my head. Im so tired and my fight is becoming weaker and weaker. I am pregnant woth baby number 4. I wanted this baby and fought for it almost to the point of destroying my relationship. This baby was ment to be the thing that finally made me happy, but my happy never comes. At times i am content but i could never say i have been truly happy. I wanted to enjoy this pregnancy, and although physically i feel the best i have during any of my pregnancy's my depression is robbing me of being able to enjoy this pregnancy. Instead of joy and excitement those feeling are replaced with fear and anger , frustration and confusion. In the past during my pregnancy's my depression has always been present, but this time roundit is a constant battle. My rhoughts of self harm have always been halted by the fact that i have a life that is not mine to take inside me, but this time rhis is not the case. \"Maybe this one i can keep with me\" is the thought that now goes through my head. I feel selfish and weak, i want to make it stop, to get back to me. My kids are suffering, i have no patience for them. I snap at them, they hurt themselves and cry and their cries irritant and annoy me. Everyday is a struggle and i feel this is never going to end.","author":"babybump4","postID":"post1870488","date":"20150815-00:00:00 -0400","authorID":"http://ehealthforum.com/health/user_profile_730186.html"},{"content":"Hi babybump4, I understand how you are feeling. I don't think you are weak and selfish. Depression never means that you are weak, sometimes it's something that we just can't control. I'm pretty sure you love your kids a lot, but you are too clouded from your depression which is making you think a bunch of persistent negative thoughts. Depression is the worst, it seems like everything is hitting you at your weakest point, I freakin hate it. Sometimes I get so depressed all I think of is that I am better off dead, even though that isn't true. You are not alone in this, and even though you feel like it isn't going to end, it will. Have you ever thought about getting help? You should try counseling or taking medication, it will help you out tons. Taking natural herbs, exercising, and meditating help out as well. My prayers are with you.","author":"Zandy12","replyTo":"post1870488","postID":"post1870562","date":"20150815-00:00:00 -0400","authorID":"http://ehealthforum.com/health/user_profile_729982.html"},{"content":"Have you told your doc at least? Pregnancy is a double blessing, that is sometimes 'heavy.' Explore how u can look forward to a mroe comfortable pregnancy physically, mentally and spiritually, and consider natural childbirth too? It may give u less stress abt the coming birth.","author":"samm00","replyTo":"post1870488","postID":"post1871204","date":"20150820-00:00:00 -0400","authorID":"http://ehealthforum.com/health/user_profile_707378.html"}],"URL":"http://ehealthforum.com/health/i-feel-like-this-will-never-end-t458377.html"}