{"title":"BPD and Emotion Regulation","thread":[{"content":"Hello everyone, I just turned 18. I've been diagnosed with a disorder called BPD aka Borderline Personality Disorder. It's a very serious personality disorder. And it messes with how I feel emotions. But it mostly reflects on Anger/Rage and I can't physically or mentally control it. But; I've just realized way more I feel like. It just almost feels like, my body, isn't connected with my emotions in a way. Or it's involuntary in a way. And throughout that it's also really complex because humans are hard wired with their emotions to body movements and yet I feel like I wasn't so I have to find those body movements that click with emotions in a matching game. And throughout that sometimes I can't find the clicks so I have no idea how to control or explain what I am feeling... I feel like I feel deeper than most but all at the same time I don't feel at all. Because what am I feeling? But then again what am I not feeling? I could tell you every single emotion their is on the face of this earth. Although I cannot match the name to the emotion as we'll. Making it so I must go through all those names, and all those symptoms, and all those signs, and choose which it is. Then make that emotion onto a deeper level so I can distinguish it easier the next time I am looking for it. But sometimes that's impossible and I simply couldn't tell you or understand how I'm feeling or what I'm feeling. Or if I'm doing something why I'm doing it. I just feel so lost, and so mind messed up it's ridiculous...like I'm a robot almost. I just feel like I need answers that help me. I can't tell you how many therapists I've gone too, including anger management, mood therapy where they hold up pictures of people's faces and if they have a sad face then that's sad, or they try and show me what I feel. Just help, someone.","author":"Dex3434","postID":"post1866188","date":"20150720-00:00:00 -0400","authorID":"http://ehealthforum.com/health/user_profile_728253.html"}],"URL":"http://ehealthforum.com/health/bpd-and-emotion-regulation-t457071.html"}