{"title":"Depression doesn't necessarily require anti-depressants","thread":[{"content":"Hi there! I am reading lots of posts and figure that I can be more help if I just do a post. Many people here sound depressed and yes, anger can=depression and yes I understand those who do not want to take anti-depressants. From what I see there is too much needless suffering out there. You can treat mild to moderate depression with natural precursors to the happy brain chemicals that are down in depression. This is VERY individualized so please don't try this without help,but here is a synopsis: Seratonin:Often down,often a/w eating disorders, constipation and sleep issues Dopamine: Also often down, a/w addictions, eating disorders and anger issues sometimes Norepinephrine: Also often down. BIG CAUTION: IF YOU are ON most anti-depressants and you google seratonin replacement supplements and take something you can cause a life threatening issue. There are many good A4M board certified M.D.'s who can do this also.You can get exact measurements of these brain chemicals in 25 hour urine tests if needed as well. I want everyone to know that there is help out there and it's much better than drugs. I know someone who came in to the program on 2 anti-depressants and Concerta and slowly transitioned her to natural replacements and she feels great for the first time in her life. I have heard that anti-depressants \"numb them out\" and they feel better than ever! Music to my ears! Here's to everyone's health and happiness! Best wishes to all, Kim","author":"agewellsolutions","postID":"post1858840","date":"20150601-00:00:00 -0400","authorID":"http://ehealthforum.com/health/user_profile_724169.html"},{"content":"Thanks and good to read.","author":"samm00","replyTo":"post1858840","postID":"post1858904","date":"20150602-00:00:00 -0400","authorID":"http://ehealthforum.com/health/user_profile_707378.html"},{"content":"I am new to this forum so perhaps am not seeing the reply to the post I did above. I clicked on the link which told me there was some sort of reply to this. I am not allowed to state my credentials per the admins but will be as helpful as possible without breaking the rules. If someone has a question about what I posted I am sorry but I'm not seeing it so would you kindly re-post? Best wishes,Kim Crawford","author":"agewellsolutions","replyTo":"post1858840","postID":"post1858916","date":"20150602-00:00:00 -0400","authorID":"http://ehealthforum.com/health/user_profile_724169.html"},{"content":"I was just thanking you for the post.","author":"samm00","replyTo":"post1858840","postID":"post1859333","date":"20150606-00:00:00 -0400","authorID":"http://ehealthforum.com/health/user_profile_707378.html"},{"content":"Oh sorry! LOL I am THAT new. I am not allowed until approved by admins to say what I do for a living but I believe my website link is on my profile and I can be contacted for more info if you need it Samoo.","author":"agewellsolutions","replyTo":"post1859333","postID":"post1859381","date":"20150606-00:00:00 -0400","authorID":"http://ehealthforum.com/health/user_profile_724169.html"},{"content":"Nice and helpful post.","author":"LaraHabig","replyTo":"post1858840","postID":"post1864948","date":"20150713-00:00:00 -0400","authorID":"http://ehealthforum.com/health/user_profile_727651.html"}],"URL":"http://ehealthforum.com/health/depression-doesn-t-necessarily-require-anti-depressants-t454608.html"}