{"title":"I am so depressed because im getting rejected all the time.","thread":[{"content":"I am in so much pain right now. No girl wants me. I feel like im such a loser. I get rejected all the time by girls. I am so alone. They say I like you as a friend. It's like a shot in the heart. I must be ugly or stupid or something. I had good self esteem before all the rejections and now that im rejected i just don't feel worth anything anymore. girls go for the mean tough guys and guys with good hearts and quiet they ignore. I don't know what to do.","author":"softman","postID":"post1418156","date":"20110821-00:00:00 -0400","authorID":"http://ehealthforum.com/health/user_profile_404019.html"},{"content":"can someone please help me?","author":"softman","replyTo":"post1418156","postID":"post1418157","date":"20110821-00:00:00 -0400","authorID":"http://ehealthforum.com/health/user_profile_404019.html"},{"content":"just because you're rejected doesn't mean that you're ugly or stupid,because I'm sure you're not.I'm a girl but I kinda have the same problem.I get rejected also but I just remember that later on in life,the person who rejected you will want you.My mom told me that.Just make sure you don't hurt yourself over it.I scratch myself over this issue so much,I make myself bleed and sometimes I bleed so much that I'm a few drops of blood from passing out but at the last second I stop.I don't want it to happen to anyone else.I just did it 2 minutes ago.Just remember that they will like you later on in life but when they ask you,you reject them.I hope this helped you!","author":"lenisawesome","replyTo":"post1418157","postID":"post1440350","date":"20111006-00:00:00 -0400","authorID":"http://ehealthforum.com/health/user_profile_419853.html"},{"content":"I already know what a lovely women you are,i understand your pain.I don't have a single friend since my best friend drowned infront of me when we were 16,i was unable to save him,even after 2 years still haunts me the same way.I loved a girl from past 3 years but she left me for a jerk.My father abuses me.I used to scratch myself too,but it is pointless.All this rejections,pain,loneliness is what makes me strong thats all i know.Focus on your career,look your best,be your best.Stop scratching yourself,take care of yourself you are all you have.I would really like to meet you,to get you off your depression.Be patient there are guys like me who would love you for who you are,as a fellow human i do really care for you.","author":"Sidv","replyTo":"post1440350","postID":"post1852755","date":"20150415-00:00:00 -0400","authorID":"http://ehealthforum.com/health/user_profile_720852.html"},{"content":"Getting rejected does not mean that you are not worth it. You need to see it as an experience in life that everyone has to go through. Not everyone in this world gets the girl or boy they wanted. You are not a loser, you are just experimenting the world of caughting! You have heard of an expression if all fails 'try, try again'. Anyway, not having a girl in your life is not the end of all, perhaps try finding something else to do to take your mind off a bit from finding a girl. You may end up enjoying singledom for a bit and suddenly love may hit you out of nowhere. Softman, you say you had good sef esteem before- Then you need to love yourself first and love will eventually come to you. You are worth it, live your life and make the most of it!","author":"Londoner118","replyTo":"post1418156","postID":"post1421310","date":"20110827-00:00:00 -0400","authorID":"http://ehealthforum.com/health/user_profile_406088.html"},{"content":"Are you a girl? Can we talk some more? I don't want to live my life alone and die alone. I want to live. But it is better to die in peace knowing that a girl actually cares about me and loves me than to live my life alone and no girl care about me.","author":"softman","replyTo":"post1421310","postID":"post1422145","date":"20110829-00:00:00 -0400","authorID":"http://ehealthforum.com/health/user_profile_404019.html"},{"content":"Hi softman and welcome to ehealth: The purpose of this forum is to help people with problems and not to try and make friends...All of us have been lonely in our life...This passes when we meet the right person...Hope this helps...Take care... Caroline","author":"CarolineEF","replyTo":"post1418156","postID":"post1422150","date":"20110829-00:00:00 -0400","authorID":"http://ehealthforum.com/health/user_profile_220777.html"},{"content":"What if I never meet the right girl? Is it possible to die from a broken heart? My heart is broken. Im dont want to go but im ready to go. I don't see no purpose for me.","author":"softman","replyTo":"post1422150","postID":"post1422174","date":"20110829-00:00:00 -0400","authorID":"http://ehealthforum.com/health/user_profile_404019.html"},{"content":"Caroline, your comments are superficial and not helpful at all. Please stay away from this thread.","author":"True111","replyTo":"post1422150","postID":"post1699826","date":"20130422-00:00:00 -0400","authorID":"http://ehealthforum.com/health/user_profile_610399.html"},{"content":"softman, you are young...Just enjoy life and the right person will come along...Take care... Caroline","author":"CarolineEF","replyTo":"post1418156","postID":"post1422683","date":"20110830-00:00:00 -0400","authorID":"http://ehealthforum.com/health/user_profile_220777.html"},{"content":"I wish someone could convince me that i am worth something. I have reached the end of my rope. The next step is to fall completely. I am such a failure. I have been told that i am ugly before. i believe them on that. im 19 and have lost all hope.","author":"softman","replyTo":"post1422683","postID":"post1423193","date":"20110901-00:00:00 -0400","authorID":"http://ehealthforum.com/health/user_profile_404019.html"},{"content":"I'll keep trying to enjoy life but it so hard especially when I have nothing going for me and I have to spend the nights alone.","author":"softman","replyTo":"post1418156","postID":"post1423044","date":"20110831-00:00:00 -0400","authorID":"http://ehealthforum.com/health/user_profile_404019.html"},{"content":"I want to die because I am very lonely. I have no reason to live anymore. Im afraid of living because no girl will ever like me. Even if they do I wouldnt know because im so stupid. Also if i did find out i would be afraid to love again because of a girl breaking up with me or cheating on me. But if i die then i die alone. I want to die with a girl caring about me and loving me for who i am not what i look like or how stupid i am.","author":"softman","replyTo":"post1418156","postID":"post1424875","date":"20110904-00:00:00 -0400","authorID":"http://ehealthforum.com/health/user_profile_404019.html"},{"content":"just because you're rejected doesn't mean that you're ugly or stupid,because I'm sure you're not.I'm a girl but I kinda have the same problem.I get rejected also but I just remember that later on in life,the person who rejected you will want you.My mom told me that.Just make sure you don't hurt yourself over it.I scratch myself over this issue so much,I make myself bleed and sometimes I bleed so much that I'm a few drops of blood from passing out but at the last second I stop.I don't want it to happen to anyone else.I just did it 2 minutes ago.Just remember that they will like you later on in life but when they ask you,you reject them.And please don't say you want to die.I'm sure if I met you,we would be friends! I tell myself that I want to die and I've even tried to cut my arm off,but memories of my friends and good times helped me stop.Please don't hurt yourself.I hope this helped you!","author":"lenisawesome","replyTo":"post1424875","postID":"post1440352","date":"20111006-00:00:00 -0400","authorID":"http://ehealthforum.com/health/user_profile_419853.html"},{"content":"Softman, if you don't mind me asking...how old are you? I'm a female in the same boat and I am just wondering how old you are.","author":"LadybugCurls","replyTo":"post1418156","postID":"post1448692","date":"20111022-00:00:00 -0400","authorID":"http://ehealthforum.com/health/user_profile_426077.html"},{"content":"I am 19 years old.","author":"softman","replyTo":"post1448692","postID":"post1448814","date":"20111022-00:00:00 -0400","authorID":"http://ehealthforum.com/health/user_profile_404019.html"},{"content":"what is the best way to commit suicide?","author":"softman","replyTo":"post1418156","postID":"post1450760","date":"20111026-00:00:00 -0400","authorID":"http://ehealthforum.com/health/user_profile_404019.html"},{"content":"Hey softman let me tell you something. . . I'm 23 AND I DON'T HAVE A GIRLFRIEND EITHER. I've been lonely longer than you've been for sure. I'm ugly and fat And I've been rejected more times than I can bother to remember. Each time is a shot through the heart I admit and u feel like a complete failure because you assume all girls are like that. I've also wanted to kill myself but I keep telling myself that this is not how I want to go. I noe there is more to life than girls and being alone. There just is. I live my ow life and no one tells me how to live it. If u want some advice on how to deal with a time like that talk to me. Trust me more heartache will be caused if u do something like that. I've lost people like that and it just kills me to know that they wanted to end things on such a minor issue. Which is better? Killing yourself never knowing or living thru this time of rain to see the rainbow on the other side??? I. Kow it's not easy. I've been there before. Just talk to me for now","author":"Jsqueek","replyTo":"post1418156","postID":"post1450879","date":"20111027-00:00:00 -0400","authorID":"http://ehealthforum.com/health/user_profile_427867.html"},{"content":"Nobody is worth killing oneself (or others) over, please, there is a lot of worse crap in this world. Don't attach yourself to anyone, enjoy your freedom while you have it...there are so many people in miserable relationships and marriages..do not latch on to the first that comes along. Being rejected all the time is a learning phase....cope with it. Then travel to somewhere else,... Are you blonde? Then go visit Venezuela for example...those women love blonde men cause they're scarce over there...are you black? Then go to sweden....ditto. And your tolerance to rejection has already built some muscle at your homebase, so this will help also. Go visit some prostitutes perhaps, they will help you get over your initial nervousness. Fact of the matter is, most (beautifull) girls do not fall for looks at all, but for blistering CONFIDENCE in a man. There are a lot of freaks out there with a beauty on their arms. You have to come from a mindset of ABUNDANCE (how many million of women are there in the world?) and not focus on a singular object of your desire. The whole concept you create around one single person, people call it \"love\", it is merely a concept/trance that you have created yourself of/around that person, and all in your mind. Get rid of it,take charge, get out tonight and get shot down n-times again until you get immune to it.... Good luck, and peace to you brother!","author":"theraven","title":"Rejection until perfection","replyTo":"post1418156","postID":"post1559310","date":"20120507-00:00:00 -0400","authorID":"http://ehealthforum.com/health/user_profile_505233.html"},{"content":"Heyy softman, i feel the way u do. But in my case its almost everything, i feel i get rejected by everyone on school and home, becaus im quit and they think im boring. I have been let down by my parrents when i was little. But there is hope!.. thats what i try to convince myself..","author":"Heytherepeople","replyTo":"post1418156","postID":"post1669506","date":"20130116-00:00:00 -0500","authorID":"http://ehealthforum.com/health/user_profile_583054.html"},{"content":"I been hurt longer than anybody on this earth so do let ignorance stop u from living i found out after i buried my niece that i was going to die alone and never be in love because of ignorance","author":"kendizzle354","title":"ignorance","replyTo":"post1418156","postID":"post1746932","date":"20130821-00:00:00 -0400","authorID":"http://ehealthforum.com/health/user_profile_647467.html"},{"content":"All i care about is going to heaven forget whatever going on in this life i been waiting for god to call me home me and porchia will be happy together that is all i care bout my niece forget about life porchia is all i care about","author":"kendizzle354","replyTo":"post1746932","postID":"post1746936","date":"20130821-00:00:00 -0400","authorID":"http://ehealthforum.com/health/user_profile_647467.html"},{"content":"Softman, this thread started 2 years ago. Hopefully you're in a much better place now. In case you do check back in, or in case somebody else comes along and reads this thread who is in a similar situation, you have to ease up on yourself a bit! First, you seem to have an interest in whether or not people responding are girls. So, I'll tell you, I am female, but a woman and no longer a girl. Now, that being said, most 19 year olds that I know, male or female, do not have steady boyfriends/girlfriends. Why would you want to? When you are young is the time to see what's out there and not be tied down. Second, you are not a loser just because you don't have a girlfriend. You mentioned not having done much with your life. Nobody has at 19!! That's not even enough time to complete a college degree if you are pursuing one. So, again, cut yourself some slack. Most teenagers have crap jobs, crap cars, bad skin, emotional highs and lows, and little experience with a serious long-term relationship. That's just how it is at that age. We all go through it. You're just starting out. You have so much ahead of you. Don't check out now. That would be like walking out of a movie while the previews are still showing. Finally, things may not be great for you right now, but as long as you desire for more in life and are willing to take the steps needed to get there--you're willing to work at a better life--then you will have one and you are not a loser. Also, the person earlier who commented on confidence was dead on. To us women, guys who come off as totally needy or completely lacking in self confidence are not appealing at all. Think about it. This goes way back to caveman days. Women want a protector and provider. How can you protect a woman and provide for whatever family might come along if you completely lack self-confidence? Think about it. Do you like hanging around people who are sad and putting themselves down all the time? It's awkward and nobody likes it. The old saying that you have to love yourself before anybody else can love you and before you can love anybody else is really quite true because you must believe that you are worthy of love for someone else to believe it too. Good luck to you. It WILL get better. Give it a chance.","author":"JustBrowsin","replyTo":"post1418156","postID":"post1749128","date":"20130829-00:00:00 -0400","authorID":"http://ehealthforum.com/health/user_profile_649325.html"},{"content":"Hey sidv r u der.....? M a gal.... I was depressed bcoz of rejections from my frens n from guys too.... simply bcoz i give them all the time that I have. N I never think of me, myself, my career. Wen I read ur comment I thot I can b fren to u bcz u seem good. M lonely even though surrounded byso many selfish ppl. Plz do reply","author":"prigudhart","replyTo":"post1418156","postID":"post1869458","date":"20150808-00:00:00 -0400","authorID":"http://ehealthforum.com/health/user_profile_729636.html"},{"content":"Hey sidv r u der.....? M a gal.... I was depressed bcoz of rejections from my frens n from guys too.... simply bcoz i give them all the time that I have. N I never think of me, myself, my career. Wen I read ur comment I thot I can b fren to u bcz u seem good. M lonely even though surrounded byso many selfish ppl. Plz do reply","author":"prigudhart","replyTo":"post1418156","postID":"post1869459","date":"20150808-00:00:00 -0400","authorID":"http://ehealthforum.com/health/user_profile_729636.html"}],"URL":"http://ehealthforum.com/health/i-am-so-depressed-because-im-getting-rejected-all-the-time-t299092.html"}