{"title":"energetic on the outside but i feel terrible on the inside.","thread":[{"content":"Im just very tired im always very happy outgoing energetic on the outside but i feel terrible on the inside. I dont know why i feel this way maybe because im single but i feel theres something bigger i cant quite put my finger on it. Im always surrounded by people and im actually very well liked by friend in luding at work my customers love me. But theres and empty feeling inside that i cant shake off and when im alone or anytime i think to myself i feel as empty as if i have lost someone. I dont what it means but this feels bad i feel like im never going to find someone for me, like im not good enough for something better. I get sad to think i could better at this point in life and it saddens me that im not doing the very best in life and love as i would like.","author":"Oscarm16","postID":"post1863560","date":"20150703-00:00:00 -0400","authorID":"http://ehealthforum.com/health/user_profile_726953.html"},{"content":"Welcome to e health forum. It is possible that due to work, family or any other causes, you are highly stressed and anxious. You may also possibly have anxiety or personality disorder or actually you might be depressed. These conditions are caused due to multiple factors, lifestyle and interpersonal issues and detailed psychiatric history is needed so as to provide you manage the underlying condition. To improve your life and have a proper outlook towards life, it is helpful if you seek a guidance from a external person either in your family or your friends. If you do not have such dependable people then consulting a psychologist or a psychiatrist and undergoing proper counselling will be very helpful to making the proper assessment of your issues. Once diagnosed proper treatment will help you find happiness and content. I hope this helps.","author":"Deepak Anvekar","replyTo":"post1863560","postID":"post1863874","date":"20150705-00:00:00 -0400","authorID":"http://ehealthforum.com/health/user_profile_322742.html"}],"URL":"http://ehealthforum.com/health/energetic-on-the-outside-but-i-feel-terrible-on-the-inside-t456238.html"}