{"title":"Life, Mislead, and Angry","thread":[{"content":"How should I start? Maybe with life in general. I feel very small in this whole world of ours. And no one had tried to make me feel any higher. I've done wrong, made mistakes, I mean who hasn't? But should I constantly feel guilty about past things I have done? I want to let go, to just be free. But the thoughts, the voices that led me to my path have turned so sinister, taking such dark turns I never found my way back. They won't let me forget, won't let me find my own path. And if that wasn't enough, my life outside my head has only seemed to have taken wrong turns all around. A friend of mine told me that since I was bad at texting her, and never took the initiate to call her first that I wasn't a real friend, and so we broke off our friendship. It didn't matter that I had been there for her when her ex-BFF deserted her. It didn't matter I was there for her first car accident and many more after that, or that I had been there during her parents divorce, through every fight her and her father had. And apparently it had meant nothing when I supported every dream she ever had. No, it was the texting and not calling that got her. I mean..I don't feel sad about losing that friendship, that's okay right? Unfortunately my parents still love to have her around for whatever reason, and tell me that i should be nicer to her, since she's trying. I mean what bullsh*t! Since she never really heard my side of the argument -as usual- she looks like the damn victim! I like being alone, is that so wrong?","author":"Wolfcharmer","postID":"post1862367","date":"20150627-00:00:00 -0400","authorID":"http://ehealthforum.com/health/user_profile_726369.html"},{"content":"Keep notes and I would go as far back as you can remember and start writing a book.","author":"mcilvaine","replyTo":"post1862367","postID":"post1862759","date":"20150629-00:00:00 -0400","authorID":"http://ehealthforum.com/health/user_profile_724875.html"},{"content":"proverbs 3.5-7.","author":"samm00","replyTo":"post1862367","postID":"post1863671","date":"20150704-00:00:00 -0400","authorID":"http://ehealthforum.com/health/user_profile_707378.html"}],"URL":"http://ehealthforum.com/health/life-mislead-and-angry-t455860.html"}