{"title":"Depressed about getting older and being unsure of an afterlife","thread":[{"content":"I am a 31 years old fairly new college grad. (summer 14) unemployed, still living at home and depressed. Every few years I just think one day my family (parents, and siblings) and myself are going to get old and pass on. I know thats part of life and to a degree I accept that. I am also aware that we are a very blessed and intact family. The thing that depresses me most is that I ask myself \"is this it, do we cease to exist or is there something more? Aside from looking for jobs, I lately, have spent my time googling the afterlife, heaven, what happens when we die, can science prove heaven? The results I get are different religious answers such as we will reunite with family and know God, or we won't know anyone and marriages won't be recognized in heaven (doesn't sounds too heavenly) we will just worship God. And the scientific answers are everything can be proven with mathematics, physics, and chemistry which leaves no room for God. What can I do to get out of this funk? My attitude if you asked me last month was theres probably somewhere we go after death that is completely different than any other description you read and mostly I just didn't think about it. I hope someone can suggest something. ps my goal isn't to solve what happens after death.","author":"GMAN83","postID":"post1871467","date":"20150822-00:00:00 -0400","authorID":"http://ehealthforum.com/health/user_profile_730724.html"},{"content":"Some Home remedies which you can try for your depression : 1. plenty of good quality sleep 2. Healthy, nutritious diet and a healthy lifestyle 3. Regular exercises 4. Spending time with family and friends 5. Mind- body techniques for easing depression symptoms : a. Yoga b. Meditation c. Acupuncture d. Massage therapy 6. Learn about Bipolar Disorder as much as possible 7. Avoid recreational drugs or alcohol abuse These remedies are to be used only in mild conditions, in case of severe or chronic conditions visit your doctor.","author":"HealthAnge","replyTo":"post1871467","postID":"post1872097","date":"20150826-00:00:00 -0400","authorID":"http://ehealthforum.com/health/user_profile_725941.html"},{"content":"Hey GMAN83, I read your post. I can honestly say that I've felt the same way. It sounds like your having a spiritual issue. I'm sorry your feeling this way, and know that your not alone. There's this blogger that you should look into his name is Matt Walsh. He's really awesome and tackles subjects around today's agenda with a christian perspective. This blog is really good and you should check it out. Don't google up stuff too much because alot of the stuff you can find is usually misleading, so becareful what you believe on there. Don't believe the lies and have faith is all I can say.","author":"Zandy12","replyTo":"post1871467","postID":"post1872174","date":"20150826-00:00:00 -0400","authorID":"http://ehealthforum.com/health/user_profile_729982.html"}],"URL":"http://ehealthforum.com/health/depressed-about-getting-older-and-being-unsure-of-an-afterlife-t458773.html"}