{"title":"Depression after a television series or movie (Page 1)","thread":[{"content":"Does anyone go through a phase of depression after a series or movie has ended? It sounds silly, but I seem to have really bad depression after a season finale airs or a when the credits role in on a movie. It's gotten to stage where I literally have to walk out of the theaters 5 minutes before the movies' going to end and I contemplate fairly dark themes when the depression hits. Is there a way to deal with this odd affliction without taking away my viewing pleasure of many fantastic series, as this depression only gets worse? Or maybe give some theories about why this happens?","author":"Dasi14","postID":"post899427","date":"20080626-00:00:00 -0400","authorID":"http://ehealthforum.com/health/user_profile_137084.html"},{"content":"It sounds like you enjoy the movie you are watching you really don't want it to come to an end. That has happened many times with me. I am an avid Dr. House fan. And it is depressing for me to know that I have to wait another week (now season) to start so I can what the next episode. No, that is very common IMHO.","author":"CarolDiane","replyTo":"post899427","postID":"post899428","date":"20080626-00:00:00 -0400","authorID":"http://ehealthforum.com/health/user_profile_108203.html"},{"content":"I have that after a good book is over... it's almost as if you don't know what to look forward to anymore. Do you feel symptoms of depression at other times? My guess would be that you have some sort of depression going on and you're using these movies/tv series to take your mind off of things.....","author":"Georgia59","replyTo":"post899427","postID":"post900082","date":"20080627-00:00:00 -0400","authorID":"http://ehealthforum.com/health/user_profile_91919.html"},{"content":"This is gonna sound pretty... weird i guess, but if anyone has heard of the tv series Avatar The Last Airbender, i watched the very last episode over the weekend and saw the end scene of the 2 main characters kissing, and then it just ended. Since then i've become pretty depressed and as hard as it for me to say this, i think i might be jealous, not of the characters, but of the fact that i cant have the alternate reality where i can go on a life altering adventure and have a romantic ending. Since then i've found parallels, or ways to connect my relationship with my girlfriend to it. i dont ever think that its realistic of any sort, but i'd like to know if what i'm experiencing is depression, or just a stupid phase that'll pass. I'm happy pretty much all of the time, but there are certain things that will remind me of it, and then i become jealous or envious all over again. It does sound stupid, but i'd at least like to know that i'm not alone","author":"richfart231","title":"Movie/ Series Related Moods","replyTo":"post899427","postID":"post1217164","date":"20100608-00:00:00 -0400","authorID":"http://ehealthforum.com/health/user_profile_282704.html"},{"content":"I have similar feelings. Although my feelings aren't mainly of jealousy or envy, I still most of what your going through.","author":"slayer1s1k","replyTo":"post1217164","postID":"post1388945","date":"20110628-00:00:00 -0400","authorID":"http://ehealthforum.com/health/user_profile_385505.html"},{"content":"Hey I have the exact same feeling. Over the past few weeks, I watched the entire avatar the last air bender series. I loved the show when I was in middle school and I wanted to revisit it. But now I am really depressed that I will never get to see any of those characters again. There will never be another adventure with Aang,Katara,Soka,Toph and Zuko. I am not sure if what I feel is normal; I know the series has been over for 3 years but I really want the adventure to continue. This is not even the first time, every time I finish a good book or finish watching a good movie, I feel the same way.","author":"ASmallPerson","replyTo":"post1217164","postID":"post1442537","date":"20111010-00:00:00 -0400","authorID":"http://ehealthforum.com/health/user_profile_421589.html"},{"content":"wow this is the reason im on here. The end of Avatar spiraled me into a deep depression I am still in (of course I've been depressed for years for other reasons) The characters kissing made me feel upset. I feel like no one can understand this problem I have, as I have depression, severe OCD, and most likely Aspergers. The fact that the show is over, and that life is not like the show, made me really upset. I found out that there is a new series, but with a new set of characters, and it makes me sad to know that there is no more of the original series. I also feel inferior to the characters because they have relationships at a young age, and also have \"supernatural abilities\". Even though I know the show is not real, I still feel upset. Aang being the great Avatar makes me jealous of him. I do not have these problems with other shows, only ones that have younger protagonists. Perhaps there is a part of my childhood that I regret. I never had many friends, and I never had a girlfriend, and I am 21. I feel less alone now reading this post.","author":"abnormalissues","replyTo":"post1217164","postID":"post1555630","date":"20120430-00:00:00 -0400","authorID":"http://ehealthforum.com/health/user_profile_503054.html"},{"content":"This is exactly what I did, watched the whole however many series in less than 5 days. I don't think I have ever empathised more with a set of characters and now, as well as being down over the end of the program and the finality of there never being any more of their adventures that I felt part of, however silly that sounds. There being a new series set 70 years in the future, which talks about nearly all the old characters being dead in the first episode, has really, really got to me.","author":"Quanta800","replyTo":"post1555630","postID":"post1564035","date":"20120516-00:00:00 -0400","authorID":"http://ehealthforum.com/health/user_profile_508166.html"},{"content":"I had a pretty emotional reaction to the end of season 3 of Community. I'm the sort of person who desperately wants to have friends but is terrible at making them, and these seven weirdos and outcasts who somehow connected with each other really hit home. The show had the message, essentially, that even the shittiest places one can find friends and hope. Then the guy who ran the show and made it what it was got fired, and I felt like something very personal had been taken away from me, like I'd lost a friend. It made me sort of realize how damn lonely I am, especially since I'd had to leave behind a bunch of really close friends the year before.","author":"Crane42","replyTo":"post1555630","postID":"post1630195","date":"20121006-00:00:00 -0400","authorID":"http://ehealthforum.com/health/user_profile_553113.html"},{"content":"OHMY. You are not alone. I am going through the same thing with Avatar. Uggh.It feels like it sucks that they're not real. I watched the whole series in 4 days in my computer, and then after that. Back to reality.","author":"lolly_pop","replyTo":"post1217164","postID":"post1610829","date":"20120821-00:00:00 -0400","authorID":"http://ehealthforum.com/health/user_profile_539970.html"},{"content":"Im Having the same problem here, i started to watch the Avatar like 2 weeks ago, i use to watch them on T.V but now i watched them on Netflix. Yesterday i finished watching it and today I've just been so sad all day. my mind just went crazy i was -mad cuz the ending we never find out about zuko's mom. -sad i never saw what will happen with suko and mai..... i really loved them together -i spent like 30 minute looking at google images of zuko and mai -found out the legend of korra is here and the old characters are out -feeling the same way as u are, knowing that going through amazing adventures is only on T.V -and i just feel like i want to cry for no reason Let me say, i suffer of depression since i entered high school. not cuz i got picked on or stuff like that, just sadness in life in general. im not full time depressed, just all of a sudden i will be sad for like 2 months. last time i was depressed was before summer. when i saw this on Netflix i thought this would be great to see it and finish it, to remember my childhood, and to see the final battle. But now im all sad, and have had a frog in my throat all day, and getting teary . I am 19 years old, sophomore in college.","author":"cruzjone","replyTo":"post1217164","postID":"post1641328","date":"20121101-00:00:00 -0400","authorID":"http://ehealthforum.com/health/user_profile_561299.html"},{"content":"hey after watching jackie chan's 'the myth' i'm feeling very bad for ok soo! i dunno why :'(","author":"turbo911","replyTo":"post899427","postID":"post1217887","date":"20100610-00:00:00 -0400","authorID":"http://ehealthforum.com/health/user_profile_283148.html"},{"content":"I think I can relate somewhat to all of you but I have an explantion for my sadness. My daughter passed July 4h 2008, not a day passes that I dont think of her, but some movies bring back moments of our happy or sad times we shared. Their is one movie about a dog, I can't remember the title but my grandson or I cannot watch that movie anymore, we cry for hours afterwards. I am wondering if these movies are bringing something back into your memories that you may have forgotten about that perhaps create the sadness or depression. By the way I love the House Series too.","author":"Cindyrelli57","replyTo":"post899427","postID":"post1217913","date":"20100610-00:00:00 -0400","authorID":"http://ehealthforum.com/health/user_profile_271279.html"},{"content":"I really feel much better now. I thought that I'm the only one with this kind of problem. It happens to me very often also during the series, not only at the end of it. I have an explanation for my feelings but I would like to make it go, without stopping watching the series (30-40 minutes of something before going to sleep is like a sleeping pill). Even that I have a really good life I'm all the time unsatisfied with it and I'm looking every time to change it (e.g.: in the last 3 years I've lived and worked in 3 different countries!!). I watch very often sitcoms or family series where I see new places, nice people, funny situation, nice family- or friend-relationships and I have all the time the feeling that I'm in the wrong place. I'm still looking for that place even if I know I'm not able to find it because it doesn't exist. I had this problem even without watching movies/series but a lot of them make it worse. Another reason could also be the entire idea of the series. While I watch a series I feel that I'm living there. For example I love Gilmore Girls (don't tell anybody about it because they will say I'm gay ) I like it manly because of the relations between characters and I wish I had the same kind of relation with my parents as Lorlei with Rory. I'll stop now but I know that my problem is much more deep than a simple movie or series depression.","author":"Schnappi","replyTo":"post899427","postID":"post1238860","date":"20100725-00:00:00 -0400","authorID":"http://ehealthforum.com/health/user_profile_294784.html"},{"content":"The question hits home for myself. I recently started to watch the Lois & Clark reruns on Netflix. I find myself pulled into the story line to the point that I wish I was part of it as well. As the previous poster stated, it's the relationships which I wish were part of my life. I guess the only comfort is in seeing that I'm not alone in this struggle.","author":"headwest2222","replyTo":"post899427","postID":"post1289595","date":"20101126-00:00:00 -0500","authorID":"http://ehealthforum.com/health/user_profile_325391.html"},{"content":"as many have said. it is an unsatisfying feeling. ive tried vitamine d pills for my depression as well as tryng to re-watch the movie to just prove to my subconcious mind that there is possibly no way to live that story unless i was in \"heaven\" (im sorry if that offends anyone. i am lutherine and do believe in it). does anyone rcomed anything? practices? go out and have fun? force myself out of depression? or even medication?","author":"kzbesner","title":"depression regarding fairytale movies","replyTo":"post899427","postID":"post1345109","date":"20110406-00:00:00 -0400","authorID":"http://ehealthforum.com/health/user_profile_357503.html"},{"content":"First experience was too bad when I watch Wrong Turn 2 movie and it was really horrible. The whole movie was full of blood and Man Eaters theme. I had bad dreams about those characters in the movie. So whenever you watch such movies online it especially movies like Saw and Wrong Turn it gives you kind of physiological thrill.","author":"justinmiol","replyTo":"post899427","postID":"post1354644","date":"20110422-00:00:00 -0400","authorID":"http://ehealthforum.com/health/user_profile_363028.html"},{"content":"I just finished watching The Sarah Connor Chronicles. Last week there were no school for me, so I stayed home during most days. During these days, I spent a lot of time watching the series, and suddenly the series was over. Now I am depressed, and it's not th first time it happens after watching a tv-show. I feel my life becomes pointless, and all I can think of is the world described in the series. This has almost made me want to switch school, I feel sick all of the time, and I can't sleep. Usually I really like the way I live my life and the things I do, but right now I just want something else, something different. I hate this. But I will get over it, in the next couple of days. I just don't want it to come back.","author":"NicholasL34","replyTo":"post899427","postID":"post1456478","date":"20111107-00:00:00 -0500","authorID":"http://ehealthforum.com/health/user_profile_432137.html"},{"content":"I recently finished playing Mass Effect 3 on Xbox. It was the end of the trilogy and the end of one of my Favorite stories. I loved the games but they gave it a horrible finish, and now i just feel so empty inside. The games were one of the things i looked forward to and enjoyed so much for the last five years. Now that they are over i don't know what to do to replace them. Opinions?","author":"HenryAnnesley","replyTo":"post899427","postID":"post1525343","date":"20120312-00:00:00 -0400","authorID":"http://ehealthforum.com/health/user_profile_481456.html"},{"content":"You are not talking about depression at all. It's just that you have finished an experience and liked it. C'est la vie. One doesn't go through \"phases of depression\". You either have it or you don't. If it doesn't last 2 weeks non stop it's not depression and you are trivialising a serious illness with your emotions over a damned movie. Shame on you. I don't think you even know what depression is and I hope you don't get to find out. You would not survive it if this is your level of pain. Like any street drug, the first time is apparently great but no one can ever match that feeling again. It's about growing up and getting into the reality that everything in life has an ending. Including life. Get used to it and stop fantasising. Movies etc are supposed to be an escape from reality, not a new reality for you to be miserable about. Grow up. This post does not apply to Cindy. My deepest sympathies to you, It's hard losing a loved one, especially a child. So many memories bring it back. I lost my Mum and little sister when I was 10 in a car accident so I have a fair idea of what it feels like. SOme things I just won't listen to and some places I just won't go. As to the Wrong Turn watcher. Do you not read the preview? yet you still watch it. Maybe you are a masochist? Those movies are made for very sick types, not human beings.","author":"Oneofus","replyTo":"post899427","postID":"post1525667","date":"20120312-00:00:00 -0400","authorID":"http://ehealthforum.com/health/user_profile_455608.html"},{"content":"You have no idea what other people's depression is like or what can trigger it. Yes, trigger it despite having a loved one die (which I'm deeply sorry for). The ending of a television show or movie might demonstrate to someone how much more boring or miserable their life is. Yes, they're meant as an escape but personally, feeling that escape from reality disappearing is enough to trigger many symptoms of my depression and they stay for weeks. And yes, I do have waves of depression from mere not caring and not enjoying things to actual suicidal thoughts and feelings. Don't tell me or anyone else to \"grow up\" without knowing the full story and don't think that there is only one way to feel depression. Also, don't take away people right to feel experiences even if they use the wrong term (as long as there is an understanding that depression is a serious condition). Personally, I feel if I was able and willing to share feelings and actually experience them throughout my life my circumstances might be a bit different but as you said, C'est la vie.","author":"taydog","replyTo":"post1525667","postID":"post1791061","date":"20140301-00:00:00 -0500","authorID":"http://ehealthforum.com/health/user_profile_681780.html"},{"content":"Yes basically movies depress u because u were in fantasy land for a while and u don't want to face reality. Reality becomes really boring to u and as a result u don't want to do anything. You become jealous of The actors who you think probably have a more exciting life and you follow them trying to do whatever they do thinking it will make ur life more exciting. Well, just to let u know, Hollywood ruins everyone who is involved in it --wether it be the actors or the audience. Stop watching movies. Do something with ur life. Movies and fictional books are like a drug. They take u out of reality and reinvent things that don't exist. This is not mentally or emotionally healthy. Hollywood tries to portray love and fantasies that are NOT and NEVER will be existent. The actors have worse lives than u. Even with all that money, they are miserable. Be thankful bare not one of them","author":"iDisks","replyTo":"post899427","postID":"post1532503","date":"20120323-00:00:00 -0400","authorID":"http://ehealthforum.com/health/user_profile_486368.html"},{"content":"I read the Hunger Games (I had read the first book 2 years ago, but then re-read the series), and at the end I felt a pang of reality and just so empty inside. Depression? That sounds so crazy, but yeah.. It also happened to me when I watched Avatar: The Last Airbender at the end of the show (I watched this recently as well, but also watched some when I was younger.) Also, The Sisterhood of The Traveling Pants is a series I cried a lot in, which I also happened to read earlier in life. Also, when I think about this great book I read as a kid (The Dragon Keeper) I get really sad. I only seem to get emotionally tied with things that I've read/watched as a kid, which I just now realized. Maybe It's because of childhood memories, and It brings them back, or... what? Help me out! Thanks:)","author":"egold","replyTo":"post899427","postID":"post1595831","date":"20120718-00:00:00 -0400","authorID":"http://ehealthforum.com/health/user_profile_529411.html"},{"content":"Really glad I came across this post. Good to know you're not the only one experiencing this \"delusional\" form of depression. As I am going to sound redundant in referring to the reoccuring theme of watching \"Avatar: The last Airbender,\" I also experienced this form of \"emptiness,\" or simply put, a void inside myself after watching the series. Also like most people on here, I experience this feeling when watching certain films, series or games that attest to a fantasy lifestyle, where dreams come true through intricate development of characters and \"heroism.\" This happened just recently to me, and I'm glad I was able to find this forum to take comfort in, as now I don't feel as alone, and I've been alone for a lot of my life, but just knowing has made me feel a little bit more at peace with myself. But I digress, this feeling has made me think about my own life, my own goals and aspirations, what life really means and what am I going to do with mine. Specifically after watching TLAB, the emotion, feeling or whatever it may be, has been nearly traumatic, as I can not seem to go back to the way I felt or thought about life prior to TLAB. With the other movies or series that made me feel this way, I was able to revert back to my routine life, but with TLAB, it really changed me. I know its silly to think that a simple children's television show has brought this animosity to my moral codes, causing ambiguity and dilemma amongst myself. At first I hated it, I almost had wished that I was never brought to the attention of this show, but now .. I am trying to embrace it. Everything from the wisdom of Uncle Izoh, to the ambition of Zuko and himself facing his own turmoil with his destiny, and to Aang venturing off with his friends to save to world using natural elements that the earth provides from nature, I just, I just wanted to be apart of that experience. I noticed a lot of other people feeling this way, which now I find solace in, and after reading everything, from the opinions of some who say \"we need to get over ourselves and live your lives,\" it makes me realize that this feeling should be converted into a positive influence for ourselves. Its difficult to do, as I have not figured it out just yet, but I'm certain that its possible. I have dwelled upon the notions of being supernatural for many years of my life, as I enjoy fantasy very much, in a world that can be saved by a true hero or heroine or a group of. But TLAB, being an exceptionally well done show, just made me feel like it was possible, that it was possible to turn our human selves into something amazing, with determination and discipline. I have aspirations now of traveling abroad to Eastern Asia to study amongst monks at monasteries, and understand what they feel enlightenment is. But aside from my own personal goals, I am an average North American young adult, I attend university and have a near carefree lifestyle, as long as I hold a steady job to pay for school, and do some chores around the house. I do have friends, and I am a very delightful person to be around as people who know me can attest to, I love my family, but just seeing these ideas of a world through the creators of Avatar:TLAB, it brings my attention to how I am able to do so much more with my life to help people who need it, and yet I choose not to. I know growing up in North America most people want to attain the \"American Dream\" through hardwork and self sacrifice, but since I've attending Arts classes at University, it has opened my eyes to the world and its cruelty. So when I watch a show like TLAB, where there is always a way to \"save\" this world and achieve \"balance,\" it just appears that I get this feeling that everyone talks about. It may just be that I admire Asian religion and culture, (as I have grown up christian and knew nothing else) but I do like to believe that its just something inside myself wanting to change the world. It is not my place to decide whether the world needs changing or not, or whats the best way to make it better, but when I see suffering and chaos, I truly believe there needs to be rebalancing in this world, just like how Japanese society strives for this ideal. I am now working on improving myself as a person, to appreciate the finer things in life and appreciate more that I have, my family, my friends, everything that was given to me. Going through this mild \"depression\" made me so sad, that I just wanted to change myself, just do something that will change myself, just get up and go to somewhere, start fresh and try to make a difference. But as I write this, as I read this forum from various people feeling this way, I know its not the answer. TO leave my family behind, everything I've known, is not what I really want. What I want is to use everything I've learned, and build on it, to achieve self fufillment, and hopefully become truly happy. A lot of this reasoning also comes from these portrayals of fantasy worlds that need to be saved, comes from finding a perfect person to accompany you in your life journey, a ying to your yang so to speak. I have never known of someone who would make me feel this way, or accept me for who I am, but I hope one day along this constantly diverse journey I travel, that I can achieve my goals of making this world better for everyone, not just for myself, and finding someone like me who will join me. This feeling is not depression as someone has stated earlier, just a feeling of yourself understanding you want to be in a better world. What you do with this feeling is up to you, you rather dwell on it and always wish for it, or you do whatever you can to change it. Just like Avatar: The Last Airbender, they had natural powers to assist them in their journey. What we have as humans is intelligence and knowledge, which is the most powerful natural element of them all. I wish I had airbending, but at least I an try to understand wisdom, just like Uncle Izoh. I thank anyone who took the time to read my thoughts in text, I did start rambling and not really think about what I was writing, rather just how I felt as I kept writing, but I hope this helps at least someone get through this \"feeling\" that we have been going through. Again, I thank all of you who posted about this, as I know feel a little more peace in my heart and mind, would appreciate any replies. TL;DR This feeling is what you make of it, the idea of living in a perfect world, and how to get there.","author":"204bumrush","title":"Feeling of ... ?","replyTo":"post899427","postID":"post1612562","date":"20120826-00:00:00 -0400","authorID":"http://ehealthforum.com/health/user_profile_541080.html"},{"content":"I browse through a lot of forums on a variety of different topics, reading other peoples opinions and connecting them with my own. This is the first time I’ve ever been compelled to join in and add my own thoughts. I came across this forum because I felt the same way as many others about Avatar the Last Airbender and was surprised to see so many people felt this, admittedly silly, empty feeling (silly as it is just a children’s cartoon). But, I completely agreed with what everyone was saying about the show and about how they felt when it ended, then i read your post, 204bumrush, and I honestly felt like it was something straight out of my head. I just wanted to thank you (and everyone else) for sharing your thoughts on this matter as it really does help me feel less alone and has definitely lifted my spirits a bit. It doesn’t exactly take away my sadness about the show being over... lol, but I know that feeling will pass, and that I can always just re-watch it again in a few months or years and I`m sure it will feel like its brand new again. But in accordance with your ideas 204bumrush, I too feel like I need to draw something from this extremely well done show and to use it in my own life. I was also raised as a christian, but have recently developed great appreciation for traditional Asian cultures and religions (not just from this show, but from many other things). I want to be able to apply these lessons about harmonious living and balance to myself, my relationships, and really to the world if I can. And I too want to learn to appreciate more everything in my life like my family, friends, and everything else around me. I often consider myself to be afraid of major change, I usually just go with the flow and let things and people come to me, then I feel sad or lonely in the times when they don’t. This might just be more of a fear of making big decisions or putting myself out there, but this discussion has really made me think and I truly appreciate the sense of community everyone has given me by sharing their feelings on this topic. I hope that from this feeling I will be able to grow and overcome this sadness and fear of change and that I will be able to better myself and the world around me. And I’d just like to point out, that it’s really kind of an interesting thing to think that a kids cartoon can have such powerful underlying ideas and meanings and can bring together so many people. So thanks again to everyone and to this awesome show.","author":"frostedflakes1234","replyTo":"post1612562","postID":"post1620523","date":"20120914-00:00:00 -0400","authorID":"http://ehealthforum.com/health/user_profile_546494.html"},{"content":"I'm sorry, but I just have to add more to my extremely lengthy text of my thoughts (LOL.) I truly do believe that training your body and mind are necessary for a healthy lifestyle. Also, I feel this particular emotion/feeling is vamped by the thought of growing old and thinking about sad things of how you might watch all your friends, family and loved ones die, and they wont be there anymore, and the thought of being alone. But thats what life is, and you must make the most of it while you can. Take the extra time of being lazy and watching a movie, and instead go hang out with your sibling you haven't see in awhile, create memories that will be forever. The notion of memories even makes me sad .... I kept replaying that over and over after watching Aang and Katara kiss at the end of TLAB, then seeing Avatar: The Legend of Korra and seeing all the characters I came to attach myself to and love, and by love I mean love the idea of them and what they stand for and how they developed, then see them all as spirits of the past. It it was really hard for me to get over myself and get over this feeling. I still am trying to, but it is becoming easier as the days go by, and I start doing things to improve myself and do something with my life, makes me feel like I'm doing what these characters are doing in their own worlds. I want to be able to change the world, and I have to decide, will I just put my mind to it and do it, and try to change the world around me, or, will I just think about it today, and say I'll do it tomorrow, fully knowing, tomorrow will never come. I may not be able to use the elements at my will to change this world, but who knows, maybe through the power of science, or through the power of politics and wisdom, we can make the change. These are easily abused, as seen in The Avatar series, but I hope I can achieve the wisdom needed to decipher the fine line between chaos and enlightenment.","author":"204bumrush","replyTo":"post899427","postID":"post1612566","date":"20120826-00:00:00 -0400","authorID":"http://ehealthforum.com/health/user_profile_541080.html"},{"content":"I'm 16 years old and I totally feel the same with lots of films and TV series, especially with Harry Potter films, Lord of the Rings, Star Wars, House, etc. I grew up with them so it's very hard to accept that there will be no more, I remember lots of childhood memories while watching them and wished I could go back then so I could watch them for first time again or just go live as a child again. The depression usually passes in a few days but comes back as soon as you rewatch/reread the films/tv series/books.","author":"Kazark","replyTo":"post899427","postID":"post1676856","date":"20130207-00:00:00 -0500","authorID":"http://ehealthforum.com/health/user_profile_589633.html"},{"content":"Thank you - all of you. I googled the subject and this was the first and only link I read. In your own words, each of you described exactly what I feel after a finale and opened my eyes that not only am I not alone in this, but the sadness that ensues should easily be overcome mentally and spiritually. Some of you even phrased this phenomenon perfectly. I mean that. Can't say these feelings will ever go away, but his forum gave me comfort in knowing I'm not alone - and strength to understand that I must learn to deal with it more effectively. I was dealing with this for over 3 decades. I can now deal with it effectively and positively in the nex decades ahead. G'luck to all of you.","author":"jaykram","replyTo":"post899427","postID":"post1697314","date":"20130414-00:00:00 -0400","authorID":"http://ehealthforum.com/health/user_profile_608407.html"},{"content":"Damn it feels good to know I am not alone in this anymore, I did not watch Avatar but I did get really sad when Micheal Scott moved away from the office. The weird part is that I only got depressed after I _re_watched the series. So I knew what would happen in advance..","author":"TheOffice","title":"The office","replyTo":"post899427","postID":"post1742154","date":"20130807-00:00:00 -0400","authorID":"http://ehealthforum.com/health/user_profile_643439.html"},{"content":"I'm feeling super depressed, as breaking bad ended & also last week dexter ended. I seem to always get depressed when a show ends. It's something I can't explain, but like I'm so attached to the characters & atmosphere of the shows I watch. I don't know why else I would feel so down after a series ends. I'm seriously contemplating not getting into anymore shows. But rather maybe another hobby to fulfill those times. It's utter BS that I feel this way after a show ends, & I don't want it to happen again. I suppose it doesn't help I live in Alaska. Winter's coming, it's getting darker & darker in the middle of the day.","author":"David889","replyTo":"post899427","postID":"post1758778","date":"20131001-00:00:00 -0400","authorID":"http://ehealthforum.com/health/user_profile_656421.html"},{"content":"Oh my, thank God it's not just me.. I'm from Norway and I tried to google this a couple of times in my language but nothing.. Then I google it in english and found out there is such thing called \"Post-Series Depression\" , then I googled that and here I am. Right now as we speak I am at the very last season of sex and the city. I don't dare to watch the last episode. But I have to!! But I don't want it to end. I feel like this girls are my friends now and I don't want it to end.. My God I gotta have some sort of issues :p Please don't read this more than once, it's embarrassing.. When I think of that this is the end of the serie and in a blink of an eye I will have watched all the episodes and there will be no more, i feel like crying. I don't have anything to lok forward to. School can f*** itself in the a**, I just want to have Carrie, Miranda, Charlotte and Samantha here now!","author":"Maddieb95","replyTo":"post899427","postID":"post1788834","date":"20140219-00:00:00 -0500","authorID":"http://ehealthforum.com/health/user_profile_680246.html"},{"content":"Wow, I legitimately thought I was the only one. I like anime and I watch it a lot and when a series ends I just cry. Its so sad, It's like you have invested your emotions into them and you know them, you understand the characters and they become your friends. Then as real life always does, it ends. The beauty is over, you will never see anything but a repeat of their mannerisms and behaviors. It is so depressing yet for some reason I always feel that it is beautiful that it was there in the first place and because it was not permanent, it almost becomes an irreplaceable one time experience which alone can make me cry out of sheer gratitude and sadness full of beauty If that makes any sense.","author":"DiamondLouisXIV","replyTo":"post899427","postID":"post1791331","date":"20140303-00:00:00 -0500","authorID":"http://ehealthforum.com/health/user_profile_682053.html"},{"content":"Yeah I kinda figured I wasn't the only one who got this but man it sucks... Specifically after season 3 of Community ended like someone else said I had some really bad depression and for the past few days I've had some from Frozen. (God damn Anna is so damn cute I wish I could keep watching the movie). It always passes though, so at least I know It'll get better. I also hate how I can't rewatch Frozen right now without renewing the depression ):","author":"Raelze","replyTo":"post899427","postID":"post1795193","date":"20140321-00:00:00 -0400","authorID":"http://ehealthforum.com/health/user_profile_685157.html"},{"content":"So does anyone know how to overcome this? I'm currently going through the same phase and the depression JUST hit me today. I'm currently reading a fan fiction story and it's happening all over again. It's that feeling of losing somebody really close to you, UGHHH...I hate when that happens. It seems like this only happens to me when the story really makes you become attached the characters. This happened to me about a year ago from watching an anime, but I don't know how I managed to get over it. Perhaps it could've been moving onto another series that helped ease the situation? I don't know really. At this point, even if it feels like if I try an alternative story, the previous one will still be stuck in my head or the new one will probably just do the same thing.","author":"36Chamber","replyTo":"post899427","postID":"post1801764","date":"20140422-00:00:00 -0400","authorID":"http://ehealthforum.com/health/user_profile_689912.html"},{"content":"This is the first time in my life that I leave a reply in an internet forum, so you can imagine how much identified i just felt while reading your posts. As almost everyone here, I thought I was the only one to feel this before asking google. Once I googled it, I saw that this problem was quite usual, and I'm missing some psycological literature about identifying and getting rid of it. Although I see this same case on different forums, it still feels a bit embarrassing, silly, ridiculous to admit that I'm writing this because of Frozen. However, I remember this feeling many other times along my life (23 years by this time, with a normal childhood, healthy social life and currently studying in the University, and psycologically stable until now). I used to feel this way every time I finished a book, whether good or not -from Harry Potter and Enyd Blyton novels to Ken Follett's Pillars of the Earth-, series... but it's especially intense when it comes after a \"happy ending\". Ironically, \"happy endings\" make me sad. I don't often feel envy nor jealous so I don't think that's what I'm feeling but it strikes me with some kind of frustration, as my life (as I stated before, happy normal life with friends and girlfriend) seems inconsistent, boring, dull, and I want to impersonate the characters in their lifes. I even found some attraction to Elsa and Anna, otherwise just fictional computer-designed characters like Merida from Brave (which I saw after Frozen to \"heal me\" but didn't have any effect) I'm not going to say that Frozen has changed my life, although somehow it's had some effects on it. First and foremost, I have my exams next two weeks and I can't think of anything but that hell of a film, which I now watched twice, and downloaded the soundtrack, watched a whole bunch of youtube videos about it, making of and so on. I'm re-watching my life to see what makes it this dull and aimless (I've been through a brief but intense faith crisis last months, I must admit) and nothing seems to calm my frustration. I feel terrible because of all this happening after watching a children's movie. It's been two weeks now, and I read somewhere that it lasts from days to months, most typically three weeks. I'll let you know any progress that I make, and I'd like to thank you all for sharing your experiences and ask you to share how did you handle it. Many people are looking for tips on this forums and may thank your advice.","author":"idontusuallyleavereplies","replyTo":"post899427","postID":"post1836435","date":"20141210-00:00:00 -0500","authorID":"http://ehealthforum.com/health/user_profile_711182.html"},{"content":"I just finished watching all the Iron Man movies and I feel really sad about it because there may not be a fourth movie. It's stupid, but randomly throughout my day I will think of something from Iron man and I feel like I'm about to cry. Sometimes I do cry.","author":"SniffPom","replyTo":"post899427","postID":"post1836863","date":"20141214-00:00:00 -0500","authorID":"http://ehealthforum.com/health/user_profile_711433.html"},{"content":"Hello again. I have overcome my post-Frozen depression and I must confess that it feels ridiculous now. I'm posting this to be fair to my promise of coming back, but reading what I've written, I'm feeling almost ashamed. I posted that on December 10th. I definitely overcome my postmovie depression on January 4th, when watching the musical Les Miserables. You know what they say, \"like cures like\". After being quite obsessed with it (just quite, not even remotely as obsessed as with Frozen) I've been absolutely normal for at least 5 months. So, good luck to everyone and try not to write your movie obsessions too much on the internet - it'll feel awkward when you read it later!","author":"idontusuallyleavereplies","replyTo":"post899427","postID":"post1861412","date":"20150622-00:00:00 -0400","authorID":"http://ehealthforum.com/health/user_profile_711182.html"},{"content":"Some Home remedies which you can try for your depression : 1. plenty of good quality sleep 2. Healthy, nutritious diet and a healthy lifestyle 3. Regular exercises 4. Spending time with family and friends 5. Mind- body techniques for easing depression symptoms : a. Yoga b. Meditation c. Acupuncture d. Massage therapy 6. Learn about Bipolar Disorder as much as possible 7. Avoid recreational drugs or alcohol abuse These remedies are to be used only in mild conditions, in case of severe or chronic conditions visit your doctor.","author":"HealthAnge","replyTo":"post899427","postID":"post1866808","date":"20150724-00:00:00 -0400","authorID":"http://ehealthforum.com/health/user_profile_725941.html"}],"URL":"http://ehealthforum.com/health/depression-after-a-television-series-or-movie-t144925.html"}