{"title":"Just want to share my feelings","thread":[{"content":"Hello everyone, I'm a 21 year old guy and I really want to share my feelings while still being anonymous. The reason I'm writing this is because the past few weeks have scared me. For example, I tried to stand as close as possible to a passing by train. It missed me by about 5 cm, people were staring at me but I just didn't care. Also while cycling I pass busy roads with my eyes closed. This all seems kinda weird, however 2 nights ago I walked away from a party and went on to go to the railroad tracks. I walked on the tracks on the middle hoping a train would pass by. As you might've guessed, none did. A few weeks ago I wouldn't have thought I would do those kind of things, but I do. I see people passing me by in their lives, and here I am. Stuck socially, feeling empty even in times when I know it's a moment of joy. I just can't seem to experience it. However, this isn't something new. I've been feeling like this since I was 14, but it seems every problem is flowing out of me since the beginning of this year. I've been wearing a mask that always smiled for so many years. Nobody that could comfort me, all alone in the bathroom of highschool. My parents suspected nothing and my so called 'friends' didn't care. Day by day I'm slowly dying, and I feel that day is getting really close. That's scaring me. Even when my life is seemingly going the positive way, I can't experience it. Even getting help with this is hard, not so much in actually asking, but it's been weeks since I asked for a psychologist and psychiatrist to help me. They still haven't responded. How ironic is that? Anyways, I could go on for pages, but this should do it for now. Thanks for actually reading the post","author":"Trufox","postID":"post1462567","date":"20111119-00:00:00 -0500","authorID":"http://ehealthforum.com/health/user_profile_436636.html"},{"content":"I've never stood close to a train, but I sometimes feel like it. I wonder what would happen if I suddenly swerved into oncoming traffic or whatever. Feels kinda weird admitting to that. I always get sick to my stomach when I think about it though, so I never come close to doing it.","author":"Pharaon","replyTo":"post1462567","postID":"post1463306","date":"20111121-00:00:00 -0500","authorID":"http://ehealthforum.com/health/user_profile_437184.html"},{"content":"hey i know how you feel..i suffer from depression and i've thought about doing things like that before too..i'm sorry you're feeling so bad right now, but remember suicide is permanent and problems are temporary. here is a website that really helped me-metanoia.org/suicide/. i hope you get help soon and if you need someone to talk to you can email me:)","author":"balletgirl19","replyTo":"post1462567","postID":"post1466548","date":"20111128-00:00:00 -0500","authorID":"http://ehealthforum.com/health/user_profile_439534.html"},{"content":"i know how you can get better, just email me. i live in Brazil, you dont have to worry about being anonymous... please!!","author":"carolinemoraess","title":"email me","replyTo":"post1462567","postID":"post1473154","date":"20111210-00:00:00 -0500","authorID":"http://ehealthforum.com/health/user_profile_444208.html"},{"content":"you are being passively suicidal learning that phrase helped me sometimes just giving something a name, defining it can somehow help in dealing with it i hope you have not been successful (accidentally or on purpose)","author":"mrfickle","replyTo":"post1462567","postID":"post1473456","date":"20111211-00:00:00 -0500","authorID":"http://ehealthforum.com/health/user_profile_444424.html"},{"content":"Hi frnds... Iam 22 year old girl... there is nothing good in my life... my parents always do partiality between me nd my sis... i am a victim of child sexual abuse... tourchure in school college...i just wanted love in my life but always it happens wid me that my bf uses me and then... i really want to sucide...","author":"iwantloveinmylife","replyTo":"post1462567","postID":"post1815667","date":"20140710-00:00:00 -0400","authorID":"http://ehealthforum.com/health/user_profile_698925.html"},{"content":"hi everyone, i am 28 year old guy, always lived life with fun, never though to make any girl friend and never even tried, i have many female friends but everything is limited to friendship, but then an year an half ago i met a girl, don;t know why i just felt something inside and started talking to her, started to met her regularly, and in no time i started to have feelings for her and i told her that i love her, but she said we are just friends and she dont feel the same way but she wants me to understand and just being friends but then i started falling for her more and made out with her and all, and now she have started ignoring me slowly slowly, i don't know what to do, i am feeling a lot of pain in center of my chest, can;t eat anything, its like i am gonna vomit, nothing can happen from her side and thats the sure thing, its just now i have to come out of it, and i can;t even talk about to anyone, i don;t know why i am sharing here its been two days , i haven't slept and still not feeling sleepy. i feel like dying, i don;t know why i love her so much,","author":"shreyyash","replyTo":"post1462567","postID":"post1864656","date":"20150711-00:00:00 -0400","authorID":"http://ehealthforum.com/health/user_profile_727530.html"},{"content":"Heres something from allen, read somewhere: His love for me - in spite of everything - continues to astound me... Hi all, I may call myself a Christian, but if I were to be brutally honest, I have not been a very good Christian - or person, for that matter. I struggle with pride, with jealousy, with lust, with anxiety, with low self-esteem, with forgiving myself for my sins, with holding myself accountable for my own actions, with stubbornness, with anger, with being hard on myself...the list goes on. All of this indicates that I have difficulties loving myself. And all of this is why I continue to need Jesus. When I began to give my life to Christ ( I say that, because giving my life to Christ for me has been something that I have needed to do on a daily, hourly, minute-by-minute basis), I initially (naively) thought that my life would get easier. That, of course, did not happen. What did happen was that I became aware of how much I needed Jesus. If God can love me, He can love anyone. And His love is where it all begins. Where it all began. Where love began. Note that I didn't do anything here to deserve God's love. I didn't earn God's love. I earned God's wrath. We all did - but it was his Son's sacrificial love that showed us a way. The only way. And His love for me - in spite of everything I have done, am doing, and will continue to do - astounds me. I just hope that I can be more like Him, and less like me. I know I often fail at that. And you know what? That's OK. Because there was only one man who could be without failure, without flaw, without sin. A perfect human life. That's who our faith is in. Let's all try to be more aware of that, and continue to live for Him, and Him alone -even knowing that we will fail.","author":"samm00","replyTo":"post1462567","postID":"post1865975","date":"20150718-00:00:00 -0400","authorID":"http://ehealthforum.com/health/user_profile_707378.html"}],"URL":"http://ehealthforum.com/health/just-want-to-share-my-feelings-t314234.html"}