{"title":"tired of living","thread":[{"content":"I have been in a depression for so many years and I am tired of the ups and downs of this mental illness. I feel like nothing is worth living for. I have no friends and no girlfriend, its been years since I have gone anywhere I am a loner who lives in a garage and I feel like if I was to go out I would be paranoid and schizophrenic. My.life is starting to feel like if it's just not worth all the pain of this mental illness.","author":"doglover123","postID":"post1869113","date":"20150805-00:00:00 -0400","authorID":"http://ehealthforum.com/health/user_profile_729462.html"},{"content":"You were put on this earth for a reason. Find something to do, volunteer, work with a neighbor at a garage sale. visit a library & read....step out of this and do something for yourself...........walk the beach and collect shells and make something with them. I have seen some beautiful things done with shells.","author":"mcilvaine","replyTo":"post1869113","postID":"post1869127","date":"20150805-00:00:00 -0400","authorID":"http://ehealthforum.com/health/user_profile_724875.html"},{"content":"Whats up doglover123, im sorry that your feeling this way. I've been having the same problem. Its pointless being happy because you know in the next 30 minutes your going to feel again the exact opposite, I always felt better off dead, so knowing your not alone helps a lot. you sleep in the garage? lucky, I don't even have my own room to sleep in, yet alone have a garage. I too never had a girlfriend. thats ok, as long as your alive there are so many girls out there to talk to, you just gotta put yourself out there. you are worth it, just like mcilvaine said you are here for a reason. You should have a hobby to keep you busy, for me its making puzzles and reading. theres gotta be something you enjoy doing, and make sure you spend plenty of time everyday enjoying that activity. faith in God has also helped me get my strength. I will pray for you that this pain will pass. This is only a season, this is winter, but spring is coming right around the corner. God bless.","author":"Zandy12","replyTo":"post1869113","postID":"post1870196","date":"20150812-00:00:00 -0400","authorID":"http://ehealthforum.com/health/user_profile_729982.html"}],"URL":"http://ehealthforum.com/health/tired-of-living-t457916.html"}