{"title":"i just cant do this anymore!!","thread":[{"content":"Hi my name is Caitlin I'm 20 years old I have severe anxiety and depression I have had anxiety for 6 years but recently in the last 3/4 months its gotten so bad and I've been having this weird feeling like a bad gut feeling that I'm going to die soon with no other symptoms just that extreme bad negative feeling and it really scares me a lot because I feel its real because I've never had it before and it feels so strong now I went to the doctor and they gave me citalopram and propranolol but they don't help this weird feeling I constantly have chest pain tightness squeezing you name it I've got it been to the ER so many times they can't find anything but I still feel like I'm going to have a heart attack or a cardiac arrest I am just so so scared I don't feel like me nothing feels real everything feels weird and unnormal and it just feels like I'm fading away from the world like everything's going different because I'm going to die that's what I think anyway can someone please give me some advice and on what to do because I don't no what to do anymore I'm living in absouloute fear and terrified thanks xx","author":"caitlinxx","postID":"post1841955","date":"20150127-00:00:00 -0500","authorID":"http://ehealthforum.com/health/user_profile_714671.html"},{"content":"Hi, Have you considered going to another doctor or asking your doctor to change meds? I know it takes at 2 weeks to see any effects of meds...but you seem to need something other than what was prescribed. Now, on another page...what is going on in your life that makes everything feel your number is up? Other than you getting \"weird feelings\" why else would you even begin to think you are about to die? Life is a gift and everyday you are alive you need to be thankful. Unti you ahve almost died...several times...you can't begin to understand why life is so important. I use to wish mine away...give my life to a child dying from cancer...but now I apprecaite life and all it has to offer.","author":"Fairy Godmother","replyTo":"post1841955","postID":"post1841992","date":"20150127-00:00:00 -0500","authorID":"http://ehealthforum.com/health/user_profile_3723.html"},{"content":"Hi no I've not considerd those options I've only been on the meds fr 4 weeks 3 days ago my citalopram dose got put up to 40 mg I don't know why I get these feelings I don't know if its just the anxiety but it really haunts me thanks for your replys xx","author":"caitlinxx","replyTo":"post1841955","postID":"post1842100","date":"20150128-00:00:00 -0500","authorID":"http://ehealthforum.com/health/user_profile_714671.html"},{"content":"This problems are happen to many teen of your age. You should start treatments for it. So many rehab centers are available specially for teens. Think about your future life that you'll have to make better and depression free.","author":"edwardcejka","replyTo":"post1841955","postID":"post1845313","date":"20150220-00:00:00 -0500","authorID":"http://ehealthforum.com/health/user_profile_700761.html"},{"content":"These meds are prescribed, right. Dont just order and tske, may do u harm.","author":"samm00","replyTo":"post1841955","postID":"post1845413","date":"20150220-00:00:00 -0500","authorID":"http://ehealthforum.com/health/user_profile_707378.html"},{"content":"My husband died 3 yrs ago He was my soul mate we were never apart for 17 yr. I cant get out of bed and i just dont care anymore meds dont help sick of drs and pycs and every one telling me be happy hes in a better place .well his place was with me .Im 60 and hes the only man I truely loved my whole life He cant come back But I can go to him .My quality of life is verybad and I just cant do this anymore","author":"lindadicicco","replyTo":"post1841955","postID":"post1849349","date":"20150318-00:00:00 -0400","authorID":"http://ehealthforum.com/health/user_profile_718658.html"},{"content":"Linda, It may be that the advice to be happy may not be acceptable to you, as many people grieve differently. Perpahs some truly want to help, but each one copes as he or she will. I only know some elderly ppl still minister or help out others, whether thru tutorials, part time grandma, other ways. Hopefully the pain will lessen as you dwell on other thngs, but most of all, may the God of peace comfort you even now.","author":"samm00","replyTo":"post1841955","postID":"post1849487","date":"20150319-00:00:00 -0400","authorID":"http://ehealthforum.com/health/user_profile_707378.html"},{"content":"Hi lindadisicco: We, too, are soulmates...Have been together for 56 years and four months...Believe me I hear you...Have you tried doing some charity work at a hospital...Just getting out where you are around people...Sometimes helping other people can be great therapy.... I wish I could help, but I can't....I just about lost my husband twice in the last two years...Once when he got his Pacemaker and once a year ago this February with his Knee Replacement....Look at it this way, he wouldn't want you to join him, he would rather you find a new part of yourself with his watching you in the wings...My deepest condolences to you...Sincerely.... Caroline.....","author":"CarolineEF","replyTo":"post1841955","postID":"post1849502","date":"20150319-00:00:00 -0400","authorID":"http://ehealthforum.com/health/user_profile_220777.html"},{"content":"Anxiety is very bad and affects on mental health. After a long time it is hard to come out of it. You can take therapies from professionals, that might help you.","author":"user665205B","replyTo":"post1841955","postID":"post1850056","date":"20150324-00:00:00 -0400","authorID":"http://ehealthforum.com/health/user_profile_665205.html"},{"content":"If you are suffering from long time period of anxiety then you should contact any treatment center. You should think of your future life that you can make beautiful. Be positive.","author":"edwardcejka","replyTo":"post1841955","postID":"post1850221","date":"20150325-00:00:00 -0400","authorID":"http://ehealthforum.com/health/user_profile_700761.html"},{"content":"Hi Caitlinxx. I want you to know that you are not alone. I could've written this myself. I actually ended up in the ER before because of these same feelings. I feel like the world isn't real, chest tightness, nausea, light-headedness, and the crazy impulse to jump off a bridge. It's really difficult in this time and place. But you can fight through this, because I did, you will be OK. Look up depersonalization and anxiety, that's what you are experiencing. You obviously have depression, and that's manifesting itself into those symptoms. Don't take antidepressants, I took them and had they made me feel worser. You should try some natural mood-boosters called botanicals, you can order them online. I use those and they help me out so much. You should also exercise and meditate. Talk to someone also, that is so so important. I feel like ive been living these past couple of days in dreaded fear, so know that you are not alone. I will pray for you, God bless. You need to remember that all the experiences you are having are mental, so you have control over these issues and you can fix them, but you have to make some changes for yourself.","author":"Zandy12","replyTo":"post1841955","postID":"post1870193","date":"20150812-00:00:00 -0400","authorID":"http://ehealthforum.com/health/user_profile_729982.html"}],"URL":"http://ehealthforum.com/health/i-just-cant-do-this-anymore-t447987.html"}