{"title":"'Attachment' Issues?","thread":[{"content":"Hey guys, so I know this guy who's been going through some changes, and they're not good. I don't want to call it some sort of disorder or whatever, but I was wondering if there was some sort of name or syndrome for their condition. Now about 7-8 months ago this person was a normal person. He was perfectly fine, he cared about his relationships (friends and family), enjoyed being around his friends and family, and cared about others. He was friendly, he was helpful, and compassionate. But now he's... different. I didn't know what his deal was at first, but now I understand. There's this kid, a family member to him, and they're what is causing the problem, but I'll get to that in a minute. He's distant. He doesn't really care about hanging around friends, doesn't care much about spending time with his family, and if he decides to help someone it's because he feels 'obligated' to; he doesn't have that same 'friendliness' anymore. He always seems like he's 'hopeless' or 'broken'. He always looks depressed, doesn't talk much, and at one point he felt sick all the time and didn't eat a whole lot. And I am not about to call them panic attacks, but one time I caught him breathing really hard, crying, and his arms and legs and head was jerking around in different directions. He was very upset, like he was very afraid or worried something bad was about to happen. I've also seen him 'silent scream'; by that I mean he opens his mouth and 'screams' but doesn't make sound; sometimes that's mixed in with his episodes. But all of this is because of that kid I mentioned just now. He simply doesn't care about anything except them. But the feeling between them is more like a father-child type of thing. He's extremely overprotective of the kid, almost like he's the 'all-powerful' guardian or something. To me it looks like the kid is some sort of surrogate daughter/son to him, as if he's trying to force himself into that position to care for them. I remember when something bad happened to the kid he had one of his episodes, and that was when he started feeling very sick and didn't eat a whole lot. If he's not around that kid, he starts getting very different, scary even. When he's around the kid he's perfectly fine. He's more talkative, active, outgoing, and he's back to his normal self. I will admit though that this kid is almost exactly like he was when he was a kid; they're very similar in a lot of different ways. I don't know if this has caused him to become attached to them in a way that he can't really attach to someone else. And he'll give an arm and a leg for the kid. If they asked him to fall on a sword he'd do it, no questions asked. I swear that kid could gouge his eyes out with a spoon and it wouldn't phase him. It's as if he doesn't think the kid can do anything wrong. And before, whereas my friend would stand up for me when someone tried to do me wrong... I feel like if someone was to even look at this kid the wrong way that this guy would end up snapping and do some real damage to someone. They're just extremely overly attached to a single individual, and when they feel that something may be wrong with that individual they get stressed out. He has severe anxiety and stress-related issues, but it's all related to that kid, and I don't know what I need to look up to learn more about it.","author":"Coletrain","postID":"post1834347","date":"20141124-00:00:00 -0500","authorID":"http://ehealthforum.com/health/user_profile_709971.html"},{"content":"Hello! I have read your submission 3 times. I cannot figure out who \"the kid\" is, who the person who was normal 7-8 months ago and now sounds maybe depressed, maybe having panic attacks is. I can't tell if \"this person\" is having the issues or \"the kid\" is. I don't know what your relationship to each of these people is but maybe you are one of them? If so it is perfectly normal to write to an anonymous forum to get some help. It sounds like everyone involved needs to see a professional mental health counselor of some sort, get an analysis of what the heck is going on and go from there. Best, Dr.Kim PS When I read it again for the 4th time it sounds like you are concerned about someone who is affected by \"the kid\" but again / BOTH of these people need professional help.","author":"Dr. Kim Crawford","replyTo":"post1834347","postID":"post1866596","date":"20150722-00:00:00 -0400","authorID":"http://ehealthforum.com/health/user_profile_728017.html"}],"URL":"http://ehealthforum.com/health/attachment-issues-t444849.html"}