{"title":"burst into tears over nothing or simple things.","thread":[{"content":"I fill as if I might be depressed. Sometimes I burst into tears over nothing or simple things. Sometimes it's over real things. I often tell myself I can't do anything right, and I think my parents might be bullying me. They yell at me all the time and I was not born with thick skin and cry when I'm upset. They yell at me over silly things and often make me do a lot of extra works over my older siblings. I'm 18, and about to go to college but they treat me like I'm less. nothing sounds good anymore, food, and even going anywhere or doing things. Help!","author":"DoctorQuestion","postID":"post1866421","date":"20150721-00:00:00 -0400","authorID":"http://ehealthforum.com/health/user_profile_55473.html"},{"content":"Welcome to e health forum. From your history, it is indicative that you have severe anxiety disorder. You may be overwhelmed at your young age, due to the guidance and advice your parents might be giving you. This time of your youth is when you will build your character which will help you grow up into a adult who can be successful in all aspects of life - be it career, family life and ability to build good relationship with all people. You have to realize that it is a gift that you have your parents and siblings and not all alone by yourself in this world. So your childhood and teenage life will help you build your adult personality. If you cannot manage your relation with your own parents and siblings, you will have a terrible time living your life when you grow up. When you are not comfortable or troubled, be calm and take a short nap, which will help you relax. Think about the situation once you are relaxed and if needed speak to your parents or siblings, and seek a proper resolution of the problem. Do not let conflicts or issues fester for a long time. This might lead to resentment and might destroy interpersonal relationships. In addition, Its said, that \" A idle mind is a devil's workshop\". In your case, if you are not engaged in any activity, your mind will definitely get occupied by unwanted thoughts and this may cause anxiety and panic. To avoid such issues you should involve yourself in activities that will keep you occupied and also help you keep calm. Some such activities includes - Gardening, pet care, painting, physical fitness activities like cycling, working out in the gym, and others which you may be interested in. Most of such activities will relieve your stress and help you manage your anxiety disorder. You may also speak to your elders ( grandparents, uncle, aunt, etc) and seek proper guidance and advice. If this does not work seek proper help from a psychiatrist. I hope this helps.","author":"Deepak Anvekar","replyTo":"post1866421","postID":"post1866466","date":"20150721-00:00:00 -0400","authorID":"http://ehealthforum.com/health/user_profile_322742.html"}],"URL":"http://ehealthforum.com/health/burst-into-tears-over-nothing-or-simple-things-t457167.html"}