{"title":"Is this problem mental or body health related?","thread":[{"content":"The patient is 40 years old, without a pathologically personal case history, with a family background history of mental disorder and alcoholism (father, grandparents ). She confirms the beginning of the disease happened suddenly , 9 years ago, with pain located in the lower back, without spreading further, in conditions of high stress (after a divorce). Investigations didn’t show a diagnostic to justify the symptoms. The treatment in this timeframe was based on plants, Reike procedures in a specialised centre, acupuncture but without any improvement of the symptoms. In 09.2010 she was hospitalised with the supposition of Lyme disease, but after further investigations the supposition was denied. The patient had discontinuous dysfunctionality for the lower body part, but still capable of reflexes (she was able to drive a car) She didn’t follow any medical treatment , the patient was not confirming the disease. She is now immobilised with muscle spasm and paresthesia on the posterior chest level. She was recommended kinesiotherapy sessions which she does not accept, considering that the disease is actually a negative energy that will go away by itself. In October 2014, the neurologic investigation, doctors infirm Multiple Sclerosis and recommend a psychiatric consultations. The psychiatric consultation, done without the presence of the patient, determined that the diagnostic is major depressive disorder and recommended a treatment with Olanzapine which was administrated for one month with a slightly improvement of the symptoms and mind state, the patient started to accept beginning sessions of kinesiotherapy.","author":"pentrualinam","postID":"post1858614","date":"20150531-00:00:00 -0400","authorID":"http://ehealthforum.com/health/user_profile_724346.html"},{"content":"This patient needs a GOOD neurological evaluation-it sounds like lyme was considered for neurological reasons and ??? what led to the MS diagnosis. Depression is a result of chronic illness quite often and we see the depression getting treated but the illness undiagnosed. There is not enough data here to make an informed guess. 1. Neuro evel mandatory. 2. Good psychiatric eval mandatory. Then you go from there.","author":"Dr. Kim Crawford","replyTo":"post1858614","postID":"post1866092","date":"20150719-00:00:00 -0400","authorID":"http://ehealthforum.com/health/user_profile_728017.html"}],"URL":"http://ehealthforum.com/health/is-this-problem-mental-or-body-health-related-t454559.html"}